adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Register: CRYPTOCELL_ENABLE */
/* Description: Control power and clock for CRYPTOCELL subsystem */

/* Bit 0 : Enable or disable the CRYPTOCELL subsystem */
#define CRYPTOCELL_ENABLE_ENABLE_Pos (0UL) /*!< Position of ENABLE field. */
#define CRYPTOCELL_ENABLE_ENABLE_Msk (0x1UL << CRYPTOCELL_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define CRYPTOCELL_ENABLE_ENABLE_Disabled (0UL) /*!< CRYPTOCELL subsystem disabled */
#define CRYPTOCELL_ENABLE_ENABLE_Enabled (1UL) /*!< CRYPTOCELL subsystem enabled */

/* Register: CRYPTOCELL_RESET */
/* Description: Perform an external reset of the CRYPTOCELL subsystem. */

/* Bit 0 : Reset CRYPTOCELL subsystem */
#define CRYPTOCELL_RESET_RESET_Pos (0UL) /*!< Position of RESET field. */
#define CRYPTOCELL_RESET_RESET_Msk (0x1UL << CRYPTOCELL_RESET_RESET_Pos) /*!< Bit mask of RESET field. */
#define CRYPTOCELL_RESET_RESET_Disabled (0UL) /*!< CRYPTOCELL subsystem normal operation */
#define CRYPTOCELL_RESET_RESET_Enabled (1UL) /*!< Perform CRYPTOCELL subsystem reset */

/* Register: CRYPTOCELL_IRQ_STATUS */
/* Description: Holds the interrupt status from the CRYPTOCELL subsystems. */

/* Bit 0 : A read will return the current status of the CRYPTOCELL interrupt signal */
#define CRYPTOCELL_IRQ_STATUS_IRQ_STATUS_Pos (0UL) /*!< Position of IRQ_STATUS field. */
#define CRYPTOCELL_IRQ_STATUS_IRQ_STATUS_Msk (0x1UL << CRYPTOCELL_IRQ_STATUS_IRQ_STATUS_Pos) /*!< Bit mask of IRQ_STATUS field. */

/* Register: CRYPTOCELL_TSEL */
/* Description: Timing select (TSEL) settings for CRYPTOCELL dedicated PKA and RNG SRAM blocks. */

/* Bits 5..4 : Control timing for RNG SRAM block */
#define CRYPTOCELL_TSEL_RNGSRAM_Pos (4UL) /*!< Position of RNGSRAM field. */
#define CRYPTOCELL_TSEL_RNGSRAM_Msk (0x3UL << CRYPTOCELL_TSEL_RNGSRAM_Pos) /*!< Bit mask of RNGSRAM field. */

/* Bits 1..0 : Control timing for PKA SRAM block */
#define CRYPTOCELL_TSEL_PKASRAM_Pos (0UL) /*!< Position of PKASRAM field. */
#define CRYPTOCELL_TSEL_PKASRAM_Msk (0x3UL << CRYPTOCELL_TSEL_PKASRAM_Pos) /*!< Bit mask of PKASRAM field. */


/* Peripheral: CTRLAPPERI */
/* Description: Control access port 0 */

/* Register: CTRLAPPERI_CTRLDAP2COREDATA */
/* Description: Data sent from the Debugger to the Core */

/* Bits 31..0 : General Data */
#define CTRLAPPERI_CTRLDAP2COREDATA_DATA_Pos (0UL) /*!< Position of DATA field. */
#define CTRLAPPERI_CTRLDAP2COREDATA_DATA_Msk (0xFFFFFFFFUL << CTRLAPPERI_CTRLDAP2COREDATA_DATA_Pos) /*!< Bit mask of DATA field. */

/* Register: CTRLAPPERI_CTRLDAP2CORESTATUS */
/* Description: Status to indicate if Data sent from the Debugger to the Core has been read */

/* Bit 0 : Status of data in CTRLDAP2COREDATA register */
#define CTRLAPPERI_CTRLDAP2CORESTATUS_STATUS_Pos (0UL) /*!< Position of STATUS field. */
#define CTRLAPPERI_CTRLDAP2CORESTATUS_STATUS_Msk (0x1UL << CTRLAPPERI_CTRLDAP2CORESTATUS_STATUS_Pos) /*!< Bit mask of STATUS field. */
#define CTRLAPPERI_CTRLDAP2CORESTATUS_STATUS_NoDataPending (0UL) /*!< No data pending in CTRLDAP2COREDATA */
#define CTRLAPPERI_CTRLDAP2CORESTATUS_STATUS_DataPending (1UL) /*!< Data pending in CTRLDAP2COREDATA */

/* Register: CTRLAPPERI_CORE2CTRLDAPDATA */
/* Description: Data sent from the Core to the Debugger */

/* Bits 31..0 : General Data */
#define CTRLAPPERI_CORE2CTRLDAPDATA_DATA_Pos (0UL) /*!< Position of DATA field. */
#define CTRLAPPERI_CORE2CTRLDAPDATA_DATA_Msk (0xFFFFFFFFUL << CTRLAPPERI_CORE2CTRLDAPDATA_DATA_Pos) /*!< Bit mask of DATA field. */

/* Register: CTRLAPPERI_CORE2CTRLDAPSTATUS */
/* Description: Status to indicate if Data sent from the Core to the Debugger status has been read */

/* Bit 0 : Status of data in CORE2CTRLDAPDATA register */
#define CTRLAPPERI_CORE2CTRLDAPSTATUS_STATUS_Pos (0UL) /*!< Position of STATUS field. */
#define CTRLAPPERI_CORE2CTRLDAPSTATUS_STATUS_Msk (0x1UL << CTRLAPPERI_CORE2CTRLDAPSTATUS_STATUS_Pos) /*!< Bit mask of STATUS field. */
#define CTRLAPPERI_CORE2CTRLDAPSTATUS_STATUS_NoDataPending (0UL) /*!< No data pending in CTRLDAP2COREDATA */
#define CTRLAPPERI_CORE2CTRLDAPSTATUS_STATUS_DataPending (1UL) /*!< Data pending in CTRLDAP2COREDATA */

/* Register: CTRLAPPERI_CPURETURNFIELD_LOCK */
/* Description: Lock Mail Box erase all mechanism */

/* Bit 0 : Enable or disable the erase all mechanism for return field case. A write once register. */
#define CTRLAPPERI_CPURETURNFIELD_LOCK_LOCK_Pos (0UL) /*!< Position of LOCK field. */
#define CTRLAPPERI_CPURETURNFIELD_LOCK_LOCK_Msk (0x1UL << CTRLAPPERI_CPURETURNFIELD_LOCK_LOCK_Pos) /*!< Bit mask of LOCK field. */
#define CTRLAPPERI_CPURETURNFIELD_LOCK_LOCK_Enabled (0UL) /*!< Eraseall for return field can be issued */
#define CTRLAPPERI_CPURETURNFIELD_LOCK_LOCK_Disabled (1UL) /*!< Eraseall for return field is locked */

/* Register: CTRLAPPERI_CPURETURNFIELD */
/* Description: Mail box erase all control register. A write once register. */

/* Bits 31..0 : Random value to generate a eraseall for return field case. */
#define CTRLAPPERI_CPURETURNFIELD_STATUS_Pos (0UL) /*!< Position of STATUS field. */
#define CTRLAPPERI_CPURETURNFIELD_STATUS_Msk (0xFFFFFFFFUL << CTRLAPPERI_CPURETURNFIELD_STATUS_Pos) /*!< Bit mask of STATUS field. */


/* Peripheral: DCNF */
/* Description: Domain Configuration Management 0 */

/* Register: DCNF_EVENTS_FPUIOC */
/* Description: Invalid Operation exception. */

/* Bit 0 : Invalid Operation exception. */
#define DCNF_EVENTS_FPUIOC_EVENTS_FPUIOC_Pos (0UL) /*!< Position of EVENTS_FPUIOC field. */
#define DCNF_EVENTS_FPUIOC_EVENTS_FPUIOC_Msk (0x1UL << DCNF_EVENTS_FPUIOC_EVENTS_FPUIOC_Pos) /*!< Bit mask of EVENTS_FPUIOC field. */
#define DCNF_EVENTS_FPUIOC_EVENTS_FPUIOC_NotGenerated (0UL) /*!< Event not generated */
#define DCNF_EVENTS_FPUIOC_EVENTS_FPUIOC_Generated (1UL) /*!< Event generated */

/* Register: DCNF_EVENTS_FPUDZC */
/* Description: Division by Zero exception. */

/* Bit 0 : Division by Zero exception. */
#define DCNF_EVENTS_FPUDZC_EVENTS_FPUDZC_Pos (0UL) /*!< Position of EVENTS_FPUDZC field. */
#define DCNF_EVENTS_FPUDZC_EVENTS_FPUDZC_Msk (0x1UL << DCNF_EVENTS_FPUDZC_EVENTS_FPUDZC_Pos) /*!< Bit mask of EVENTS_FPUDZC field. */
#define DCNF_EVENTS_FPUDZC_EVENTS_FPUDZC_NotGenerated (0UL) /*!< Event not generated */
#define DCNF_EVENTS_FPUDZC_EVENTS_FPUDZC_Generated (1UL) /*!< Event generated */

/* Register: DCNF_EVENTS_FPUOFC */
/* Description: Overflow exception. */

