adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Bit 0 : Overflow exception. */
#define DCNF_EVENTS_FPUOFC_EVENTS_FPUOFC_Pos (0UL) /*!< Position of EVENTS_FPUOFC field. */
#define DCNF_EVENTS_FPUOFC_EVENTS_FPUOFC_Msk (0x1UL << DCNF_EVENTS_FPUOFC_EVENTS_FPUOFC_Pos) /*!< Bit mask of EVENTS_FPUOFC field. */
#define DCNF_EVENTS_FPUOFC_EVENTS_FPUOFC_NotGenerated (0UL) /*!< Event not generated */
#define DCNF_EVENTS_FPUOFC_EVENTS_FPUOFC_Generated (1UL) /*!< Event generated */

/* Register: DCNF_EVENTS_FPUUFC */
/* Description: Underflow exception. */

/* Bit 0 : Underflow exception. */
#define DCNF_EVENTS_FPUUFC_EVENTS_FPUUFC_Pos (0UL) /*!< Position of EVENTS_FPUUFC field. */
#define DCNF_EVENTS_FPUUFC_EVENTS_FPUUFC_Msk (0x1UL << DCNF_EVENTS_FPUUFC_EVENTS_FPUUFC_Pos) /*!< Bit mask of EVENTS_FPUUFC field. */
#define DCNF_EVENTS_FPUUFC_EVENTS_FPUUFC_NotGenerated (0UL) /*!< Event not generated */
#define DCNF_EVENTS_FPUUFC_EVENTS_FPUUFC_Generated (1UL) /*!< Event generated */

/* Register: DCNF_EVENTS_FPUIXC */
/* Description: Inexact exception. */

/* Bit 0 : Inexact exception. */
#define DCNF_EVENTS_FPUIXC_EVENTS_FPUIXC_Pos (0UL) /*!< Position of EVENTS_FPUIXC field. */
#define DCNF_EVENTS_FPUIXC_EVENTS_FPUIXC_Msk (0x1UL << DCNF_EVENTS_FPUIXC_EVENTS_FPUIXC_Pos) /*!< Bit mask of EVENTS_FPUIXC field. */
#define DCNF_EVENTS_FPUIXC_EVENTS_FPUIXC_NotGenerated (0UL) /*!< Event not generated */
#define DCNF_EVENTS_FPUIXC_EVENTS_FPUIXC_Generated (1UL) /*!< Event generated */

/* Register: DCNF_EVENTS_FPUIDC */
/* Description: Input Denormal exception. */

/* Bit 0 : Input Denormal exception. */
#define DCNF_EVENTS_FPUIDC_EVENTS_FPUIDC_Pos (0UL) /*!< Position of EVENTS_FPUIDC field. */
#define DCNF_EVENTS_FPUIDC_EVENTS_FPUIDC_Msk (0x1UL << DCNF_EVENTS_FPUIDC_EVENTS_FPUIDC_Pos) /*!< Bit mask of EVENTS_FPUIDC field. */
#define DCNF_EVENTS_FPUIDC_EVENTS_FPUIDC_NotGenerated (0UL) /*!< Event not generated */
#define DCNF_EVENTS_FPUIDC_EVENTS_FPUIDC_Generated (1UL) /*!< Event generated */

/* Register: DCNF_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 5 : Enable or disable interrupt for event FPUIDC */
#define DCNF_INTEN_FPUIDC_Pos (5UL) /*!< Position of FPUIDC field. */
#define DCNF_INTEN_FPUIDC_Msk (0x1UL << DCNF_INTEN_FPUIDC_Pos) /*!< Bit mask of FPUIDC field. */
#define DCNF_INTEN_FPUIDC_Disabled (0UL) /*!< Disable */
#define DCNF_INTEN_FPUIDC_Enabled (1UL) /*!< Enable */

/* Bit 4 : Enable or disable interrupt for event FPUIXC */
#define DCNF_INTEN_FPUIXC_Pos (4UL) /*!< Position of FPUIXC field. */
#define DCNF_INTEN_FPUIXC_Msk (0x1UL << DCNF_INTEN_FPUIXC_Pos) /*!< Bit mask of FPUIXC field. */
#define DCNF_INTEN_FPUIXC_Disabled (0UL) /*!< Disable */
#define DCNF_INTEN_FPUIXC_Enabled (1UL) /*!< Enable */

/* Bit 3 : Enable or disable interrupt for event FPUUFC */
#define DCNF_INTEN_FPUUFC_Pos (3UL) /*!< Position of FPUUFC field. */
#define DCNF_INTEN_FPUUFC_Msk (0x1UL << DCNF_INTEN_FPUUFC_Pos) /*!< Bit mask of FPUUFC field. */
#define DCNF_INTEN_FPUUFC_Disabled (0UL) /*!< Disable */
#define DCNF_INTEN_FPUUFC_Enabled (1UL) /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event FPUOFC */
#define DCNF_INTEN_FPUOFC_Pos (2UL) /*!< Position of FPUOFC field. */
#define DCNF_INTEN_FPUOFC_Msk (0x1UL << DCNF_INTEN_FPUOFC_Pos) /*!< Bit mask of FPUOFC field. */
#define DCNF_INTEN_FPUOFC_Disabled (0UL) /*!< Disable */
#define DCNF_INTEN_FPUOFC_Enabled (1UL) /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event FPUDZC */
#define DCNF_INTEN_FPUDZC_Pos (1UL) /*!< Position of FPUDZC field. */
#define DCNF_INTEN_FPUDZC_Msk (0x1UL << DCNF_INTEN_FPUDZC_Pos) /*!< Bit mask of FPUDZC field. */
#define DCNF_INTEN_FPUDZC_Disabled (0UL) /*!< Disable */
#define DCNF_INTEN_FPUDZC_Enabled (1UL) /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event FPUIOC */
#define DCNF_INTEN_FPUIOC_Pos (0UL) /*!< Position of FPUIOC field. */
#define DCNF_INTEN_FPUIOC_Msk (0x1UL << DCNF_INTEN_FPUIOC_Pos) /*!< Bit mask of FPUIOC field. */
#define DCNF_INTEN_FPUIOC_Disabled (0UL) /*!< Disable */
#define DCNF_INTEN_FPUIOC_Enabled (1UL) /*!< Enable */

/* Register: DCNF_INTENSET */
/* Description: Enable interrupt */

/* Bit 5 : Write '1' to enable interrupt for event FPUIDC */
#define DCNF_INTENSET_FPUIDC_Pos (5UL) /*!< Position of FPUIDC field. */
#define DCNF_INTENSET_FPUIDC_Msk (0x1UL << DCNF_INTENSET_FPUIDC_Pos) /*!< Bit mask of FPUIDC field. */
#define DCNF_INTENSET_FPUIDC_Disabled (0UL) /*!< Read: Disabled */
#define DCNF_INTENSET_FPUIDC_Enabled (1UL) /*!< Read: Enabled */
#define DCNF_INTENSET_FPUIDC_Set (1UL) /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event FPUIXC */
#define DCNF_INTENSET_FPUIXC_Pos (4UL) /*!< Position of FPUIXC field. */
#define DCNF_INTENSET_FPUIXC_Msk (0x1UL << DCNF_INTENSET_FPUIXC_Pos) /*!< Bit mask of FPUIXC field. */
#define DCNF_INTENSET_FPUIXC_Disabled (0UL) /*!< Read: Disabled */
#define DCNF_INTENSET_FPUIXC_Enabled (1UL) /*!< Read: Enabled */
#define DCNF_INTENSET_FPUIXC_Set (1UL) /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event FPUUFC */
#define DCNF_INTENSET_FPUUFC_Pos (3UL) /*!< Position of FPUUFC field. */
#define DCNF_INTENSET_FPUUFC_Msk (0x1UL << DCNF_INTENSET_FPUUFC_Pos) /*!< Bit mask of FPUUFC field. */
#define DCNF_INTENSET_FPUUFC_Disabled (0UL) /*!< Read: Disabled */
#define DCNF_INTENSET_FPUUFC_Enabled (1UL) /*!< Read: Enabled */
#define DCNF_INTENSET_FPUUFC_Set (1UL) /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event FPUOFC */
#define DCNF_INTENSET_FPUOFC_Pos (2UL) /*!< Position of FPUOFC field. */
#define DCNF_INTENSET_FPUOFC_Msk (0x1UL << DCNF_INTENSET_FPUOFC_Pos) /*!< Bit mask of FPUOFC field. */
#define DCNF_INTENSET_FPUOFC_Disabled (0UL) /*!< Read: Disabled */
#define DCNF_INTENSET_FPUOFC_Enabled (1UL) /*!< Read: Enabled */
#define DCNF_INTENSET_FPUOFC_Set (1UL) /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event FPUDZC */
#define DCNF_INTENSET_FPUDZC_Pos (1UL) /*!< Position of FPUDZC field. */
#define DCNF_INTENSET_FPUDZC_Msk (0x1UL << DCNF_INTENSET_FPUDZC_Pos) /*!< Bit mask of FPUDZC field. */
#define DCNF_INTENSET_FPUDZC_Disabled (0UL) /*!< Read: Disabled */
#define DCNF_INTENSET_FPUDZC_Enabled (1UL) /*!< Read: Enabled */
#define DCNF_INTENSET_FPUDZC_Set (1UL) /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event FPUIOC */
#define DCNF_INTENSET_FPUIOC_Pos (0UL) /*!< Position of FPUIOC field. */
#define DCNF_INTENSET_FPUIOC_Msk (0x1UL << DCNF_INTENSET_FPUIOC_Pos) /*!< Bit mask of FPUIOC field. */
#define DCNF_INTENSET_FPUIOC_Disabled (0UL) /*!< Read: Disabled */
#define DCNF_INTENSET_FPUIOC_Enabled (1UL) /*!< Read: Enabled */
#define DCNF_INTENSET_FPUIOC_Set (1UL) /*!< Enable */

