adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Register: DCNF_INTENCLR */
/* Description: Disable interrupt */

/* Bit 5 : Write '1' to disable interrupt for event FPUIDC */
#define DCNF_INTENCLR_FPUIDC_Pos (5UL) /*!< Position of FPUIDC field. */
#define DCNF_INTENCLR_FPUIDC_Msk (0x1UL << DCNF_INTENCLR_FPUIDC_Pos) /*!< Bit mask of FPUIDC field. */
#define DCNF_INTENCLR_FPUIDC_Disabled (0UL) /*!< Read: Disabled */
#define DCNF_INTENCLR_FPUIDC_Enabled (1UL) /*!< Read: Enabled */
#define DCNF_INTENCLR_FPUIDC_Clear (1UL) /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event FPUIXC */
#define DCNF_INTENCLR_FPUIXC_Pos (4UL) /*!< Position of FPUIXC field. */
#define DCNF_INTENCLR_FPUIXC_Msk (0x1UL << DCNF_INTENCLR_FPUIXC_Pos) /*!< Bit mask of FPUIXC field. */
#define DCNF_INTENCLR_FPUIXC_Disabled (0UL) /*!< Read: Disabled */
#define DCNF_INTENCLR_FPUIXC_Enabled (1UL) /*!< Read: Enabled */
#define DCNF_INTENCLR_FPUIXC_Clear (1UL) /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event FPUUFC */
#define DCNF_INTENCLR_FPUUFC_Pos (3UL) /*!< Position of FPUUFC field. */
#define DCNF_INTENCLR_FPUUFC_Msk (0x1UL << DCNF_INTENCLR_FPUUFC_Pos) /*!< Bit mask of FPUUFC field. */
#define DCNF_INTENCLR_FPUUFC_Disabled (0UL) /*!< Read: Disabled */
#define DCNF_INTENCLR_FPUUFC_Enabled (1UL) /*!< Read: Enabled */
#define DCNF_INTENCLR_FPUUFC_Clear (1UL) /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event FPUOFC */
#define DCNF_INTENCLR_FPUOFC_Pos (2UL) /*!< Position of FPUOFC field. */
#define DCNF_INTENCLR_FPUOFC_Msk (0x1UL << DCNF_INTENCLR_FPUOFC_Pos) /*!< Bit mask of FPUOFC field. */
#define DCNF_INTENCLR_FPUOFC_Disabled (0UL) /*!< Read: Disabled */
#define DCNF_INTENCLR_FPUOFC_Enabled (1UL) /*!< Read: Enabled */
#define DCNF_INTENCLR_FPUOFC_Clear (1UL) /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event FPUDZC */
#define DCNF_INTENCLR_FPUDZC_Pos (1UL) /*!< Position of FPUDZC field. */
#define DCNF_INTENCLR_FPUDZC_Msk (0x1UL << DCNF_INTENCLR_FPUDZC_Pos) /*!< Bit mask of FPUDZC field. */
#define DCNF_INTENCLR_FPUDZC_Disabled (0UL) /*!< Read: Disabled */
#define DCNF_INTENCLR_FPUDZC_Enabled (1UL) /*!< Read: Enabled */
#define DCNF_INTENCLR_FPUDZC_Clear (1UL) /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event FPUIOC */
#define DCNF_INTENCLR_FPUIOC_Pos (0UL) /*!< Position of FPUIOC field. */
#define DCNF_INTENCLR_FPUIOC_Msk (0x1UL << DCNF_INTENCLR_FPUIOC_Pos) /*!< Bit mask of FPUIOC field. */
#define DCNF_INTENCLR_FPUIOC_Disabled (0UL) /*!< Read: Disabled */
#define DCNF_INTENCLR_FPUIOC_Enabled (1UL) /*!< Read: Enabled */
#define DCNF_INTENCLR_FPUIOC_Clear (1UL) /*!< Disable */

/* Register: DCNF_CPUID */
/* Description: CPU number in the system */

/* Bits 7..0 : CPU number in the system */
#define DCNF_CPUID_CPUID_Pos (0UL) /*!< Position of CPUID field. */
#define DCNF_CPUID_CPUID_Msk (0xFFUL << DCNF_CPUID_CPUID_Pos) /*!< Bit mask of CPUID field. */

/* Register: DCNF_EXTPERI_PROTECT */
/* Description: Description cluster: Control access for Master connected to AMLI master port EXTPERI[n] */

/* Bits 2..0 : Control access to peripherals from master EXTPERI[n]. */
#define DCNF_EXTPERI_PROTECT_SLAVE_Pos (0UL) /*!< Position of SLAVE field. */
#define DCNF_EXTPERI_PROTECT_SLAVE_Msk (0x7UL << DCNF_EXTPERI_PROTECT_SLAVE_Pos) /*!< Bit mask of SLAVE field. */
#define DCNF_EXTPERI_PROTECT_SLAVE_Allowed (0UL) /*!< Access to peripherals is allowed */
#define DCNF_EXTPERI_PROTECT_SLAVE_Blocked (0x7UL) /*!< Access to peripherals is blocked */

/* Register: DCNF_EXTRAM_PROTECT */
/* Description: Description cluster: Control access from  Master connected to AMLI master port EXTRAM[n] */

/* Bit 1 : Control access to slave 1 of master EXTRAM[n]. */
#define DCNF_EXTRAM_PROTECT_SLAVE1_Pos (1UL) /*!< Position of SLAVE1 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE1_Msk (0x1UL << DCNF_EXTRAM_PROTECT_SLAVE1_Pos) /*!< Bit mask of SLAVE1 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE1_Allowed (0UL) /*!< Access to slave is possible */
#define DCNF_EXTRAM_PROTECT_SLAVE1_Blocked (1UL) /*!< Access to slave is blocked */

/* Bit 0 : Control access to slave 0 of master EXTRAM[n]. */
#define DCNF_EXTRAM_PROTECT_SLAVE0_Pos (0UL) /*!< Position of SLAVE0 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE0_Msk (0x1UL << DCNF_EXTRAM_PROTECT_SLAVE0_Pos) /*!< Bit mask of SLAVE0 field. */
#define DCNF_EXTRAM_PROTECT_SLAVE0_Allowed (0UL) /*!< Access to slave is possible */
#define DCNF_EXTRAM_PROTECT_SLAVE0_Blocked (1UL) /*!< Access to slave is blocked */

/* Register: DCNF_EXTCODE_PROTECT */
/* Description: Description cluster: Control access from  Master connected to AMLI master port EXTCODE[n] */

/* Bit 0 : Control access to slave  0 of master EXTCODE[n]. */
#define DCNF_EXTCODE_PROTECT_SLAVE0_Pos (0UL) /*!< Position of SLAVE0 field. */
#define DCNF_EXTCODE_PROTECT_SLAVE0_Msk (0x1UL << DCNF_EXTCODE_PROTECT_SLAVE0_Pos) /*!< Bit mask of SLAVE0 field. */
#define DCNF_EXTCODE_PROTECT_SLAVE0_Allowed (0UL) /*!< Access to slave is possible */
#define DCNF_EXTCODE_PROTECT_SLAVE0_Blocked (1UL) /*!< Access to slave is blocked */

/* Register: DCNF_FPGA_SVNREVISION */
/* Description: SVN revision */

/* Bits 31..0 : SVN revision */
#define DCNF_FPGA_SVNREVISION_SVNREVISION_Pos (0UL) /*!< Position of SVNREVISION field. */
#define DCNF_FPGA_SVNREVISION_SVNREVISION_Msk (0xFFFFFFFFUL << DCNF_FPGA_SVNREVISION_SVNREVISION_Pos) /*!< Bit mask of SVNREVISION field. */

/* Register: DCNF_FPGA_OFFICIAL */
/* Description: Official release */

/* Bit 0 : Official release */
#define DCNF_FPGA_OFFICIAL_OFFICIAL_Pos (0UL) /*!< Position of OFFICIAL field. */
#define DCNF_FPGA_OFFICIAL_OFFICIAL_Msk (0x1UL << DCNF_FPGA_OFFICIAL_OFFICIAL_Pos) /*!< Bit mask of OFFICIAL field. */
#define DCNF_FPGA_OFFICIAL_OFFICIAL_NotOfficial (0UL) /*!< Not official */
#define DCNF_FPGA_OFFICIAL_OFFICIAL_Official (1UL) /*!< Official */

/* Register: DCNF_FPGA_RELEASEID0 */
/* Description: Release ID string */

/* Bits 31..24 : Release ID string byte 3 */
#define DCNF_FPGA_RELEASEID0_BYTE3_Pos (24UL) /*!< Position of BYTE3 field. */
#define DCNF_FPGA_RELEASEID0_BYTE3_Msk (0xFFUL << DCNF_FPGA_RELEASEID0_BYTE3_Pos) /*!< Bit mask of BYTE3 field. */

/* Bits 23..16 : Release ID string byte 2 */
#define DCNF_FPGA_RELEASEID0_BYTE2_Pos (16UL) /*!< Position of BYTE2 field. */
#define DCNF_FPGA_RELEASEID0_BYTE2_Msk (0xFFUL << DCNF_FPGA_RELEASEID0_BYTE2_Pos) /*!< Bit mask of BYTE2 field. */

/* Bits 15..8 : Release ID string byte 1 */
#define DCNF_FPGA_RELEASEID0_BYTE1_Pos (8UL) /*!< Position of BYTE1 field. */
#define DCNF_FPGA_RELEASEID0_BYTE1_Msk (0xFFUL << DCNF_FPGA_RELEASEID0_BYTE1_Pos) /*!< Bit mask of BYTE1 field. */

