adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Bits 7..0 : Release ID string byte 0 */
#define DCNF_FPGA_RELEASEID0_BYTE0_Pos (0UL) /*!< Position of BYTE0 field. */
#define DCNF_FPGA_RELEASEID0_BYTE0_Msk (0xFFUL << DCNF_FPGA_RELEASEID0_BYTE0_Pos) /*!< Bit mask of BYTE0 field. */

/* Register: DCNF_FPGA_RELEASEID1 */
/* Description: Release ID string */

/* Bits 31..24 : Release ID string byte 7 */
#define DCNF_FPGA_RELEASEID1_BYTE7_Pos (24UL) /*!< Position of BYTE7 field. */
#define DCNF_FPGA_RELEASEID1_BYTE7_Msk (0xFFUL << DCNF_FPGA_RELEASEID1_BYTE7_Pos) /*!< Bit mask of BYTE7 field. */

/* Bits 23..16 : Release ID string byte 6 */
#define DCNF_FPGA_RELEASEID1_BYTE6_Pos (16UL) /*!< Position of BYTE6 field. */
#define DCNF_FPGA_RELEASEID1_BYTE6_Msk (0xFFUL << DCNF_FPGA_RELEASEID1_BYTE6_Pos) /*!< Bit mask of BYTE6 field. */

/* Bits 15..8 : Release ID string byte 5 */
#define DCNF_FPGA_RELEASEID1_BYTE5_Pos (8UL) /*!< Position of BYTE5 field. */
#define DCNF_FPGA_RELEASEID1_BYTE5_Msk (0xFFUL << DCNF_FPGA_RELEASEID1_BYTE5_Pos) /*!< Bit mask of BYTE5 field. */

/* Bits 7..0 : Release ID string byte 4 */
#define DCNF_FPGA_RELEASEID1_BYTE4_Pos (0UL) /*!< Position of BYTE4 field. */
#define DCNF_FPGA_RELEASEID1_BYTE4_Msk (0xFFUL << DCNF_FPGA_RELEASEID1_BYTE4_Pos) /*!< Bit mask of BYTE4 field. */

/* Register: DCNF_FPGA_JOBNUMBER */
/* Description: Jenkins job number */

/* Bits 31..0 : Jenkins job number */
#define DCNF_FPGA_JOBNUMBER_JOBNUMBER_Pos (0UL) /*!< Position of JOBNUMBER field. */
#define DCNF_FPGA_JOBNUMBER_JOBNUMBER_Msk (0xFFFFFFFFUL << DCNF_FPGA_JOBNUMBER_JOBNUMBER_Pos) /*!< Bit mask of JOBNUMBER field. */

/* Register: DCNF_AMLICLOCKDELAY */
/* Description: AMLI clock delay */

/* Bits 5..0 : AMLI clock delay */
#define DCNF_AMLICLOCKDELAY_AMLICLOCKDELAY_Pos (0UL) /*!< Position of AMLICLOCKDELAY field. */
#define DCNF_AMLICLOCKDELAY_AMLICLOCKDELAY_Msk (0x3FUL << DCNF_AMLICLOCKDELAY_AMLICLOCKDELAY_Pos) /*!< Bit mask of AMLICLOCKDELAY field. */


/* Peripheral: DPPIC */
/* Description: Distributed Programmable Peripheral Interconnect Controller 0 */

/* Register: DPPIC_TASKS_CHG_EN */
/* Description: Description cluster: Enable channel group n */

/* Bit 0 : Enable channel group n */
#define DPPIC_TASKS_CHG_EN_EN_Pos (0UL) /*!< Position of EN field. */
#define DPPIC_TASKS_CHG_EN_EN_Msk (0x1UL << DPPIC_TASKS_CHG_EN_EN_Pos) /*!< Bit mask of EN field. */
#define DPPIC_TASKS_CHG_EN_EN_Trigger (1UL) /*!< Trigger task */

/* Register: DPPIC_TASKS_CHG_DIS */
/* Description: Description cluster: Disable channel group n */

/* Bit 0 : Disable channel group n */
#define DPPIC_TASKS_CHG_DIS_DIS_Pos (0UL) /*!< Position of DIS field. */
#define DPPIC_TASKS_CHG_DIS_DIS_Msk (0x1UL << DPPIC_TASKS_CHG_DIS_DIS_Pos) /*!< Bit mask of DIS field. */
#define DPPIC_TASKS_CHG_DIS_DIS_Trigger (1UL) /*!< Trigger task */

/* Register: DPPIC_SUBSCRIBE_CHG_EN */
/* Description: Description cluster: Subscribe configuration for task CHG[n].EN */

/* Bit 31 :   */
#define DPPIC_SUBSCRIBE_CHG_EN_EN_Pos (31UL) /*!< Position of EN field. */
#define DPPIC_SUBSCRIBE_CHG_EN_EN_Msk (0x1UL << DPPIC_SUBSCRIBE_CHG_EN_EN_Pos) /*!< Bit mask of EN field. */
#define DPPIC_SUBSCRIBE_CHG_EN_EN_Disabled (0UL) /*!< Disable subscription */
#define DPPIC_SUBSCRIBE_CHG_EN_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 4..0 : Channel that task CHG[n].EN will subscribe to */
#define DPPIC_SUBSCRIBE_CHG_EN_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define DPPIC_SUBSCRIBE_CHG_EN_CHIDX_Msk (0x1FUL << DPPIC_SUBSCRIBE_CHG_EN_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: DPPIC_SUBSCRIBE_CHG_DIS */
/* Description: Description cluster: Subscribe configuration for task CHG[n].DIS */

/* Bit 31 :   */
#define DPPIC_SUBSCRIBE_CHG_DIS_EN_Pos (31UL) /*!< Position of EN field. */
#define DPPIC_SUBSCRIBE_CHG_DIS_EN_Msk (0x1UL << DPPIC_SUBSCRIBE_CHG_DIS_EN_Pos) /*!< Bit mask of EN field. */
#define DPPIC_SUBSCRIBE_CHG_DIS_EN_Disabled (0UL) /*!< Disable subscription */
#define DPPIC_SUBSCRIBE_CHG_DIS_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 4..0 : Channel that task CHG[n].DIS will subscribe to */
#define DPPIC_SUBSCRIBE_CHG_DIS_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define DPPIC_SUBSCRIBE_CHG_DIS_CHIDX_Msk (0x1FUL << DPPIC_SUBSCRIBE_CHG_DIS_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: DPPIC_CHEN */
/* Description: Channel enable register */

/* Bit 31 : Enable or disable channel 31 */
#define DPPIC_CHEN_CH31_Pos (31UL) /*!< Position of CH31 field. */
#define DPPIC_CHEN_CH31_Msk (0x1UL << DPPIC_CHEN_CH31_Pos) /*!< Bit mask of CH31 field. */
#define DPPIC_CHEN_CH31_Disabled (0UL) /*!< Disable channel */
#define DPPIC_CHEN_CH31_Enabled (1UL) /*!< Enable channel */

/* Bit 30 : Enable or disable channel 30 */
#define DPPIC_CHEN_CH30_Pos (30UL) /*!< Position of CH30 field. */
#define DPPIC_CHEN_CH30_Msk (0x1UL << DPPIC_CHEN_CH30_Pos) /*!< Bit mask of CH30 field. */
#define DPPIC_CHEN_CH30_Disabled (0UL) /*!< Disable channel */
#define DPPIC_CHEN_CH30_Enabled (1UL) /*!< Enable channel */

/* Bit 29 : Enable or disable channel 29 */
#define DPPIC_CHEN_CH29_Pos (29UL) /*!< Position of CH29 field. */
#define DPPIC_CHEN_CH29_Msk (0x1UL << DPPIC_CHEN_CH29_Pos) /*!< Bit mask of CH29 field. */
#define DPPIC_CHEN_CH29_Disabled (0UL) /*!< Disable channel */
#define DPPIC_CHEN_CH29_Enabled (1UL) /*!< Enable channel */

/* Bit 28 : Enable or disable channel 28 */
#define DPPIC_CHEN_CH28_Pos (28UL) /*!< Position of CH28 field. */
#define DPPIC_CHEN_CH28_Msk (0x1UL << DPPIC_CHEN_CH28_Pos) /*!< Bit mask of CH28 field. */
#define DPPIC_CHEN_CH28_Disabled (0UL) /*!< Disable channel */
#define DPPIC_CHEN_CH28_Enabled (1UL) /*!< Enable channel */

/* Bit 27 : Enable or disable channel 27 */
#define DPPIC_CHEN_CH27_Pos (27UL) /*!< Position of CH27 field. */
#define DPPIC_CHEN_CH27_Msk (0x1UL << DPPIC_CHEN_CH27_Pos) /*!< Bit mask of CH27 field. */
#define DPPIC_CHEN_CH27_Disabled (0UL) /*!< Disable channel */
#define DPPIC_CHEN_CH27_Enabled (1UL) /*!< Enable channel */

/* Bit 26 : Enable or disable channel 26 */
#define DPPIC_CHEN_CH26_Pos (26UL) /*!< Position of CH26 field. */
#define DPPIC_CHEN_CH26_Msk (0x1UL << DPPIC_CHEN_CH26_Pos) /*!< Bit mask of CH26 field. */
#define DPPIC_CHEN_CH26_Disabled (0UL) /*!< Disable channel */
#define DPPIC_CHEN_CH26_Enabled (1UL) /*!< Enable channel */

/* Bit 25 : Enable or disable channel 25 */
#define DPPIC_CHEN_CH25_Pos (25UL) /*!< Position of CH25 field. */
#define DPPIC_CHEN_CH25_Msk (0x1UL << DPPIC_CHEN_CH25_Pos) /*!< Bit mask of CH25 field. */
#define DPPIC_CHEN_CH25_Disabled (0UL) /*!< Disable channel */
#define DPPIC_CHEN_CH25_Enabled (1UL) /*!< Enable channel */

