adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Bit 7 : Write '1' to disable interrupt for event TRIGGERED[7] */
#define EGU_INTENCLR_TRIGGERED7_Pos (7UL) /*!< Position of TRIGGERED7 field. */
#define EGU_INTENCLR_TRIGGERED7_Msk (0x1UL << EGU_INTENCLR_TRIGGERED7_Pos) /*!< Bit mask of TRIGGERED7 field. */
#define EGU_INTENCLR_TRIGGERED7_Disabled (0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED7_Enabled (1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED7_Clear (1UL) /*!< Disable */

/* Bit 6 : Write '1' to disable interrupt for event TRIGGERED[6] */
#define EGU_INTENCLR_TRIGGERED6_Pos (6UL) /*!< Position of TRIGGERED6 field. */
#define EGU_INTENCLR_TRIGGERED6_Msk (0x1UL << EGU_INTENCLR_TRIGGERED6_Pos) /*!< Bit mask of TRIGGERED6 field. */
#define EGU_INTENCLR_TRIGGERED6_Disabled (0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED6_Enabled (1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED6_Clear (1UL) /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event TRIGGERED[5] */
#define EGU_INTENCLR_TRIGGERED5_Pos (5UL) /*!< Position of TRIGGERED5 field. */
#define EGU_INTENCLR_TRIGGERED5_Msk (0x1UL << EGU_INTENCLR_TRIGGERED5_Pos) /*!< Bit mask of TRIGGERED5 field. */
#define EGU_INTENCLR_TRIGGERED5_Disabled (0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED5_Enabled (1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED5_Clear (1UL) /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event TRIGGERED[4] */
#define EGU_INTENCLR_TRIGGERED4_Pos (4UL) /*!< Position of TRIGGERED4 field. */
#define EGU_INTENCLR_TRIGGERED4_Msk (0x1UL << EGU_INTENCLR_TRIGGERED4_Pos) /*!< Bit mask of TRIGGERED4 field. */
#define EGU_INTENCLR_TRIGGERED4_Disabled (0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED4_Enabled (1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED4_Clear (1UL) /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event TRIGGERED[3] */
#define EGU_INTENCLR_TRIGGERED3_Pos (3UL) /*!< Position of TRIGGERED3 field. */
#define EGU_INTENCLR_TRIGGERED3_Msk (0x1UL << EGU_INTENCLR_TRIGGERED3_Pos) /*!< Bit mask of TRIGGERED3 field. */
#define EGU_INTENCLR_TRIGGERED3_Disabled (0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED3_Enabled (1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED3_Clear (1UL) /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event TRIGGERED[2] */
#define EGU_INTENCLR_TRIGGERED2_Pos (2UL) /*!< Position of TRIGGERED2 field. */
#define EGU_INTENCLR_TRIGGERED2_Msk (0x1UL << EGU_INTENCLR_TRIGGERED2_Pos) /*!< Bit mask of TRIGGERED2 field. */
#define EGU_INTENCLR_TRIGGERED2_Disabled (0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED2_Enabled (1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED2_Clear (1UL) /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event TRIGGERED[1] */
#define EGU_INTENCLR_TRIGGERED1_Pos (1UL) /*!< Position of TRIGGERED1 field. */
#define EGU_INTENCLR_TRIGGERED1_Msk (0x1UL << EGU_INTENCLR_TRIGGERED1_Pos) /*!< Bit mask of TRIGGERED1 field. */
#define EGU_INTENCLR_TRIGGERED1_Disabled (0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED1_Enabled (1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED1_Clear (1UL) /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event TRIGGERED[0] */
#define EGU_INTENCLR_TRIGGERED0_Pos (0UL) /*!< Position of TRIGGERED0 field. */
#define EGU_INTENCLR_TRIGGERED0_Msk (0x1UL << EGU_INTENCLR_TRIGGERED0_Pos) /*!< Bit mask of TRIGGERED0 field. */
#define EGU_INTENCLR_TRIGGERED0_Disabled (0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED0_Enabled (1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED0_Clear (1UL) /*!< Disable */


/* Peripheral: FICR */
/* Description: Factory Information Configuration Registers 0 */

/* Register: FICR_CHIPCONF00 */
/* Description: Miscellaneous analog configuration. Will be set during production test. */

/* Bit 26 : Disable synchronizer on calibration clock request from Rc32kiGenerator. */
#define FICR_CHIPCONF00_RC31KICLOCKSYNCDISABLE_Pos (26UL) /*!< Position of RC31KICLOCKSYNCDISABLE field. */
#define FICR_CHIPCONF00_RC31KICLOCKSYNCDISABLE_Msk (0x1UL << FICR_CHIPCONF00_RC31KICLOCKSYNCDISABLE_Pos) /*!< Bit mask of RC31KICLOCKSYNCDISABLE field. */

/* Bit 25 :   */
#define FICR_CHIPCONF00_DISABLEIGNOREANAREADY_Pos (25UL) /*!< Position of DISABLEIGNOREANAREADY field. */
#define FICR_CHIPCONF00_DISABLEIGNOREANAREADY_Msk (0x1UL << FICR_CHIPCONF00_DISABLEIGNOREANAREADY_Pos) /*!< Bit mask of DISABLEIGNOREANAREADY field. */

/* Bit 24 :   */
#define FICR_CHIPCONF00_DISABLEREGULATORCLOCKFORCING_Pos (24UL) /*!< Position of DISABLEREGULATORCLOCKFORCING field. */
#define FICR_CHIPCONF00_DISABLEREGULATORCLOCKFORCING_Msk (0x1UL << FICR_CHIPCONF00_DISABLEREGULATORCLOCKFORCING_Pos) /*!< Bit mask of DISABLEREGULATORCLOCKFORCING field. */

/* Bit 23 :   */
#define FICR_CHIPCONF00_XOSC32MQSRT_Pos (23UL) /*!< Position of XOSC32MQSRT field. */
#define FICR_CHIPCONF00_XOSC32MQSRT_Msk (0x1UL << FICR_CHIPCONF00_XOSC32MQSRT_Pos) /*!< Bit mask of XOSC32MQSRT field. */

/* Bits 22..19 : Trimming for the XOC32KI oscillator when used in constant current mode */
#define FICR_CHIPCONF00_XOSC32KICONSTCURR_Pos (19UL) /*!< Position of XOSC32KICONSTCURR field. */
#define FICR_CHIPCONF00_XOSC32KICONSTCURR_Msk (0xFUL << FICR_CHIPCONF00_XOSC32KICONSTCURR_Pos) /*!< Bit mask of XOSC32KICONSTCURR field. */

/* Bits 18..16 : On-chip capacitance trimming for the XOC32KI oscillator */
#define FICR_CHIPCONF00_XOSC32KIINTCAPTRIM_Pos (16UL) /*!< Position of XOSC32KIINTCAPTRIM field. */
#define FICR_CHIPCONF00_XOSC32KIINTCAPTRIM_Msk (0x7UL << FICR_CHIPCONF00_XOSC32KIINTCAPTRIM_Pos) /*!< Bit mask of XOSC32KIINTCAPTRIM field. */
#define FICR_CHIPCONF00_XOSC32KIINTCAPTRIM_TRIM0 (0UL) /*!< 0 percent */
#define FICR_CHIPCONF00_XOSC32KIINTCAPTRIM_TRIM12P5 (1UL) /*!< +12.5 percent */
#define FICR_CHIPCONF00_XOSC32KIINTCAPTRIM_TRIM25 (2UL) /*!< +25 percent */
#define FICR_CHIPCONF00_XOSC32KIINTCAPTRIM_NA0 (3UL) /*!< Forbidden */
#define FICR_CHIPCONF00_XOSC32KIINTCAPTRIM_NA1 (4UL) /*!< Forbidden */
#define FICR_CHIPCONF00_XOSC32KIINTCAPTRIM_NA2 (5UL) /*!< Forbidden */
#define FICR_CHIPCONF00_XOSC32KIINTCAPTRIM_TRIMM25 (6UL) /*!< -25 percent */
#define FICR_CHIPCONF00_XOSC32KIINTCAPTRIM_TRIMM12P5 (7UL) /*!< -12.5 percent */

