adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Bits 11..7 : HFCLK ring oscillator trim codes. Previous name: HFROSCTRIM. */
#define FICR_CHIPCONF00_PLL_CALIB_ROSC_Pos (7UL) /*!< Position of PLL_CALIB_ROSC field. */
#define FICR_CHIPCONF00_PLL_CALIB_ROSC_Msk (0x1FUL << FICR_CHIPCONF00_PLL_CALIB_ROSC_Pos) /*!< Bit mask of PLL_CALIB_ROSC field. */

/* Bit 2 : Enable clock gate in clock purifier. Should always be 1. */
#define FICR_CHIPCONF00_CKPUREEN_Pos (2UL) /*!< Position of CKPUREEN field. */
#define FICR_CHIPCONF00_CKPUREEN_Msk (0x1UL << FICR_CHIPCONF00_CKPUREEN_Pos) /*!< Bit mask of CKPUREEN field. */

/* Register: FICR_CHIPCONF01 */
/* Description: Miscellaneous analog configuration. Will be set during production test. */

/* Bit 12 : Enable wait on ready upon accessing SRAM when turned on */
#define FICR_CHIPCONF01_SRAMWAITEN_Pos (12UL) /*!< Position of SRAMWAITEN field. */
#define FICR_CHIPCONF01_SRAMWAITEN_Msk (0x1UL << FICR_CHIPCONF01_SRAMWAITEN_Pos) /*!< Bit mask of SRAMWAITEN field. */

/* Bits 7..0 : Disable glitch-filter on clock sources powerup and standby lines */
#define FICR_CHIPCONF01_CLOCKREQFILTERDISABLE_Pos (0UL) /*!< Position of CLOCKREQFILTERDISABLE field. */
#define FICR_CHIPCONF01_CLOCKREQFILTERDISABLE_Msk (0xFFUL << FICR_CHIPCONF01_CLOCKREQFILTERDISABLE_Pos) /*!< Bit mask of CLOCKREQFILTERDISABLE field. */
#define FICR_CHIPCONF01_CLOCKREQFILTERDISABLE_XOSC32M (0UL) /*!< Disable glitch-filter on powerUp- and standby lines to XOSC32M */
#define FICR_CHIPCONF01_CLOCKREQFILTERDISABLE_32ki (1UL) /*!< Disable glitch-filter on powerUp line to Rosc/Xosc/Synth used in clock system A (32ki) */
#define FICR_CHIPCONF01_CLOCKREQFILTERDISABLE_64M (2UL) /*!< Disable glitch-filter on powerUp line to PLL used in clock system B (64M) */
#define FICR_CHIPCONF01_CLOCKREQFILTERDISABLE_96M (3UL) /*!< Disable glitch-filter on powerUp line to PLL used in clock system C (96M) */
#define FICR_CHIPCONF01_CLOCKREQFILTERDISABLE_176M128M (4UL) /*!< Disable glitch-filter on powerUp line to PLL used in clock system D (176M/128M) */
#define FICR_CHIPCONF01_CLOCKREQFILTERDISABLE_MCPLL (5UL) /*!< Disable glitch-filter on powerUp line to PLL used in clock system E (MCPLL) */
#define FICR_CHIPCONF01_CLOCKREQFILTERDISABLE_192M (6UL) /*!< Disable glitch-filter on powerUp line to PLL used in clock system F (192M) */
#define FICR_CHIPCONF01_CLOCKREQFILTERDISABLE_12M (7UL) /*!< Disable glitch-filter on powerUp line to PLL used in clock system G (12M) */

/* Register: FICR_CHIPCONF02 */
/* Description: Miscellaneous analog configuration. Will be set during production test. */

/* Bits 19..16 : Wait-states (excluding the cache controller) for I-Code flash access, D-Code has one more wait-state. */
#define FICR_CHIPCONF02_WS_Pos (16UL) /*!< Position of WS field. */
#define FICR_CHIPCONF02_WS_Msk (0xFUL << FICR_CHIPCONF02_WS_Pos) /*!< Bit mask of WS field. */
#define FICR_CHIPCONF02_WS_1WS (1UL) /*!< 1 wait-state in total for I-Code (2 for D-Code) */
#define FICR_CHIPCONF02_WS_2WS (2UL) /*!< 2 wait-state in total for I-Code (3 for D-Code) */
#define FICR_CHIPCONF02_WS_3WS (3UL) /*!< 3 wait-state in total for I-Code (4 for D-Code) */
#define FICR_CHIPCONF02_WS_4WS (4UL) /*!< 4 wait-state in total for I-Code (5 for D-Code) */
#define FICR_CHIPCONF02_WS_5WS (5UL) /*!< 5 wait-state in total for I-Code (6 for D-Code) */
#define FICR_CHIPCONF02_WS_6WS (6UL) /*!< 6 wait-state in total for I-Code (7 for D-Code) */
#define FICR_CHIPCONF02_WS_7WS (7UL) /*!< 7 wait-state in total for I-Code (8 for D-Code) */
#define FICR_CHIPCONF02_WS_8WS (8UL) /*!< 8 wait-state in total for I-Code (9 for D-Code) */
#define FICR_CHIPCONF02_WS_9WS (9UL) /*!< 9 wait-state in total for I-Code (10 for D-Code) */
#define FICR_CHIPCONF02_WS_10WS (10UL) /*!< 10 wait-state in total for I-Code (11 for D-Code) */
#define FICR_CHIPCONF02_WS_11WS (11UL) /*!< 11 wait-state in total for I-Code (12 for D-Code) */
#define FICR_CHIPCONF02_WS_12WS (12UL) /*!< 12 wait-state in total for I-Code (13 for D-Code) */
#define FICR_CHIPCONF02_WS_13WS (13UL) /*!< 13 wait-state in total for I-Code (14 for D-Code) */
#define FICR_CHIPCONF02_WS_14WS (14UL) /*!< 14 wait-state in total for I-Code (15 for D-Code) */
#define FICR_CHIPCONF02_WS_15WS (15UL) /*!< 15 wait-state in total for I-Code (16 for D-Code) */

/* Bits 15..11 : number of cycles before Information Configuration Registers can be read */
#define FICR_CHIPCONF02_IFCREADDELAY_Pos (11UL) /*!< Position of IFCREADDELAY field. */
#define FICR_CHIPCONF02_IFCREADDELAY_Msk (0x1FUL << FICR_CHIPCONF02_IFCREADDELAY_Pos) /*!< Bit mask of IFCREADDELAY field. */

/* Bits 7..0 : Number of successful FLASHPWRUPn read cycles when powering up flash. After chip power up, the NVMC controller reads FLASHPWRUPn for 7 us. */
#define FICR_CHIPCONF02_FLASHPWRUPCNT_Pos (0UL) /*!< Position of FLASHPWRUPCNT field. */
#define FICR_CHIPCONF02_FLASHPWRUPCNT_Msk (0xFFUL << FICR_CHIPCONF02_FLASHPWRUPCNT_Pos) /*!< Bit mask of FLASHPWRUPCNT field. */

/* Register: FICR_CHIPCONF03 */
/* Description: Miscellaneous analog configuration. Will be set during production test. */

/* Bits 12..8 : Calibrate internal bandgap reference in COMP */
#define FICR_CHIPCONF03_COMPREFTRIM_Pos (8UL) /*!< Position of COMPREFTRIM field. */
#define FICR_CHIPCONF03_COMPREFTRIM_Msk (0x1FUL << FICR_CHIPCONF03_COMPREFTRIM_Pos) /*!< Bit mask of COMPREFTRIM field. */

/* Register: FICR_CHIPCONF04 */
/* Description: Configuration for VREGMAIN. Will be set during production test. */

/* Bits 27..23 : VREGMAIN BUCK output voltage calibration Output voltage calibration. 0 : Minimum output voltage level. 31: Maximum output voltage level. */
#define FICR_CHIPCONF04_VMAINBUCKCAL_Pos (23UL) /*!< Position of VMAINBUCKCAL field. */
#define FICR_CHIPCONF04_VMAINBUCKCAL_Msk (0x1FUL << FICR_CHIPCONF04_VMAINBUCKCAL_Pos) /*!< Bit mask of VMAINBUCKCAL field. */

/* Bits 22..16 : Sets the threshold value for VREGMAIN */
#define FICR_CHIPCONF04_VMAINTHRESHOLD_Pos (16UL) /*!< Position of VMAINTHRESHOLD field. */
#define FICR_CHIPCONF04_VMAINTHRESHOLD_Msk (0x7FUL << FICR_CHIPCONF04_VMAINTHRESHOLD_Pos) /*!< Bit mask of VMAINTHRESHOLD field. */

