adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Bit 14 : DVDD0V9 LDO mode 0 - NMOS only input stage in LDO (default) 1 - Rail2rail input stage in LDO */
#define FICR_CHIPCONF04_VMAINULPRAIL2RAIL_Pos (14UL) /*!< Position of VMAINULPRAIL2RAIL field. */
#define FICR_CHIPCONF04_VMAINULPRAIL2RAIL_Msk (0x1UL << FICR_CHIPCONF04_VMAINULPRAIL2RAIL_Pos) /*!< Bit mask of VMAINULPRAIL2RAIL field. */

/* Bits 13..12 : Output voltage calibration. 0: 0.75V ratio of AVDD1V3 output (default) 1: 0.75V reference 2: AVDD1V3 as reference. 3: Reserved for future use. */
#define FICR_CHIPCONF04_ULPDVDDSELREF_Pos (12UL) /*!< Position of ULPDVDDSELREF field. */
#define FICR_CHIPCONF04_ULPDVDDSELREF_Msk (0x3UL << FICR_CHIPCONF04_ULPDVDDSELREF_Pos) /*!< Bit mask of ULPDVDDSELREF field. */

/* Bits 11..8 : 0: Minimum driver speed, low efficiency, low noise. 7: Medium driver speed, medium efficiency, medium noise. 15: Maximum driver speed, high efficiency, high noise. */
#define FICR_CHIPCONF04_BUCKDROUTSEL_Pos (8UL) /*!< Position of BUCKDROUTSEL field. */
#define FICR_CHIPCONF04_BUCKDROUTSEL_Msk (0xFUL << FICR_CHIPCONF04_BUCKDROUTSEL_Pos) /*!< Bit mask of BUCKDROUTSEL field. */

/* Bit 7 : Enable or disable the feature */
#define FICR_CHIPCONF04_VMAINHIGH_Pos (7UL) /*!< Position of VMAINHIGH field. */
#define FICR_CHIPCONF04_VMAINHIGH_Msk (0x1UL << FICR_CHIPCONF04_VMAINHIGH_Pos) /*!< Bit mask of VMAINHIGH field. */
#define FICR_CHIPCONF04_VMAINHIGH_Disabled (0UL) /*!< Nominal output levels of VREGMAIN LDO */
#define FICR_CHIPCONF04_VMAINHIGH_Enabled (1UL) /*!< Increased output levels of VREGMAIN LDO */

/* Bits 6..4 : VREGMAIN LDO Output voltage calibration */
#define FICR_CHIPCONF04_VMAINLDOCAL_Pos (4UL) /*!< Position of VMAINLDOCAL field. */
#define FICR_CHIPCONF04_VMAINLDOCAL_Msk (0x7UL << FICR_CHIPCONF04_VMAINLDOCAL_Pos) /*!< Bit mask of VMAINLDOCAL field. */

/* Bits 3..2 : VREGMAIN Buck  Input clock selection. */
#define FICR_CHIPCONF04_VMAINBUCKCKSEL_Pos (2UL) /*!< Position of VMAINBUCKCKSEL field. */
#define FICR_CHIPCONF04_VMAINBUCKCKSEL_Msk (0x3UL << FICR_CHIPCONF04_VMAINBUCKCKSEL_Pos) /*!< Bit mask of VMAINBUCKCKSEL field. */
#define FICR_CHIPCONF04_VMAINBUCKCKSEL_NORMAL (0UL) /*!< normal clock */
#define FICR_CHIPCONF04_VMAINBUCKCKSEL_INVERTED (1UL) /*!< inverted clock */

/* Bits 1..0 : VREGMAIN Output voltage selection. */
#define FICR_CHIPCONF04_VMAIN_Pos (0UL) /*!< Position of VMAIN field. */
#define FICR_CHIPCONF04_VMAIN_Msk (0x3UL << FICR_CHIPCONF04_VMAIN_Pos) /*!< Bit mask of VMAIN field. */
#define FICR_CHIPCONF04_VMAIN_1V00 (0UL) /*!< 1.00 V */
#define FICR_CHIPCONF04_VMAIN_1V09 (1UL) /*!< 1.09 V */
#define FICR_CHIPCONF04_VMAIN_1V17 (2UL) /*!< 1.17 V */
#define FICR_CHIPCONF04_VMAIN_1V26 (3UL) /*!< 1.26 V */

/* Register: FICR_CHIPCONF05 */
/* Description: Configuration for VREGANA. Will be set during production test. */

/* Bits 30..26 : Internal oscillator calibration word 0: Low output frequency. 15: Default output frequency. 31: High output frequency. */
#define FICR_CHIPCONF05_VCORECALIBVCO_Pos (26UL) /*!< Position of VCORECALIBVCO field. */
#define FICR_CHIPCONF05_VCORECALIBVCO_Msk (0x1FUL << FICR_CHIPCONF05_VCORECALIBVCO_Pos) /*!< Bit mask of VCORECALIBVCO field. */

/* Bits 25..24 : Spare digital signals */
#define FICR_CHIPCONF05_VCORECTRL_Pos (24UL) /*!< Position of VCORECTRL field. */
#define FICR_CHIPCONF05_VCORECTRL_Msk (0x3UL << FICR_CHIPCONF05_VCORECTRL_Pos) /*!< Bit mask of VCORECTRL field. */

/* Bits 18..17 : Output voltage calibration. 0: switched with internal oscillator (default). 1: switched with CLK2K input 2: force always on. 3: force off (PWRUPs must be 0 otherwise default). */
#define FICR_CHIPCONF05_ULPRESCTRL_Pos (17UL) /*!< Position of ULPRESCTRL field. */
#define FICR_CHIPCONF05_ULPRESCTRL_Msk (0x3UL << FICR_CHIPCONF05_ULPRESCTRL_Pos) /*!< Bit mask of ULPRESCTRL field. */

/* Bits 16..13 : 0: minimum current. 7: default. 15: maximum current. */
#define FICR_CHIPCONF05_ULPICTRL_Pos (13UL) /*!< Position of ULPICTRL field. */
#define FICR_CHIPCONF05_ULPICTRL_Msk (0xFUL << FICR_CHIPCONF05_ULPICTRL_Pos) /*!< Bit mask of ULPICTRL field. */

/* Bits 12..9 : Adjusts temperature gradient of reference (to compensate for modelling inaccuracy) 0: most negative gradient. 7: default. 15: most positive gradient. */
#define FICR_CHIPCONF05_VCOREULPTEMPGRAD_Pos (9UL) /*!< Position of VCOREULPTEMPGRAD field. */
#define FICR_CHIPCONF05_VCOREULPTEMPGRAD_Msk (0xFUL << FICR_CHIPCONF05_VCOREULPTEMPGRAD_Pos) /*!< Bit mask of VCOREULPTEMPGRAD field. */

/* Bit 8 : AVDD1V3 LDO mode 0: NMOS only input stage in LDO (default) 1: Rail2rail input stage in LDO */
#define FICR_CHIPCONF05_VANAULPRAIL2RAIL_Pos (8UL) /*!< Position of VANAULPRAIL2RAIL field. */
#define FICR_CHIPCONF05_VANAULPRAIL2RAIL_Msk (0x1UL << FICR_CHIPCONF05_VANAULPRAIL2RAIL_Pos) /*!< Bit mask of VANAULPRAIL2RAIL field. */

/* Bits 7..3 : VREGANA ULP  Output voltage calibration */
#define FICR_CHIPCONF05_VANAULPCAL_Pos (3UL) /*!< Position of VANAULPCAL field. */
#define FICR_CHIPCONF05_VANAULPCAL_Msk (0x1FUL << FICR_CHIPCONF05_VANAULPCAL_Pos) /*!< Bit mask of VANAULPCAL field. */
#define FICR_CHIPCONF05_VANAULPCAL_0 (0UL) /*!< min voltage */
#define FICR_CHIPCONF05_VANAULPCAL_31 (7UL) /*!< max voltage */

/* Bits 2..0 : VREGANA Output voltage calibration */
#define FICR_CHIPCONF05_VANALDOCAL_Pos (0UL) /*!< Position of VANALDOCAL field. */
#define FICR_CHIPCONF05_VANALDOCAL_Msk (0x7UL << FICR_CHIPCONF05_VANALDOCAL_Pos) /*!< Bit mask of VANALDOCAL field. */

/* Register: FICR_CHIPCONF06 */
/* Description: Configuration for VREGRADIO and VREGNETWORK. Will be set during production test. */

/* Bit 31 : TBD */
#define FICR_CHIPCONF06_VRADIOPFMALWAYSONDISABLE_Pos (31UL) /*!< Position of VRADIOPFMALWAYSONDISABLE field. */
#define FICR_CHIPCONF06_VRADIOPFMALWAYSONDISABLE_Msk (0x1UL << FICR_CHIPCONF06_VRADIOPFMALWAYSONDISABLE_Pos) /*!< Bit mask of VRADIOPFMALWAYSONDISABLE field. */

/* Bit 30 : Control the output voltage for VREGNETWORK (DVDD_0V9) */
#define FICR_CHIPCONF06_VNETWORKULPALWAYSHIGH_Pos (30UL) /*!< Position of VNETWORKULPALWAYSHIGH field. */
#define FICR_CHIPCONF06_VNETWORKULPALWAYSHIGH_Msk (0x1UL << FICR_CHIPCONF06_VNETWORKULPALWAYSHIGH_Pos) /*!< Bit mask of VNETWORKULPALWAYSHIGH field. */

/* Bits 29..26 : Control the output voltage for VREGNETWORK (DVDD_0V9) */
#define FICR_CHIPCONF06_VNETWORKVOUT_Pos (26UL) /*!< Position of VNETWORKVOUT field. */
#define FICR_CHIPCONF06_VNETWORKVOUT_Msk (0xFUL << FICR_CHIPCONF06_VNETWORKVOUT_Pos) /*!< Bit mask of VNETWORKVOUT field. */

