adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Bits 25..21 : TBD */
#define FICR_CHIPCONF06_VRADIOBUCKCALPWM_Pos (21UL) /*!< Position of VRADIOBUCKCALPWM field. */
#define FICR_CHIPCONF06_VRADIOBUCKCALPWM_Msk (0x1FUL << FICR_CHIPCONF06_VRADIOBUCKCALPWM_Pos) /*!< Bit mask of VRADIOBUCKCALPWM field. */

/* Bits 20..18 : TBD */
#define FICR_CHIPCONF06_VRADIOBUCKCALPFMICMP_Pos (18UL) /*!< Position of VRADIOBUCKCALPFMICMP field. */
#define FICR_CHIPCONF06_VRADIOBUCKCALPFMICMP_Msk (0x7UL << FICR_CHIPCONF06_VRADIOBUCKCALPFMICMP_Pos) /*!< Bit mask of VRADIOBUCKCALPFMICMP field. */

/* Bits 17..14 : TBD */
#define FICR_CHIPCONF06_VRADIOBUCKCALPFM_Pos (14UL) /*!< Position of VRADIOBUCKCALPFM field. */
#define FICR_CHIPCONF06_VRADIOBUCKCALPFM_Msk (0xFUL << FICR_CHIPCONF06_VRADIOBUCKCALPFM_Pos) /*!< Bit mask of VRADIOBUCKCALPFM field. */

/* Bits 13..12 : TBD */
#define FICR_CHIPCONF06_VRADIOBUCKCALMAXILIM_Pos (12UL) /*!< Position of VRADIOBUCKCALMAXILIM field. */
#define FICR_CHIPCONF06_VRADIOBUCKCALMAXILIM_Msk (0x3UL << FICR_CHIPCONF06_VRADIOBUCKCALMAXILIM_Pos) /*!< Bit mask of VRADIOBUCKCALMAXILIM field. */

/* Bit 11 : Force VREGRADIO ULP regulators to be always on */
#define FICR_CHIPCONF06_VRADIOULPALWAYSON_Pos (11UL) /*!< Position of VRADIOULPALWAYSON field. */
#define FICR_CHIPCONF06_VRADIOULPALWAYSON_Msk (0x1UL << FICR_CHIPCONF06_VRADIOULPALWAYSON_Pos) /*!< Bit mask of VRADIOULPALWAYSON field. */

/* Bits 10..4 : TBD for VREGRADIO (AVDD_1V3) */
#define FICR_CHIPCONF06_VRADIOTHRESHOLD_Pos (4UL) /*!< Position of VRADIOTHRESHOLD field. */
#define FICR_CHIPCONF06_VRADIOTHRESHOLD_Msk (0x7FUL << FICR_CHIPCONF06_VRADIOTHRESHOLD_Pos) /*!< Bit mask of VRADIOTHRESHOLD field. */

/* Bits 3..2 : Control the TBD for VREGRADIO (AVDD_1V3) */
#define FICR_CHIPCONF06_VRADIOVOUTHIGH_Pos (2UL) /*!< Position of VRADIOVOUTHIGH field. */
#define FICR_CHIPCONF06_VRADIOVOUTHIGH_Msk (0x3UL << FICR_CHIPCONF06_VRADIOVOUTHIGH_Pos) /*!< Bit mask of VRADIOVOUTHIGH field. */

/* Bits 1..0 : Control the output voltage for VREGRADIO (AVDD_1V3) */
#define FICR_CHIPCONF06_VRADIOVOUT_Pos (0UL) /*!< Position of VRADIOVOUT field. */
#define FICR_CHIPCONF06_VRADIOVOUT_Msk (0x3UL << FICR_CHIPCONF06_VRADIOVOUT_Pos) /*!< Bit mask of VRADIOVOUT field. */

/* Register: FICR_CHIPCONF07 */
/* Description: ICMP timeer configuration for VREGRADIO and VREGNETWORK. Will be set during production test. */

/* Bits 31..16 : Control the stay-alive time for the VNETWORK current comparator (DVDD_0V9) */
#define FICR_CHIPCONF07_VNETWORKICMPTIMER_Pos (16UL) /*!< Position of VNETWORKICMPTIMER field. */
#define FICR_CHIPCONF07_VNETWORKICMPTIMER_Msk (0xFFFFUL << FICR_CHIPCONF07_VNETWORKICMPTIMER_Pos) /*!< Bit mask of VNETWORKICMPTIMER field. */

/* Bits 15..0 : Control the stay-alive time for the VRADIO PFM current comparator */
#define FICR_CHIPCONF07_VRADIOPFMICMPTIMER_Pos (0UL) /*!< Position of VRADIOPFMICMPTIMER field. */
#define FICR_CHIPCONF07_VRADIOPFMICMPTIMER_Msk (0xFFFFUL << FICR_CHIPCONF07_VRADIOPFMICMPTIMER_Pos) /*!< Bit mask of VRADIOPFMICMPTIMER field. */

/* Register: FICR_CHIPCONF08 */
/* Description: Configuration for VREGH. Will be set during production test. */

/* Bits 31..28 :   */
#define FICR_CHIPCONF08_VREGHULPTRIMCVREF_Pos (28UL) /*!< Position of VREGHULPTRIMCVREF field. */
#define FICR_CHIPCONF08_VREGHULPTRIMCVREF_Msk (0xFUL << FICR_CHIPCONF08_VREGHULPTRIMCVREF_Pos) /*!< Bit mask of VREGHULPTRIMCVREF field. */

/* Bits 27..22 : Trimmed value for refresh mode counter for automatic mode change to ULP */
#define FICR_CHIPCONF08_VREGHRFSHTRIMULP_Pos (22UL) /*!< Position of VREGHRFSHTRIMULP field. */
#define FICR_CHIPCONF08_VREGHRFSHTRIMULP_Msk (0x3FUL << FICR_CHIPCONF08_VREGHRFSHTRIMULP_Pos) /*!< Bit mask of VREGHRFSHTRIMULP field. */

/* Bits 21..16 : Trimmed value for refresh mode counter for automatic mode change to PWM */
#define FICR_CHIPCONF08_VREGHRFSHTRIMPWM_Pos (16UL) /*!< Position of VREGHRFSHTRIMPWM field. */
#define FICR_CHIPCONF08_VREGHRFSHTRIMPWM_Msk (0x3FUL << FICR_CHIPCONF08_VREGHRFSHTRIMPWM_Pos) /*!< Bit mask of VREGHRFSHTRIMPWM field. */

/* Bits 15..14 : Programmable value for counter for poller in PWM mode */
#define FICR_CHIPCONF08_VREGHRFSHPOLLSEL_Pos (14UL) /*!< Position of VREGHRFSHPOLLSEL field. */
#define FICR_CHIPCONF08_VREGHRFSHPOLLSEL_Msk (0x3UL << FICR_CHIPCONF08_VREGHRFSHPOLLSEL_Pos) /*!< Bit mask of VREGHRFSHPOLLSEL field. */
#define FICR_CHIPCONF08_VREGHRFSHPOLLSEL_256us (0UL) /*!< 256 us polling interval */
#define FICR_CHIPCONF08_VREGHRFSHPOLLSEL_512us (1UL) /*!< 512 us polling interval */
#define FICR_CHIPCONF08_VREGHRFSHPOLLSEL_1024us (2UL) /*!< 1024 us polling interval */
#define FICR_CHIPCONF08_VREGHRFSHPOLLSEL_Disabled (3UL) /*!< Disabled */

/* Bits 13..12 : Trimming of VREG_VIO load current measurement */
#define FICR_CHIPCONF08_VREGHVREGICMPTRIM_Pos (12UL) /*!< Position of VREGHVREGICMPTRIM field. */
#define FICR_CHIPCONF08_VREGHVREGICMPTRIM_Msk (0x3UL << FICR_CHIPCONF08_VREGHVREGICMPTRIM_Pos) /*!< Bit mask of VREGHVREGICMPTRIM field. */
#define FICR_CHIPCONF08_VREGHVREGICMPTRIM_m30pcnt (0UL) /*!< -30 percent */
#define FICR_CHIPCONF08_VREGHVREGICMPTRIM_m10pcnt (1UL) /*!< -10 percent (default) */
#define FICR_CHIPCONF08_VREGHVREGICMPTRIM_p10pcnt (2UL) /*!< +10 percent */
#define FICR_CHIPCONF08_VREGHVREGICMPTRIM_p30pcnt (3UL) /*!< +30 percent */

/* Bits 11..10 : Trimming of VREGH_ULP load current measurement */
#define FICR_CHIPCONF08_VREGHULPICMPTRIM_Pos (10UL) /*!< Position of VREGHULPICMPTRIM field. */
#define FICR_CHIPCONF08_VREGHULPICMPTRIM_Msk (0x3UL << FICR_CHIPCONF08_VREGHULPICMPTRIM_Pos) /*!< Bit mask of VREGHULPICMPTRIM field. */
#define FICR_CHIPCONF08_VREGHULPICMPTRIM_m30pcnt (0UL) /*!< -30 percent */
#define FICR_CHIPCONF08_VREGHULPICMPTRIM_m10pcnt (1UL) /*!< -10 percent (default) */
#define FICR_CHIPCONF08_VREGHULPICMPTRIM_p10pcnt (2UL) /*!< +10 percent */
#define FICR_CHIPCONF08_VREGHULPICMPTRIM_p30pcnt (3UL) /*!< +30 percent */

/* Bit 9 : Programmable value for VREGH LDO to ULP overlay counter */
#define FICR_CHIPCONF08_VREGHLDO2ULPOVERLAPTRIM_Pos (9UL) /*!< Position of VREGHLDO2ULPOVERLAPTRIM field. */
#define FICR_CHIPCONF08_VREGHLDO2ULPOVERLAPTRIM_Msk (0x1UL << FICR_CHIPCONF08_VREGHLDO2ULPOVERLAPTRIM_Pos) /*!< Bit mask of VREGHLDO2ULPOVERLAPTRIM field. */
#define FICR_CHIPCONF08_VREGHLDO2ULPOVERLAPTRIM_512us (0UL) /*!< 512 us overlay */
#define FICR_CHIPCONF08_VREGHLDO2ULPOVERLAPTRIM_1024us (1UL) /*!< 1024 us overlay */

/* Bits 8..7 : Refresh mode trim register */
#define FICR_CHIPCONF08_VREGHRFSHBUCKCAL_Pos (7UL) /*!< Position of VREGHRFSHBUCKCAL field. */
#define FICR_CHIPCONF08_VREGHRFSHBUCKCAL_Msk (0x3UL << FICR_CHIPCONF08_VREGHRFSHBUCKCAL_Pos) /*!< Bit mask of VREGHRFSHBUCKCAL field. */

/* Bits 6..5 : VREGH BUCK output current limit calibration */
#define FICR_CHIPCONF08_VREGHBUCKCALILIM_Pos (5UL) /*!< Position of VREGHBUCKCALILIM field. */
#define FICR_CHIPCONF08_VREGHBUCKCALILIM_Msk (0x3UL << FICR_CHIPCONF08_VREGHBUCKCALILIM_Pos) /*!< Bit mask of VREGHBUCKCALILIM field. */
#define FICR_CHIPCONF08_VREGHBUCKCALILIM_65mA (0UL) /*!< 65mA (default) */
#define FICR_CHIPCONF08_VREGHBUCKCALILIM_m20pcnt (1UL) /*!< -20 percent */
#define FICR_CHIPCONF08_VREGHBUCKCALILIM_p40pcnt (2UL) /*!< +40 percent */
#define FICR_CHIPCONF08_VREGHBUCKCALILIM_p20pcnt (3UL) /*!< +20 percent */

