adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Bits 4..0 : VREGH BUCK output voltage fine calibration */
#define FICR_CHIPCONF08_VREGHBUCKCAL_Pos (0UL) /*!< Position of VREGHBUCKCAL field. */
#define FICR_CHIPCONF08_VREGHBUCKCAL_Msk (0x1FUL << FICR_CHIPCONF08_VREGHBUCKCAL_Pos) /*!< Bit mask of VREGHBUCKCAL field. */

/* Register: FICR_CHIPCONF09 */
/* Description: Configuration for VREGH. Will be set during production test. */

/* Bits 20..14 : Sets the threshold value for VREGH */
#define FICR_CHIPCONF09_VREGHTHRESHOLD_Pos (14UL) /*!< Position of VREGHTHRESHOLD field. */
#define FICR_CHIPCONF09_VREGHTHRESHOLD_Msk (0x7FUL << FICR_CHIPCONF09_VREGHTHRESHOLD_Pos) /*!< Bit mask of VREGHTHRESHOLD field. */

/* Bits 13..6 : Power configuration for VREGH */
#define FICR_CHIPCONF09_POWERCFG_Pos (6UL) /*!< Position of POWERCFG field. */
#define FICR_CHIPCONF09_POWERCFG_Msk (0xFFUL << FICR_CHIPCONF09_POWERCFG_Pos) /*!< Bit mask of POWERCFG field. */

/* Bits 5..3 : Output voltage trimming for VREGH _ULP */
#define FICR_CHIPCONF09_VREGHULPTRIM_Pos (3UL) /*!< Position of VREGHULPTRIM field. */
#define FICR_CHIPCONF09_VREGHULPTRIM_Msk (0x7UL << FICR_CHIPCONF09_VREGHULPTRIM_Pos) /*!< Bit mask of VREGHULPTRIM field. */

/* Bits 2..0 : VREGH LDO output voltage trimming */
#define FICR_CHIPCONF09_VREGHVREGTRIM_Pos (0UL) /*!< Position of VREGHVREGTRIM field. */
#define FICR_CHIPCONF09_VREGHVREGTRIM_Msk (0x7UL << FICR_CHIPCONF09_VREGHVREGTRIM_Pos) /*!< Bit mask of VREGHVREGTRIM field. */

/* Register: FICR_CHIPCONF10 */
/* Description: Configuration for Application, Audio and 192M PLLs, */

/* Bit 20 : Power configuration for VREGH */
#define FICR_CHIPCONF10_PLL192MPROGCHPUMP_Pos (20UL) /*!< Position of PLL192MPROGCHPUMP field. */
#define FICR_CHIPCONF10_PLL192MPROGCHPUMP_Msk (0x1UL << FICR_CHIPCONF10_PLL192MPROGCHPUMP_Pos) /*!< Bit mask of PLL192MPROGCHPUMP field. */

/* Bits 19..16 : Power configuration for VREGH */
#define FICR_CHIPCONF10_PLL192MCTRL_Pos (16UL) /*!< Position of PLL192MCTRL field. */
#define FICR_CHIPCONF10_PLL192MCTRL_Msk (0xFUL << FICR_CHIPCONF10_PLL192MCTRL_Pos) /*!< Bit mask of PLL192MCTRL field. */

/* Bits 13..8 : Power configuration for VREGH */
#define FICR_CHIPCONF10_AUDIOCTRL_Pos (8UL) /*!< Position of AUDIOCTRL field. */
#define FICR_CHIPCONF10_AUDIOCTRL_Msk (0x3FUL << FICR_CHIPCONF10_AUDIOCTRL_Pos) /*!< Bit mask of AUDIOCTRL field. */

/* Bit 4 : Power configuration for VREGH */
#define FICR_CHIPCONF10_APPPROGCHPUMP_Pos (4UL) /*!< Position of APPPROGCHPUMP field. */
#define FICR_CHIPCONF10_APPPROGCHPUMP_Msk (0x1UL << FICR_CHIPCONF10_APPPROGCHPUMP_Pos) /*!< Bit mask of APPPROGCHPUMP field. */

/* Bits 3..0 : Power configuration for VREGH */
#define FICR_CHIPCONF10_APPCTRL_Pos (0UL) /*!< Position of APPCTRL field. */
#define FICR_CHIPCONF10_APPCTRL_Msk (0xFUL << FICR_CHIPCONF10_APPCTRL_Pos) /*!< Bit mask of APPCTRL field. */

/* Register: FICR_CHIPCONF11 */
/* Description: Configuration for XOSC32M */

/* Bits 9..5 : Offset trim factor on integer form */
#define FICR_CHIPCONF11_OFFSET_Pos (5UL) /*!< Position of OFFSET field. */
#define FICR_CHIPCONF11_OFFSET_Msk (0x1FUL << FICR_CHIPCONF11_OFFSET_Pos) /*!< Bit mask of OFFSET field. */

/* Bits 4..0 : Slope trim factor on 2's complement form */
#define FICR_CHIPCONF11_SLOPE_Pos (0UL) /*!< Position of SLOPE field. */
#define FICR_CHIPCONF11_SLOPE_Msk (0x1FUL << FICR_CHIPCONF11_SLOPE_Pos) /*!< Bit mask of SLOPE field. */

/* Register: FICR_CHIPCONF12 */
/* Description: Backdoor trim values for Application VMC */

/* Bit 6 : Read/Write Margin Adjustment */
#define FICR_CHIPCONF12_APPRWM_Pos (6UL) /*!< Position of APPRWM field. */
#define FICR_CHIPCONF12_APPRWM_Msk (0x1UL << FICR_CHIPCONF12_APPRWM_Pos) /*!< Bit mask of APPRWM field. */
#define FICR_CHIPCONF12_APPRWM_Disabled (0UL) /*!< Disable */
#define FICR_CHIPCONF12_APPRWM_Enabled (1UL) /*!< Enable */

/* Bit 5 : Read Margin Adjustment */
#define FICR_CHIPCONF12_APPRM_Pos (5UL) /*!< Position of APPRM field. */
#define FICR_CHIPCONF12_APPRM_Msk (0x1UL << FICR_CHIPCONF12_APPRM_Pos) /*!< Bit mask of APPRM field. */
#define FICR_CHIPCONF12_APPRM_Disabled (0UL) /*!< Disable */
#define FICR_CHIPCONF12_APPRM_Enabled (1UL) /*!< Enable */

/* Bit 4 : Write Margin Adjustment */
#define FICR_CHIPCONF12_APPWM_Pos (4UL) /*!< Position of APPWM field. */
#define FICR_CHIPCONF12_APPWM_Msk (0x1UL << FICR_CHIPCONF12_APPWM_Pos) /*!< Bit mask of APPWM field. */
#define FICR_CHIPCONF12_APPWM_Disabled (0UL) /*!< Disable */
#define FICR_CHIPCONF12_APPWM_Enabled (1UL) /*!< Enable */

/* Bits 3..0 : Source Bias Trim Adjustment for retention */
#define FICR_CHIPCONF12_APPBTRIM_Pos (0UL) /*!< Position of APPBTRIM field. */
#define FICR_CHIPCONF12_APPBTRIM_Msk (0xFUL << FICR_CHIPCONF12_APPBTRIM_Pos) /*!< Bit mask of APPBTRIM field. */

/* Register: FICR_CHIPCONF13 */
/* Description: RCOSC32K trim values */

/* Bits 29..24 : LFULP coarse calibration input */
#define FICR_CHIPCONF13_LFULP32KICOARSEIN_Pos (24UL) /*!< Position of LFULP32KICOARSEIN field. */
#define FICR_CHIPCONF13_LFULP32KICOARSEIN_Msk (0x3FUL << FICR_CHIPCONF13_LFULP32KICOARSEIN_Pos) /*!< Bit mask of LFULP32KICOARSEIN field. */

/* Bits 17..16 : 32kHz ULP RC oscillator calibration length in number of cycles */
#define FICR_CHIPCONF13_LFULP32KICALLENGTH_Pos (16UL) /*!< Position of LFULP32KICALLENGTH field. */
#define FICR_CHIPCONF13_LFULP32KICALLENGTH_Msk (0x3UL << FICR_CHIPCONF13_LFULP32KICALLENGTH_Pos) /*!< Bit mask of LFULP32KICALLENGTH field. */
#define FICR_CHIPCONF13_LFULP32KICALLENGTH_N64 (0UL) /*!< 64 cycles */
#define FICR_CHIPCONF13_LFULP32KICALLENGTH_N128 (1UL) /*!< 128 cycles */
#define FICR_CHIPCONF13_LFULP32KICALLENGTH_N256 (2UL) /*!< 256 cycles */
#define FICR_CHIPCONF13_LFULP32KICALLENGTH_N512 (3UL) /*!< 512 cycles */

/* Bits 13..8 : RCOSC coarse calibration input */
#define FICR_CHIPCONF13_RCOSC32KICOARSEIN_Pos (8UL) /*!< Position of RCOSC32KICOARSEIN field. */
#define FICR_CHIPCONF13_RCOSC32KICOARSEIN_Msk (0x3FUL << FICR_CHIPCONF13_RCOSC32KICOARSEIN_Pos) /*!< Bit mask of RCOSC32KICOARSEIN field. */

/* Bits 1..0 : 32kHz RC oscillator calibration length in number of cycles */
#define FICR_CHIPCONF13_RCOSC32KICALLENGTH_Pos (0UL) /*!< Position of RCOSC32KICALLENGTH field. */
#define FICR_CHIPCONF13_RCOSC32KICALLENGTH_Msk (0x3UL << FICR_CHIPCONF13_RCOSC32KICALLENGTH_Pos) /*!< Bit mask of RCOSC32KICALLENGTH field. */
#define FICR_CHIPCONF13_RCOSC32KICALLENGTH_N64 (0UL) /*!< 64 cycles */
#define FICR_CHIPCONF13_RCOSC32KICALLENGTH_N128 (1UL) /*!< 128 cycles */
#define FICR_CHIPCONF13_RCOSC32KICALLENGTH_N256 (2UL) /*!< 256 cycles */
#define FICR_CHIPCONF13_RCOSC32KICALLENGTH_N512 (3UL) /*!< 512 cycles */

/* Register: FICR_CHIPCONF14 */
/* Description: Trim values for Application and Audio PLL */

