adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Bits 27..22 : Trim value for the Audio PLL VCO at 12.288MHz */
#define FICR_CHIPCONF14_AUDIOVCOTRIM12MHZ_Pos (22UL) /*!< Position of AUDIOVCOTRIM12MHZ field. */
#define FICR_CHIPCONF14_AUDIOVCOTRIM12MHZ_Msk (0x3FUL << FICR_CHIPCONF14_AUDIOVCOTRIM12MHZ_Pos) /*!< Bit mask of AUDIOVCOTRIM12MHZ field. */

/* Bits 21..16 : Trim value for the Audio PLL VCO at 11.289MHz */
#define FICR_CHIPCONF14_AUDIOVCOTRIM11MHZ_Pos (16UL) /*!< Position of AUDIOVCOTRIM11MHZ field. */
#define FICR_CHIPCONF14_AUDIOVCOTRIM11MHZ_Msk (0x3FUL << FICR_CHIPCONF14_AUDIOVCOTRIM11MHZ_Pos) /*!< Bit mask of AUDIOVCOTRIM11MHZ field. */

/* Bits 5..0 : Trim value for the Application PLL VCO at 128MHz */
#define FICR_CHIPCONF14_APPVCOTRIM128MHZ_Pos (0UL) /*!< Position of APPVCOTRIM128MHZ field. */
#define FICR_CHIPCONF14_APPVCOTRIM128MHZ_Msk (0x3FUL << FICR_CHIPCONF14_APPVCOTRIM128MHZ_Pos) /*!< Bit mask of APPVCOTRIM128MHZ field. */

/* Register: FICR_CHIPCONF15 */
/* Description: Trim values for the 192M PLL */

/* Bits 29..24 : Trim value for the 192M PLL VCO at 192MHz */
#define FICR_CHIPCONF15_VCOTRIM192MHZ_Pos (24UL) /*!< Position of VCOTRIM192MHZ field. */
#define FICR_CHIPCONF15_VCOTRIM192MHZ_Msk (0x3FUL << FICR_CHIPCONF15_VCOTRIM192MHZ_Pos) /*!< Bit mask of VCOTRIM192MHZ field. */

/* Bits 23..18 : Trim value for the 192M PLL VCO at 176MHz */
#define FICR_CHIPCONF15_VCOTRIM176MHZ_Pos (18UL) /*!< Position of VCOTRIM176MHZ field. */
#define FICR_CHIPCONF15_VCOTRIM176MHZ_Msk (0x3FUL << FICR_CHIPCONF15_VCOTRIM176MHZ_Pos) /*!< Bit mask of VCOTRIM176MHZ field. */

/* Bits 17..12 : Trim value for the 192M PLL VCO at 160MHz */
#define FICR_CHIPCONF15_VCOTRIM160MHZ_Pos (12UL) /*!< Position of VCOTRIM160MHZ field. */
#define FICR_CHIPCONF15_VCOTRIM160MHZ_Msk (0x3FUL << FICR_CHIPCONF15_VCOTRIM160MHZ_Pos) /*!< Bit mask of VCOTRIM160MHZ field. */

/* Bits 11..6 : Trim value for the 192M PLL VCO at 144MHz */
#define FICR_CHIPCONF15_VCOTRIM144MHZ_Pos (6UL) /*!< Position of VCOTRIM144MHZ field. */
#define FICR_CHIPCONF15_VCOTRIM144MHZ_Msk (0x3FUL << FICR_CHIPCONF15_VCOTRIM144MHZ_Pos) /*!< Bit mask of VCOTRIM144MHZ field. */

/* Bits 5..0 : Trim value for the 192M PLL VCO at 128MHz */
#define FICR_CHIPCONF15_VCOTRIM128MHZ_Pos (0UL) /*!< Position of VCOTRIM128MHZ field. */
#define FICR_CHIPCONF15_VCOTRIM128MHZ_Msk (0x3FUL << FICR_CHIPCONF15_VCOTRIM128MHZ_Pos) /*!< Bit mask of VCOTRIM128MHZ field. */

/* Register: FICR_FLASHPWRUP0 */
/* Description: Power-up pattern for flash */

/* Bits 31..0 : Power-up pattern for flash */
#define FICR_FLASHPWRUP0_FLASHPWRUP0_Pos (0UL) /*!< Position of FLASHPWRUP0 field. */
#define FICR_FLASHPWRUP0_FLASHPWRUP0_Msk (0xFFFFFFFFUL << FICR_FLASHPWRUP0_FLASHPWRUP0_Pos) /*!< Bit mask of FLASHPWRUP0 field. */

/* Register: FICR_FLASHPWRUP1 */
/* Description: Power-up pattern for flash */

/* Bits 31..0 : Power-up pattern for flash */
#define FICR_FLASHPWRUP1_FLASHPWRUP1_Pos (0UL) /*!< Position of FLASHPWRUP1 field. */
#define FICR_FLASHPWRUP1_FLASHPWRUP1_Msk (0xFFFFFFFFUL << FICR_FLASHPWRUP1_FLASHPWRUP1_Pos) /*!< Bit mask of FLASHPWRUP1 field. */

/* Register: FICR_FLASHPWRUP2 */
/* Description: Power-up pattern for flash */

/* Bits 31..0 : Power-up pattern for flash */
#define FICR_FLASHPWRUP2_FLASHPWRUP2_Pos (0UL) /*!< Position of FLASHPWRUP2 field. */
#define FICR_FLASHPWRUP2_FLASHPWRUP2_Msk (0xFFFFFFFFUL << FICR_FLASHPWRUP2_FLASHPWRUP2_Pos) /*!< Bit mask of FLASHPWRUP2 field. */

/* Register: FICR_FLASHPWRUP3 */
/* Description: Power-up pattern for flash */

/* Bits 31..0 : Power-up pattern for flash */
#define FICR_FLASHPWRUP3_FLASHPWRUP3_Pos (0UL) /*!< Position of FLASHPWRUP3 field. */
#define FICR_FLASHPWRUP3_FLASHPWRUP3_Msk (0xFFFFFFFFUL << FICR_FLASHPWRUP3_FLASHPWRUP3_Pos) /*!< Bit mask of FLASHPWRUP3 field. */

/* Register: FICR_TESTSTATUS */
/* Description: Code memory test status. Will be set during production test. */

/* Bits 31..0 : Code memory test status. Will be set during production test. */
#define FICR_TESTSTATUS_TESTSTATUS_Pos (0UL) /*!< Position of TESTSTATUS field. */
#define FICR_TESTSTATUS_TESTSTATUS_Msk (0xFFFFFFFFUL << FICR_TESTSTATUS_TESTSTATUS_Pos) /*!< Bit mask of TESTSTATUS field. */

/* Register: FICR_CPTEST0 */
/* Description: Result from Circuit Probe test */

/* Bits 31..0 : Result from Circuit Probe test */
#define FICR_CPTEST0_CP1_Pos (0UL) /*!< Position of CP1 field. */
#define FICR_CPTEST0_CP1_Msk (0xFFFFFFFFUL << FICR_CPTEST0_CP1_Pos) /*!< Bit mask of CP1 field. */

/* Register: FICR_CPTEST00 */
/* Description: Result from Circuit Probe test */

/* Bits 31..0 : Result from Circuit Probe test */
#define FICR_CPTEST00_CP2_Pos (0UL) /*!< Position of CP2 field. */
#define FICR_CPTEST00_CP2_Msk (0xFFFFFFFFUL << FICR_CPTEST00_CP2_Pos) /*!< Bit mask of CP2 field. */

/* Register: FICR_CPTEST1 */
/* Description: Result from Circuit Probe test */

/* Bits 31..24 : 4th ascii byte of Lot ID character */
#define FICR_CPTEST1_LOTID4_Pos (24UL) /*!< Position of LOTID4 field. */
#define FICR_CPTEST1_LOTID4_Msk (0xFFUL << FICR_CPTEST1_LOTID4_Pos) /*!< Bit mask of LOTID4 field. */

/* Bits 23..16 : 3rd ascii byte of Lot ID character */
#define FICR_CPTEST1_LOTID3_Pos (16UL) /*!< Position of LOTID3 field. */
#define FICR_CPTEST1_LOTID3_Msk (0xFFUL << FICR_CPTEST1_LOTID3_Pos) /*!< Bit mask of LOTID3 field. */

/* Bits 15..8 : 2nd ascii byte of Lot ID character */
#define FICR_CPTEST1_LOTID2_Pos (8UL) /*!< Position of LOTID2 field. */
#define FICR_CPTEST1_LOTID2_Msk (0xFFUL << FICR_CPTEST1_LOTID2_Pos) /*!< Bit mask of LOTID2 field. */

/* Bits 7..0 : 1st ascii byte of Lot ID character */
#define FICR_CPTEST1_LOTID1_Pos (0UL) /*!< Position of LOTID1 field. */
#define FICR_CPTEST1_LOTID1_Msk (0xFFUL << FICR_CPTEST1_LOTID1_Pos) /*!< Bit mask of LOTID1 field. */

/* Register: FICR_CPTEST2 */
/* Description: Result from Circuit Probe test */

/* Bits 31..24 : Device X-coordinate, always &gt;=0, offset so that the leftmost value on wafer is 0 */
#define FICR_CPTEST2_XCOORD_Pos (24UL) /*!< Position of XCOORD field. */
#define FICR_CPTEST2_XCOORD_Msk (0xFFUL << FICR_CPTEST2_XCOORD_Pos) /*!< Bit mask of XCOORD field. */

/* Bits 23..16 : Wafer number, 1 byte integer */
#define FICR_CPTEST2_WAFER_Pos (16UL) /*!< Position of WAFER field. */
#define FICR_CPTEST2_WAFER_Msk (0xFFUL << FICR_CPTEST2_WAFER_Pos) /*!< Bit mask of WAFER field. */

/* Bits 15..8 : 6th ascii byte of Lot ID character */
#define FICR_CPTEST2_LOTID6_Pos (8UL) /*!< Position of LOTID6 field. */
#define FICR_CPTEST2_LOTID6_Msk (0xFFUL << FICR_CPTEST2_LOTID6_Pos) /*!< Bit mask of LOTID6 field. */

/* Bits 7..0 : 5th ascii byte of Lot ID character */
#define FICR_CPTEST2_LOTID5_Pos (0UL) /*!< Position of LOTID5 field. */
#define FICR_CPTEST2_LOTID5_Msk (0xFFUL << FICR_CPTEST2_LOTID5_Pos) /*!< Bit mask of LOTID5 field. */

/* Register: FICR_CPTEST3 */
/* Description: Result from Circuit Probe test */

