adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Register: LPCOMP_HYST */
/* Description: Comparator hysteresis enable */

/* Bit 0 : Comparator hysteresis enable */
#define LPCOMP_HYST_HYST_Pos (0UL) /*!< Position of HYST field. */
#define LPCOMP_HYST_HYST_Msk (0x1UL << LPCOMP_HYST_HYST_Pos) /*!< Bit mask of HYST field. */
#define LPCOMP_HYST_HYST_Disabled (0UL) /*!< Comparator hysteresis disabled */
#define LPCOMP_HYST_HYST_Enabled (1UL) /*!< Comparator hysteresis enabled */

/* Register: LPCOMP_POWER */
/* Description: Peripheral power control */

/* Bit 0 : Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the peripheral off and then back on again. */
#define LPCOMP_POWER_POWER_Pos (0UL) /*!< Position of POWER field. */
#define LPCOMP_POWER_POWER_Msk (0x1UL << LPCOMP_POWER_POWER_Pos) /*!< Bit mask of POWER field. */
#define LPCOMP_POWER_POWER_Disabled (0UL) /*!< Peripheral is powered off */
#define LPCOMP_POWER_POWER_Enabled (1UL) /*!< Peripheral is powered on */


/* Peripheral: M2M */
/* Description: Memory to Memory DMA 0 */

/* Register: M2M_TASKS_START */
/* Description: Start DMA transfer */

/* Bit 0 : Start DMA transfer */
#define M2M_TASKS_START_TASKS_START_Pos (0UL) /*!< Position of TASKS_START field. */
#define M2M_TASKS_START_TASKS_START_Msk (0x1UL << M2M_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field. */
#define M2M_TASKS_START_TASKS_START_Trigger (1UL) /*!< Trigger task */

/* Register: M2M_TASKS_STOP */
/* Description: Stop DMA transfer */

/* Bit 0 : Stop DMA transfer */
#define M2M_TASKS_STOP_TASKS_STOP_Pos (0UL) /*!< Position of TASKS_STOP field. */
#define M2M_TASKS_STOP_TASKS_STOP_Msk (0x1UL << M2M_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field. */
#define M2M_TASKS_STOP_TASKS_STOP_Trigger (1UL) /*!< Trigger task */

/* Register: M2M_SUBSCRIBE_START */
/* Description: Subscribe configuration for task START */

/* Bit 31 :   */
#define M2M_SUBSCRIBE_START_EN_Pos (31UL) /*!< Position of EN field. */
#define M2M_SUBSCRIBE_START_EN_Msk (0x1UL << M2M_SUBSCRIBE_START_EN_Pos) /*!< Bit mask of EN field. */
#define M2M_SUBSCRIBE_START_EN_Disabled (0UL) /*!< Disable subscription */
#define M2M_SUBSCRIBE_START_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 4..0 : Channel that task START will subscribe to */
#define M2M_SUBSCRIBE_START_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define M2M_SUBSCRIBE_START_CHIDX_Msk (0x1FUL << M2M_SUBSCRIBE_START_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: M2M_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for task STOP */

/* Bit 31 :   */
#define M2M_SUBSCRIBE_STOP_EN_Pos (31UL) /*!< Position of EN field. */
#define M2M_SUBSCRIBE_STOP_EN_Msk (0x1UL << M2M_SUBSCRIBE_STOP_EN_Pos) /*!< Bit mask of EN field. */
#define M2M_SUBSCRIBE_STOP_EN_Disabled (0UL) /*!< Disable subscription */
#define M2M_SUBSCRIBE_STOP_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 4..0 : Channel that task STOP will subscribe to */
#define M2M_SUBSCRIBE_STOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define M2M_SUBSCRIBE_STOP_CHIDX_Msk (0x1FUL << M2M_SUBSCRIBE_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: M2M_EVENTS_END */
/* Description: DMA transfer complete */

/* Bit 0 : DMA transfer complete */
#define M2M_EVENTS_END_EVENTS_END_Pos (0UL) /*!< Position of EVENTS_END field. */
#define M2M_EVENTS_END_EVENTS_END_Msk (0x1UL << M2M_EVENTS_END_EVENTS_END_Pos) /*!< Bit mask of EVENTS_END field. */
#define M2M_EVENTS_END_EVENTS_END_NotGenerated (0UL) /*!< Event not generated */
#define M2M_EVENTS_END_EVENTS_END_Generated (1UL) /*!< Event generated */

/* Register: M2M_EVENTS_STARTED */
/* Description: DMA transfer started */

/* Bit 0 : DMA transfer started */
#define M2M_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL) /*!< Position of EVENTS_STARTED field. */
#define M2M_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << M2M_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of EVENTS_STARTED field. */
#define M2M_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0UL) /*!< Event not generated */
#define M2M_EVENTS_STARTED_EVENTS_STARTED_Generated (1UL) /*!< Event generated */

/* Register: M2M_PUBLISH_END */
/* Description: Publish configuration for event END */

/* Bit 31 :   */
#define M2M_PUBLISH_END_EN_Pos (31UL) /*!< Position of EN field. */
#define M2M_PUBLISH_END_EN_Msk (0x1UL << M2M_PUBLISH_END_EN_Pos) /*!< Bit mask of EN field. */
#define M2M_PUBLISH_END_EN_Disabled (0UL) /*!< Disable publishing */
#define M2M_PUBLISH_END_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel that event END will publish to. */
#define M2M_PUBLISH_END_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define M2M_PUBLISH_END_CHIDX_Msk (0x1FUL << M2M_PUBLISH_END_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: M2M_PUBLISH_STARTED */
/* Description: Publish configuration for event STARTED */

/* Bit 31 :   */
#define M2M_PUBLISH_STARTED_EN_Pos (31UL) /*!< Position of EN field. */
#define M2M_PUBLISH_STARTED_EN_Msk (0x1UL << M2M_PUBLISH_STARTED_EN_Pos) /*!< Bit mask of EN field. */
#define M2M_PUBLISH_STARTED_EN_Disabled (0UL) /*!< Disable publishing */
#define M2M_PUBLISH_STARTED_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 4..0 : Channel that event STARTED will publish to. */
#define M2M_PUBLISH_STARTED_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define M2M_PUBLISH_STARTED_CHIDX_Msk (0x1FUL << M2M_PUBLISH_STARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: M2M_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 1 : Enable or disable interrupt for event STARTED */
#define M2M_INTEN_STARTED_Pos (1UL) /*!< Position of STARTED field. */
#define M2M_INTEN_STARTED_Msk (0x1UL << M2M_INTEN_STARTED_Pos) /*!< Bit mask of STARTED field. */
#define M2M_INTEN_STARTED_Disabled (0UL) /*!< Disable */
#define M2M_INTEN_STARTED_Enabled (1UL) /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event END */
#define M2M_INTEN_END_Pos (0UL) /*!< Position of END field. */
#define M2M_INTEN_END_Msk (0x1UL << M2M_INTEN_END_Pos) /*!< Bit mask of END field. */
#define M2M_INTEN_END_Disabled (0UL) /*!< Disable */
#define M2M_INTEN_END_Enabled (1UL) /*!< Enable */

/* Register: M2M_INTENSET */
/* Description: Enable interrupt */

/* Bit 1 : Write '1' to enable interrupt for event STARTED */
#define M2M_INTENSET_STARTED_Pos (1UL) /*!< Position of STARTED field. */
#define M2M_INTENSET_STARTED_Msk (0x1UL << M2M_INTENSET_STARTED_Pos) /*!< Bit mask of STARTED field. */
#define M2M_INTENSET_STARTED_Disabled (0UL) /*!< Read: Disabled */
#define M2M_INTENSET_STARTED_Enabled (1UL) /*!< Read: Enabled */
#define M2M_INTENSET_STARTED_Set (1UL) /*!< Enable */

