adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Bit 0 : Marks the end of the first symbol of a received frame */
#define NFCT_EVENTS_RXFRAMESTART_EVENTS_RXFRAMESTART_Pos (0UL) /*!< Position of EVENTS_RXFRAMESTART field. */
#define NFCT_EVENTS_RXFRAMESTART_EVENTS_RXFRAMESTART_Msk (0x1UL << NFCT_EVENTS_RXFRAMESTART_EVENTS_RXFRAMESTART_Pos) /*!< Bit mask of EVENTS_RXFRAMESTART field. */
#define NFCT_EVENTS_RXFRAMESTART_EVENTS_RXFRAMESTART_NotGenerated (0UL) /*!< Event not generated */
#define NFCT_EVENTS_RXFRAMESTART_EVENTS_RXFRAMESTART_Generated (1UL) /*!< Event generated */

/* Register: NFCT_EVENTS_RXFRAMEEND */
/* Description: Received data has been checked (CRC, parity) and transferred to RAM, and EasyDMA has ended accessing the RX buffer */

/* Bit 0 : Received data has been checked (CRC, parity) and transferred to RAM, and EasyDMA has ended accessing the RX buffer */
#define NFCT_EVENTS_RXFRAMEEND_EVENTS_RXFRAMEEND_Pos (0UL) /*!< Position of EVENTS_RXFRAMEEND field. */
#define NFCT_EVENTS_RXFRAMEEND_EVENTS_RXFRAMEEND_Msk (0x1UL << NFCT_EVENTS_RXFRAMEEND_EVENTS_RXFRAMEEND_Pos) /*!< Bit mask of EVENTS_RXFRAMEEND field. */
#define NFCT_EVENTS_RXFRAMEEND_EVENTS_RXFRAMEEND_NotGenerated (0UL) /*!< Event not generated */
#define NFCT_EVENTS_RXFRAMEEND_EVENTS_RXFRAMEEND_Generated (1UL) /*!< Event generated */

/* Register: NFCT_EVENTS_ERROR */
/* Description: NFC error reported. The ERRORSTATUS register contains details on the source of the error. */

/* Bit 0 : NFC error reported. The ERRORSTATUS register contains details on the source of the error. */
#define NFCT_EVENTS_ERROR_EVENTS_ERROR_Pos (0UL) /*!< Position of EVENTS_ERROR field. */
#define NFCT_EVENTS_ERROR_EVENTS_ERROR_Msk (0x1UL << NFCT_EVENTS_ERROR_EVENTS_ERROR_Pos) /*!< Bit mask of EVENTS_ERROR field. */
#define NFCT_EVENTS_ERROR_EVENTS_ERROR_NotGenerated (0UL) /*!< Event not generated */
#define NFCT_EVENTS_ERROR_EVENTS_ERROR_Generated (1UL) /*!< Event generated */

/* Register: NFCT_EVENTS_FREQMEASUREDONE */
/* Description: Done with one frequency measurement, result available in the MEASUREDFREQ register. This event will fire several times during calibration. */

/* Bit 0 : Done with one frequency measurement, result available in the MEASUREDFREQ register. This event will fire several times during calibration. */
#define NFCT_EVENTS_FREQMEASUREDONE_EVENTS_FREQMEASUREDONE_Pos (0UL) /*!< Position of EVENTS_FREQMEASUREDONE field. */
#define NFCT_EVENTS_FREQMEASUREDONE_EVENTS_FREQMEASUREDONE_Msk (0x1UL << NFCT_EVENTS_FREQMEASUREDONE_EVENTS_FREQMEASUREDONE_Pos) /*!< Bit mask of EVENTS_FREQMEASUREDONE field. */
#define NFCT_EVENTS_FREQMEASUREDONE_EVENTS_FREQMEASUREDONE_NotGenerated (0UL) /*!< Event not generated */
#define NFCT_EVENTS_FREQMEASUREDONE_EVENTS_FREQMEASUREDONE_Generated (1UL) /*!< Event generated */

/* Register: NFCT_EVENTS_CALCOMPLETE */
/* Description: NFC ring oscillator calibration complete. */

/* Bit 0 : NFC ring oscillator calibration complete. */
#define NFCT_EVENTS_CALCOMPLETE_EVENTS_CALCOMPLETE_Pos (0UL) /*!< Position of EVENTS_CALCOMPLETE field. */
#define NFCT_EVENTS_CALCOMPLETE_EVENTS_CALCOMPLETE_Msk (0x1UL << NFCT_EVENTS_CALCOMPLETE_EVENTS_CALCOMPLETE_Pos) /*!< Bit mask of EVENTS_CALCOMPLETE field. */
#define NFCT_EVENTS_CALCOMPLETE_EVENTS_CALCOMPLETE_NotGenerated (0UL) /*!< Event not generated */
#define NFCT_EVENTS_CALCOMPLETE_EVENTS_CALCOMPLETE_Generated (1UL) /*!< Event generated */

/* Register: NFCT_EVENTS_RXERROR */
/* Description: NFC RX frame error reported. The FRAMESTATUS.RX register contains details on the source of the error. */

/* Bit 0 : NFC RX frame error reported. The FRAMESTATUS.RX register contains details on the source of the error. */
#define NFCT_EVENTS_RXERROR_EVENTS_RXERROR_Pos (0UL) /*!< Position of EVENTS_RXERROR field. */
#define NFCT_EVENTS_RXERROR_EVENTS_RXERROR_Msk (0x1UL << NFCT_EVENTS_RXERROR_EVENTS_RXERROR_Pos) /*!< Bit mask of EVENTS_RXERROR field. */
#define NFCT_EVENTS_RXERROR_EVENTS_RXERROR_NotGenerated (0UL) /*!< Event not generated */
#define NFCT_EVENTS_RXERROR_EVENTS_RXERROR_Generated (1UL) /*!< Event generated */

/* Register: NFCT_EVENTS_ENDRX */
/* Description: RX buffer (as defined by PACKETPTR and MAXLEN) in Data RAM full. */

/* Bit 0 : RX buffer (as defined by PACKETPTR and MAXLEN) in Data RAM full. */
#define NFCT_EVENTS_ENDRX_EVENTS_ENDRX_Pos (0UL) /*!< Position of EVENTS_ENDRX field. */
#define NFCT_EVENTS_ENDRX_EVENTS_ENDRX_Msk (0x1UL << NFCT_EVENTS_ENDRX_EVENTS_ENDRX_Pos) /*!< Bit mask of EVENTS_ENDRX field. */
#define NFCT_EVENTS_ENDRX_EVENTS_ENDRX_NotGenerated (0UL) /*!< Event not generated */
#define NFCT_EVENTS_ENDRX_EVENTS_ENDRX_Generated (1UL) /*!< Event generated */

/* Register: NFCT_EVENTS_ENDTX */
/* Description: Transmission of data in RAM has ended, and EasyDMA has ended accessing the TX buffer */

/* Bit 0 : Transmission of data in RAM has ended, and EasyDMA has ended accessing the TX buffer */
#define NFCT_EVENTS_ENDTX_EVENTS_ENDTX_Pos (0UL) /*!< Position of EVENTS_ENDTX field. */
#define NFCT_EVENTS_ENDTX_EVENTS_ENDTX_Msk (0x1UL << NFCT_EVENTS_ENDTX_EVENTS_ENDTX_Pos) /*!< Bit mask of EVENTS_ENDTX field. */
#define NFCT_EVENTS_ENDTX_EVENTS_ENDTX_NotGenerated (0UL) /*!< Event not generated */
#define NFCT_EVENTS_ENDTX_EVENTS_ENDTX_Generated (1UL) /*!< Event generated */

/* Register: NFCT_EVENTS_AUTOCOLRESSTARTED */
/* Description: Auto collision resolution process has started Event generated when ALL_REQ or SENS_REQ has been received while in IDLE state */

/* Bit 0 : Auto collision resolution process has started Event generated when ALL_REQ or SENS_REQ has been received while in IDLE state */
#define NFCT_EVENTS_AUTOCOLRESSTARTED_EVENTS_AUTOCOLRESSTARTED_Pos (0UL) /*!< Position of EVENTS_AUTOCOLRESSTARTED field. */
#define NFCT_EVENTS_AUTOCOLRESSTARTED_EVENTS_AUTOCOLRESSTARTED_Msk (0x1UL << NFCT_EVENTS_AUTOCOLRESSTARTED_EVENTS_AUTOCOLRESSTARTED_Pos) /*!< Bit mask of EVENTS_AUTOCOLRESSTARTED field. */
#define NFCT_EVENTS_AUTOCOLRESSTARTED_EVENTS_AUTOCOLRESSTARTED_NotGenerated (0UL) /*!< Event not generated */
#define NFCT_EVENTS_AUTOCOLRESSTARTED_EVENTS_AUTOCOLRESSTARTED_Generated (1UL) /*!< Event generated */

/* Register: NFCT_EVENTS_AUTOCOLRES1 */
/* Description: Auto collision resolution cascade level 1 succeeded */

/* Bit 0 : Auto collision resolution cascade level 1 succeeded */
#define NFCT_EVENTS_AUTOCOLRES1_EVENTS_AUTOCOLRES1_Pos (0UL) /*!< Position of EVENTS_AUTOCOLRES1 field. */
#define NFCT_EVENTS_AUTOCOLRES1_EVENTS_AUTOCOLRES1_Msk (0x1UL << NFCT_EVENTS_AUTOCOLRES1_EVENTS_AUTOCOLRES1_Pos) /*!< Bit mask of EVENTS_AUTOCOLRES1 field. */
#define NFCT_EVENTS_AUTOCOLRES1_EVENTS_AUTOCOLRES1_NotGenerated (0UL) /*!< Event not generated */
#define NFCT_EVENTS_AUTOCOLRES1_EVENTS_AUTOCOLRES1_Generated (1UL) /*!< Event generated */

/* Register: NFCT_EVENTS_AUTOCOLRES2 */
/* Description: Auto collision resolution cascade level 2 succeeded */

/* Bit 0 : Auto collision resolution cascade level 2 succeeded */
#define NFCT_EVENTS_AUTOCOLRES2_EVENTS_AUTOCOLRES2_Pos (0UL) /*!< Position of EVENTS_AUTOCOLRES2 field. */
#define NFCT_EVENTS_AUTOCOLRES2_EVENTS_AUTOCOLRES2_Msk (0x1UL << NFCT_EVENTS_AUTOCOLRES2_EVENTS_AUTOCOLRES2_Pos) /*!< Bit mask of EVENTS_AUTOCOLRES2 field. */
#define NFCT_EVENTS_AUTOCOLRES2_EVENTS_AUTOCOLRES2_NotGenerated (0UL) /*!< Event not generated */
#define NFCT_EVENTS_AUTOCOLRES2_EVENTS_AUTOCOLRES2_Generated (1UL) /*!< Event generated */

/* Register: NFCT_EVENTS_AUTOCOLRES3 */
/* Description: Auto collision resolution cascade level 3 succeeded */

