adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Register: OSCILLATORS_ATECLOCK */
/* Description: Analog test bus control for clock modules */

/* Bits 10..9 : Configure connection of the DSP PLL  to analog test bus */
#define OSCILLATORS_ATECLOCK_AUDIOPLL_Pos (9UL) /*!< Position of AUDIOPLL field. */
#define OSCILLATORS_ATECLOCK_AUDIOPLL_Msk (0x3UL << OSCILLATORS_ATECLOCK_AUDIOPLL_Pos) /*!< Bit mask of AUDIOPLL field. */
#define OSCILLATORS_ATECLOCK_AUDIOPLL_Disconnected (0UL) /*!< ATB0 in high impedance */
#define OSCILLATORS_ATECLOCK_AUDIOPLL_VTUNE (1UL) /*!< Tune voltage VTUNE on ATB0 */
#define OSCILLATORS_ATECLOCK_AUDIOPLL_OSCPLL (2UL) /*!< OSC_PLL_0V9 on ATB0 */
#define OSCILLATORS_ATECLOCK_AUDIOPLL_OSCPLL140M (3UL) /*!< OSC_PLL_140M_1V2 on ATB0 */

/* Bits 8..7 : Configure connection of the XOSC32K oscillator  to analog test bus */
#define OSCILLATORS_ATECLOCK_XOSC32K_Pos (7UL) /*!< Position of XOSC32K field. */
#define OSCILLATORS_ATECLOCK_XOSC32K_Msk (0x3UL << OSCILLATORS_ATECLOCK_XOSC32K_Pos) /*!< Bit mask of XOSC32K field. */

/* Bits 6..5 : Configure connection of the DSP PLL  to analog test bus */
#define OSCILLATORS_ATECLOCK_DSPPLL_Pos (5UL) /*!< Position of DSPPLL field. */
#define OSCILLATORS_ATECLOCK_DSPPLL_Msk (0x3UL << OSCILLATORS_ATECLOCK_DSPPLL_Pos) /*!< Bit mask of DSPPLL field. */
#define OSCILLATORS_ATECLOCK_DSPPLL_Disconnected (0UL) /*!< ATB0 in high impedance */
#define OSCILLATORS_ATECLOCK_DSPPLL_VTUNE (1UL) /*!< Tune voltage VTUNE on ATB0 */
#define OSCILLATORS_ATECLOCK_DSPPLL_OSCPLLVHF (2UL) /*!< OSC_PLL_VHF_0V9 on ATB0 */
#define OSCILLATORS_ATECLOCK_DSPPLL_Forbidden (3UL) /*!< Forbidden */

/* Bits 4..3 : Configure connection of the CPU PLL  to analog test bus */
#define OSCILLATORS_ATECLOCK_CPUPLL_Pos (3UL) /*!< Position of CPUPLL field. */
#define OSCILLATORS_ATECLOCK_CPUPLL_Msk (0x3UL << OSCILLATORS_ATECLOCK_CPUPLL_Pos) /*!< Bit mask of CPUPLL field. */
#define OSCILLATORS_ATECLOCK_CPUPLL_Disconnected (0UL) /*!< ATB0 in high impedance */
#define OSCILLATORS_ATECLOCK_CPUPLL_VTUNE (1UL) /*!< Tune voltage VTUNE on ATB0 */
#define OSCILLATORS_ATECLOCK_CPUPLL_OSCPLLVHF (2UL) /*!< OSC_PLL_VHF_0V9 on ATB0 */
#define OSCILLATORS_ATECLOCK_CPUPLL_Forbidden (3UL) /*!< Forbidden */

/* Bits 2..1 : Configure connection of PLL to analog test bus */
#define OSCILLATORS_ATECLOCK_PLL_Pos (1UL) /*!< Position of PLL field. */
#define OSCILLATORS_ATECLOCK_PLL_Msk (0x3UL << OSCILLATORS_ATECLOCK_PLL_Pos) /*!< Bit mask of PLL field. */
#define OSCILLATORS_ATECLOCK_PLL_Disconnected (0UL) /*!< Disconnect */
#define OSCILLATORS_ATECLOCK_PLL_VC (1UL) /*!< Connect loop filter voltage to ATB0 */
#define OSCILLATORS_ATECLOCK_PLL_Osc32MDiv (2UL) /*!< Connect 32 MHz divided clock to ATB1 */
#define OSCILLATORS_ATECLOCK_PLL_Both (3UL) /*!< Connect both VC and Osc32MDiv */

/* Bit 0 : Configure connection of the ROSC32K oscillator  to analog test bus */
#define OSCILLATORS_ATECLOCK_ROSC32K_Pos (0UL) /*!< Position of ROSC32K field. */
#define OSCILLATORS_ATECLOCK_ROSC32K_Msk (0x1UL << OSCILLATORS_ATECLOCK_ROSC32K_Pos) /*!< Bit mask of ROSC32K field. */

/* Register: OSCILLATORS_XOSC32MCAPS */
/* Description: Programmable capacitance of XC1 and XC2. */

/* Bit 8 : Enable on-chip capacitors on XC1 and XC2 */
#define OSCILLATORS_XOSC32MCAPS_ENABLE_Pos (8UL) /*!< Position of ENABLE field. */
#define OSCILLATORS_XOSC32MCAPS_ENABLE_Msk (0x1UL << OSCILLATORS_XOSC32MCAPS_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define OSCILLATORS_XOSC32MCAPS_ENABLE_Disabled (0UL) /*!< Capacitor disabled (use external caps) */
#define OSCILLATORS_XOSC32MCAPS_ENABLE_Enabled (1UL) /*!< Capacitor enabled */

/* Bits 4..0 : Capacitor value = 6 + 0.57*CAPVALUE [pF] If disabled, capacitor value = 3.3 [pF] */
#define OSCILLATORS_XOSC32MCAPS_CAPVALUE_Pos (0UL) /*!< Position of CAPVALUE field. */
#define OSCILLATORS_XOSC32MCAPS_CAPVALUE_Msk (0x1FUL << OSCILLATORS_XOSC32MCAPS_CAPVALUE_Pos) /*!< Bit mask of CAPVALUE field. */

/* Register: OSCILLATORS_BYPASSHFXOSC */
/* Description: Enable or disable bypass of HFCLK crystal oscillator with external clock source */

/* Bit 0 : Enable or disable bypass of HFCLK crystal oscillator with external clock source */
#define OSCILLATORS_BYPASSHFXOSC_BYPASS_Pos (0UL) /*!< Position of BYPASS field. */
#define OSCILLATORS_BYPASSHFXOSC_BYPASS_Msk (0x1UL << OSCILLATORS_BYPASSHFXOSC_BYPASS_Pos) /*!< Bit mask of BYPASS field. */
#define OSCILLATORS_BYPASSHFXOSC_BYPASS_Disabled (0UL) /*!< Disable (use with Xtal or low-swing external source) */
#define OSCILLATORS_BYPASSHFXOSC_BYPASS_Enabled (1UL) /*!< Enable (use with rail-to-rail external source) */

/* Register: OSCILLATORS_GPIOBYPASS */
/* Description: Enable bypass from GPIO */

/* Bit 2 : Enable bypass from GPIO for the AUDIO PLL */
#define OSCILLATORS_GPIOBYPASS_AUDIOPLL_Pos (2UL) /*!< Position of AUDIOPLL field. */
#define OSCILLATORS_GPIOBYPASS_AUDIOPLL_Msk (0x1UL << OSCILLATORS_GPIOBYPASS_AUDIOPLL_Pos) /*!< Bit mask of AUDIOPLL field. */
#define OSCILLATORS_GPIOBYPASS_AUDIOPLL_Disabled (0UL) /*!< Bypass is disabled - AUDIO PLL is operating normally */
#define OSCILLATORS_GPIOBYPASS_AUDIOPLL_Enabled (1UL) /*!< Bypass is enabled - The output signal of the AUDIO PLL is replaced by the signal applied to the pad */

/* Bit 1 : Enable bypass from GPIO for the DSP PLL */
#define OSCILLATORS_GPIOBYPASS_DSPPLL_Pos (1UL) /*!< Position of DSPPLL field. */
#define OSCILLATORS_GPIOBYPASS_DSPPLL_Msk (0x1UL << OSCILLATORS_GPIOBYPASS_DSPPLL_Pos) /*!< Bit mask of DSPPLL field. */
#define OSCILLATORS_GPIOBYPASS_DSPPLL_Disabled (0UL) /*!< Bypass is disabled - DSP PLL is operating normally */
#define OSCILLATORS_GPIOBYPASS_DSPPLL_Enabled (1UL) /*!< Bypass is enabled - The output signal of the DSP PLL is replaced by the signal applied to the pad */

/* Bit 0 : Enable bypass from GPIO for the CPU PLL */
#define OSCILLATORS_GPIOBYPASS_CPUPLL_Pos (0UL) /*!< Position of CPUPLL field. */
#define OSCILLATORS_GPIOBYPASS_CPUPLL_Msk (0x1UL << OSCILLATORS_GPIOBYPASS_CPUPLL_Pos) /*!< Bit mask of CPUPLL field. */
#define OSCILLATORS_GPIOBYPASS_CPUPLL_Disabled (0UL) /*!< Bypass is disabled - CPU PLL is operating normally */
#define OSCILLATORS_GPIOBYPASS_CPUPLL_Enabled (1UL) /*!< Bypass is enabled - The output signal of the CPU PLL is replaced by the signal applied to the pad */

/* Register: OSCILLATORS_AUDIOPLL_BYPASS */
/* Description: AUDIO PLL bypass control */

/* Bit 0 : Enable or disable bypass of AUDIOPLL by an external clock source */
#define OSCILLATORS_AUDIOPLL_BYPASS_BYPASS_Pos (0UL) /*!< Position of BYPASS field. */
#define OSCILLATORS_AUDIOPLL_BYPASS_BYPASS_Msk (0x1UL << OSCILLATORS_AUDIOPLL_BYPASS_BYPASS_Pos) /*!< Bit mask of BYPASS field. */
#define OSCILLATORS_AUDIOPLL_BYPASS_BYPASS_Disabled (0UL) /*!< Disable */
#define OSCILLATORS_AUDIOPLL_BYPASS_BYPASS_Enabled (1UL) /*!< Enable */

/* Register: OSCILLATORS_AUDIOPLL_MUTE */
/* Description: Mute the AUDIO PLL */

/* Bit 0 : Mute output clock */
#define OSCILLATORS_AUDIOPLL_MUTE_MUTE_Pos (0UL) /*!< Position of MUTE field. */
#define OSCILLATORS_AUDIOPLL_MUTE_MUTE_Msk (0x1UL << OSCILLATORS_AUDIOPLL_MUTE_MUTE_Pos) /*!< Bit mask of MUTE field. */
#define OSCILLATORS_AUDIOPLL_MUTE_MUTE_Disabled (0UL) /*!< Disable */
#define OSCILLATORS_AUDIOPLL_MUTE_MUTE_Enabled (1UL) /*!< Enable */

