adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Register: OSCILLATORS_AUDIOPLL_CTRL */
/* Description: Collection of test/debug signals */

/* Bits 9..8 : Not used, reserved for future use */
#define OSCILLATORS_AUDIOPLL_CTRL_UNUSED_Pos (8UL) /*!< Position of UNUSED field. */
#define OSCILLATORS_AUDIOPLL_CTRL_UNUSED_Msk (0x3UL << OSCILLATORS_AUDIOPLL_CTRL_UNUSED_Pos) /*!< Bit mask of UNUSED field. */

/* Bit 7 :   */
#define OSCILLATORS_AUDIOPLL_CTRL_DISABLESIGMADELTAMODULATION_Pos (7UL) /*!< Position of DISABLESIGMADELTAMODULATION field. */
#define OSCILLATORS_AUDIOPLL_CTRL_DISABLESIGMADELTAMODULATION_Msk (0x1UL << OSCILLATORS_AUDIOPLL_CTRL_DISABLESIGMADELTAMODULATION_Pos) /*!< Bit mask of DISABLESIGMADELTAMODULATION field. */
#define OSCILLATORS_AUDIOPLL_CTRL_DISABLESIGMADELTAMODULATION_NormalOperation (0UL) /*!< Normal operation */
#define OSCILLATORS_AUDIOPLL_CTRL_DISABLESIGMADELTAMODULATION_Disabled (1UL) /*!< Turn off Sigma-Delta Modulation, output is held constant at 0 (auPllSdmOff) */

/* Bit 6 :   */
#define OSCILLATORS_AUDIOPLL_CTRL_DISABLESIGMADELTADITHER_Pos (6UL) /*!< Position of DISABLESIGMADELTADITHER field. */
#define OSCILLATORS_AUDIOPLL_CTRL_DISABLESIGMADELTADITHER_Msk (0x1UL << OSCILLATORS_AUDIOPLL_CTRL_DISABLESIGMADELTADITHER_Pos) /*!< Bit mask of DISABLESIGMADELTADITHER field. */
#define OSCILLATORS_AUDIOPLL_CTRL_DISABLESIGMADELTADITHER_NormalOperation (0UL) /*!< Normal operation */
#define OSCILLATORS_AUDIOPLL_CTRL_DISABLESIGMADELTADITHER_Disabled (1UL) /*!< Turn off dither in Sigma-Delta Modulation (auPllDitherOff) */

/* Bit 5 : Program Charge Pump Current (only used for debugging) */
#define OSCILLATORS_AUDIOPLL_CTRL_PROGCHPUMP_Pos (5UL) /*!< Position of PROGCHPUMP field. */
#define OSCILLATORS_AUDIOPLL_CTRL_PROGCHPUMP_Msk (0x1UL << OSCILLATORS_AUDIOPLL_CTRL_PROGCHPUMP_Pos) /*!< Bit mask of PROGCHPUMP field. */
#define OSCILLATORS_AUDIOPLL_CTRL_PROGCHPUMP_1uA (0UL) /*!< 1uA (default) */
#define OSCILLATORS_AUDIOPLL_CTRL_PROGCHPUMP_2uA (1UL) /*!< 2uA */

/* Bits 4..2 : VCO frequency selection (Non-default values are only used for debugging) */
#define OSCILLATORS_AUDIOPLL_CTRL_VCOFREQ_Pos (2UL) /*!< Position of VCOFREQ field. */
#define OSCILLATORS_AUDIOPLL_CTRL_VCOFREQ_Msk (0x7UL << OSCILLATORS_AUDIOPLL_CTRL_VCOFREQ_Pos) /*!< Bit mask of VCOFREQ field. */
#define OSCILLATORS_AUDIOPLL_CTRL_VCOFREQ_144MHz (0UL) /*!< 144MHz(default) */
#define OSCILLATORS_AUDIOPLL_CTRL_VCOFREQ_128MHz (1UL) /*!< 128MHz */
#define OSCILLATORS_AUDIOPLL_CTRL_VCOFREQ_160MHz (2UL) /*!< 160MHz */
#define OSCILLATORS_AUDIOPLL_CTRL_VCOFREQ_176MHz (3UL) /*!< 176MHz */
#define OSCILLATORS_AUDIOPLL_CTRL_VCOFREQ_192MHz (4UL) /*!< 192MHz */

/* Bits 1..0 : Adjust internal PFD delay / CP minimum UP/DN pulse length */
#define OSCILLATORS_AUDIOPLL_CTRL_PFDDELAY_Pos (0UL) /*!< Position of PFDDELAY field. */
#define OSCILLATORS_AUDIOPLL_CTRL_PFDDELAY_Msk (0x3UL << OSCILLATORS_AUDIOPLL_CTRL_PFDDELAY_Pos) /*!< Bit mask of PFDDELAY field. */
#define OSCILLATORS_AUDIOPLL_CTRL_PFDDELAY_Min (0UL) /*!< Min delay (default) */
#define OSCILLATORS_AUDIOPLL_CTRL_PFDDELAY_50ps (1UL) /*!< 50ps delay */
#define OSCILLATORS_AUDIOPLL_CTRL_PFDDELAY_100ps (2UL) /*!< 100ps delay */
#define OSCILLATORS_AUDIOPLL_CTRL_PFDDELAY_150ps (3UL) /*!< 150ps delay (max) */

/* Register: OSCILLATORS_AUDIOPLL_VCOTRIM */
/* Description: VCO Trim value for the AUDIO PLL */

/* Bits 5..0 : VCO Trim value for the AUDIO PLL */
#define OSCILLATORS_AUDIOPLL_VCOTRIM_VCOTRIM_Pos (0UL) /*!< Position of VCOTRIM field. */
#define OSCILLATORS_AUDIOPLL_VCOTRIM_VCOTRIM_Msk (0x3FUL << OSCILLATORS_AUDIOPLL_VCOTRIM_VCOTRIM_Pos) /*!< Bit mask of VCOTRIM field. */

/* Register: OSCILLATORS_AUDIOPLL_VCOTRIMOVERRIDE */
/* Description: Control overriding of the VCO Trim values */

/* Bit 0 : VCO Trim value for the AUDIO PLL */
#define OSCILLATORS_AUDIOPLL_VCOTRIMOVERRIDE_VCOTRIMOVEERIDE_Pos (0UL) /*!< Position of VCOTRIMOVEERIDE field. */
#define OSCILLATORS_AUDIOPLL_VCOTRIMOVERRIDE_VCOTRIMOVEERIDE_Msk (0x1UL << OSCILLATORS_AUDIOPLL_VCOTRIMOVERRIDE_VCOTRIMOVEERIDE_Pos) /*!< Bit mask of VCOTRIMOVEERIDE field. */
#define OSCILLATORS_AUDIOPLL_VCOTRIMOVERRIDE_VCOTRIMOVEERIDE_Disabled (0UL) /*!< VCO Trim values are coming from FICR */
#define OSCILLATORS_AUDIOPLL_VCOTRIMOVERRIDE_VCOTRIMOVEERIDE_Enabled (1UL) /*!< VCO Trim values are coming from the VCOTRIM register */

/* Register: OSCILLATORS_CPUPLL_BYPASS */
/* Description: CPU PLL bypass control */

/* Bit 0 : Enable or disable bypass of CPUPLL by an external clock source */
#define OSCILLATORS_CPUPLL_BYPASS_BYPASS_Pos (0UL) /*!< Position of BYPASS field. */
#define OSCILLATORS_CPUPLL_BYPASS_BYPASS_Msk (0x1UL << OSCILLATORS_CPUPLL_BYPASS_BYPASS_Pos) /*!< Bit mask of BYPASS field. */
#define OSCILLATORS_CPUPLL_BYPASS_BYPASS_Disabled (0UL) /*!< Disable */
#define OSCILLATORS_CPUPLL_BYPASS_BYPASS_Enabled (1UL) /*!< Enable */

/* Register: OSCILLATORS_CPUPLL_MUTE */
/* Description: Mute the CPU PLL */

/* Bit 0 : Mute output clock */
#define OSCILLATORS_CPUPLL_MUTE_MUTE_Pos (0UL) /*!< Position of MUTE field. */
#define OSCILLATORS_CPUPLL_MUTE_MUTE_Msk (0x1UL << OSCILLATORS_CPUPLL_MUTE_MUTE_Pos) /*!< Bit mask of MUTE field. */
#define OSCILLATORS_CPUPLL_MUTE_MUTE_Disabled (0UL) /*!< Disable */
#define OSCILLATORS_CPUPLL_MUTE_MUTE_Enabled (1UL) /*!< Enable */

/* Register: OSCILLATORS_CPUPLL_CTRL */
/* Description: Control the behavior of the PFD */

/* Bit 3 : Reserved for future use */
#define OSCILLATORS_CPUPLL_CTRL_UNUSED_Pos (3UL) /*!< Position of UNUSED field. */
#define OSCILLATORS_CPUPLL_CTRL_UNUSED_Msk (0x1UL << OSCILLATORS_CPUPLL_CTRL_UNUSED_Pos) /*!< Bit mask of UNUSED field. */

/* Bit 2 : Adjust internal PFD delay */
#define OSCILLATORS_CPUPLL_CTRL_DISABLEPHASEALLIGNMENT_Pos (2UL) /*!< Position of DISABLEPHASEALLIGNMENT field. */
#define OSCILLATORS_CPUPLL_CTRL_DISABLEPHASEALLIGNMENT_Msk (0x1UL << OSCILLATORS_CPUPLL_CTRL_DISABLEPHASEALLIGNMENT_Pos) /*!< Bit mask of DISABLEPHASEALLIGNMENT field. */

/* Bits 1..0 : Adjust internal PFD delay / CP minimum UP/DN pulse length */
#define OSCILLATORS_CPUPLL_CTRL_PFDDELAY_Pos (0UL) /*!< Position of PFDDELAY field. */
#define OSCILLATORS_CPUPLL_CTRL_PFDDELAY_Msk (0x3UL << OSCILLATORS_CPUPLL_CTRL_PFDDELAY_Pos) /*!< Bit mask of PFDDELAY field. */
#define OSCILLATORS_CPUPLL_CTRL_PFDDELAY_Min (0UL) /*!< Min delay (default) */
#define OSCILLATORS_CPUPLL_CTRL_PFDDELAY_50ps (1UL) /*!< 50ps delay */
#define OSCILLATORS_CPUPLL_CTRL_PFDDELAY_100ps (2UL) /*!< 100ps delay */
#define OSCILLATORS_CPUPLL_CTRL_PFDDELAY_150ps (3UL) /*!< 150ps delay (max) */

/* Register: OSCILLATORS_CPUPLL_PROGCHPUMP */
/* Description: Program Charge Pump Current */

/* Bit 0 : Program Charge Pump Current (only used for debugging) */
#define OSCILLATORS_CPUPLL_PROGCHPUMP_PROGCHPUMP_Pos (0UL) /*!< Position of PROGCHPUMP field. */
#define OSCILLATORS_CPUPLL_PROGCHPUMP_PROGCHPUMP_Msk (0x1UL << OSCILLATORS_CPUPLL_PROGCHPUMP_PROGCHPUMP_Pos) /*!< Bit mask of PROGCHPUMP field. */
#define OSCILLATORS_CPUPLL_PROGCHPUMP_PROGCHPUMP_1uA (0UL) /*!< 1uA (default) */
#define OSCILLATORS_CPUPLL_PROGCHPUMP_PROGCHPUMP_2uA (1UL) /*!< 2uA */

/* Register: OSCILLATORS_CPUPLL_VCOTRIM */
/* Description: VCO Trim value for the CPU PLL */

/* Bits 5..0 : VCO Trim value for the CPU PLL */
#define OSCILLATORS_CPUPLL_VCOTRIM_VCOTRIM_Pos (0UL) /*!< Position of VCOTRIM field. */
#define OSCILLATORS_CPUPLL_VCOTRIM_VCOTRIM_Msk (0x3FUL << OSCILLATORS_CPUPLL_VCOTRIM_VCOTRIM_Pos) /*!< Bit mask of VCOTRIM field. */

/* Register: OSCILLATORS_CPUPLL_VCOTRIMOVERRIDE */
/* Description: Control overriding of the VCO Trim values */

/* Bit 0 : VCO Trim value for the CPU PLL */
#define OSCILLATORS_CPUPLL_VCOTRIMOVERRIDE_VCOTRIMOVEERIDE_Pos (0UL) /*!< Position of VCOTRIMOVEERIDE field. */
#define OSCILLATORS_CPUPLL_VCOTRIMOVERRIDE_VCOTRIMOVEERIDE_Msk (0x1UL << OSCILLATORS_CPUPLL_VCOTRIMOVERRIDE_VCOTRIMOVEERIDE_Pos) /*!< Bit mask of VCOTRIMOVEERIDE field. */
#define OSCILLATORS_CPUPLL_VCOTRIMOVERRIDE_VCOTRIMOVEERIDE_Disabled (0UL) /*!< VCO Trim values are coming from FICR */
#define OSCILLATORS_CPUPLL_VCOTRIMOVERRIDE_VCOTRIMOVEERIDE_Enabled (1UL) /*!< VCO Trim values are coming from the VCOTRIM register */

/* Register: OSCILLATORS_PLL64M_BYPASS */
/* Description: PLL64M bypass control */

/* Bit 0 : Enable or disable bypass of PLL64M by an external clock source */
#define OSCILLATORS_PLL64M_BYPASS_BYPASS_Pos (0UL) /*!< Position of BYPASS field. */
#define OSCILLATORS_PLL64M_BYPASS_BYPASS_Msk (0x1UL << OSCILLATORS_PLL64M_BYPASS_BYPASS_Pos) /*!< Bit mask of BYPASS field. */
#define OSCILLATORS_PLL64M_BYPASS_BYPASS_Disabled (0UL) /*!< Disable */
#define OSCILLATORS_PLL64M_BYPASS_BYPASS_Enabled (1UL) /*!< Enable */

