adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Register: OSCILLATORS_PLL64M_MUTE */
/* Description: Mute the PLL64M */

/* Bit 0 : Mute output clock */
#define OSCILLATORS_PLL64M_MUTE_MUTE_Pos (0UL) /*!< Position of MUTE field. */
#define OSCILLATORS_PLL64M_MUTE_MUTE_Msk (0x1UL << OSCILLATORS_PLL64M_MUTE_MUTE_Pos) /*!< Bit mask of MUTE field. */
#define OSCILLATORS_PLL64M_MUTE_MUTE_Disabled (0UL) /*!< Disable */
#define OSCILLATORS_PLL64M_MUTE_MUTE_Enabled (1UL) /*!< Enable */

/* Register: OSCILLATORS_PLL64M_PROGCHPUMP */
/* Description: Program Charge Pump Current */

/* Bit 0 : Program Charge Pump Current (only used for debugging) */
#define OSCILLATORS_PLL64M_PROGCHPUMP_PROGCHPUMP_Pos (0UL) /*!< Position of PROGCHPUMP field. */
#define OSCILLATORS_PLL64M_PROGCHPUMP_PROGCHPUMP_Msk (0x1UL << OSCILLATORS_PLL64M_PROGCHPUMP_PROGCHPUMP_Pos) /*!< Bit mask of PROGCHPUMP field. */

/* Register: OSCILLATORS_DSPPLL_BYPASS */
/* Description: DSP PLL bypass control */

/* Bit 0 : Enable or disable bypass of DSPPLL by an external clock source */
#define OSCILLATORS_DSPPLL_BYPASS_BYPASS_Pos (0UL) /*!< Position of BYPASS field. */
#define OSCILLATORS_DSPPLL_BYPASS_BYPASS_Msk (0x1UL << OSCILLATORS_DSPPLL_BYPASS_BYPASS_Pos) /*!< Bit mask of BYPASS field. */
#define OSCILLATORS_DSPPLL_BYPASS_BYPASS_Disabled (0UL) /*!< Disable */
#define OSCILLATORS_DSPPLL_BYPASS_BYPASS_Enabled (1UL) /*!< Enable */

/* Register: OSCILLATORS_DSPPLL_MUTE */
/* Description: Mute the DSP PLL */

/* Bit 0 : Mute output clock */
#define OSCILLATORS_DSPPLL_MUTE_MUTE_Pos (0UL) /*!< Position of MUTE field. */
#define OSCILLATORS_DSPPLL_MUTE_MUTE_Msk (0x1UL << OSCILLATORS_DSPPLL_MUTE_MUTE_Pos) /*!< Bit mask of MUTE field. */
#define OSCILLATORS_DSPPLL_MUTE_MUTE_Disabled (0UL) /*!< Disable */
#define OSCILLATORS_DSPPLL_MUTE_MUTE_Enabled (1UL) /*!< Enable */

/* Register: OSCILLATORS_DSPPLL_FREQ */
/* Description: Frequency selection */

/* Bits 2..0 : Frequency selection for the DSP PLL */
#define OSCILLATORS_DSPPLL_FREQ_FREQ_Pos (0UL) /*!< Position of FREQ field. */
#define OSCILLATORS_DSPPLL_FREQ_FREQ_Msk (0x7UL << OSCILLATORS_DSPPLL_FREQ_FREQ_Pos) /*!< Bit mask of FREQ field. */
#define OSCILLATORS_DSPPLL_FREQ_FREQ_128MHz (0UL) /*!< 128 MHz */
#define OSCILLATORS_DSPPLL_FREQ_FREQ_144MHz (1UL) /*!< 144 MHz */
#define OSCILLATORS_DSPPLL_FREQ_FREQ_160MHz (2UL) /*!< 160 MHz */
#define OSCILLATORS_DSPPLL_FREQ_FREQ_176MHz (3UL) /*!< 176 MHz */
#define OSCILLATORS_DSPPLL_FREQ_FREQ_192MHz (4UL) /*!< 192 MHz (default) */

/* Register: OSCILLATORS_DSPPLL_CTRL */
/* Description: Control the behavior of the PFD */

/* Bit 3 : Reserved for future use */
#define OSCILLATORS_DSPPLL_CTRL_UNUSED_Pos (3UL) /*!< Position of UNUSED field. */
#define OSCILLATORS_DSPPLL_CTRL_UNUSED_Msk (0x1UL << OSCILLATORS_DSPPLL_CTRL_UNUSED_Pos) /*!< Bit mask of UNUSED field. */

/* Bit 2 : Adjust internal PFD delay */
#define OSCILLATORS_DSPPLL_CTRL_DISABLEPHASEALLIGNMENT_Pos (2UL) /*!< Position of DISABLEPHASEALLIGNMENT field. */
#define OSCILLATORS_DSPPLL_CTRL_DISABLEPHASEALLIGNMENT_Msk (0x1UL << OSCILLATORS_DSPPLL_CTRL_DISABLEPHASEALLIGNMENT_Pos) /*!< Bit mask of DISABLEPHASEALLIGNMENT field. */

/* Bits 1..0 : Adjust internal PFD delay / CP minimum UP/DN pulse length */
#define OSCILLATORS_DSPPLL_CTRL_PFDDELAY_Pos (0UL) /*!< Position of PFDDELAY field. */
#define OSCILLATORS_DSPPLL_CTRL_PFDDELAY_Msk (0x3UL << OSCILLATORS_DSPPLL_CTRL_PFDDELAY_Pos) /*!< Bit mask of PFDDELAY field. */
#define OSCILLATORS_DSPPLL_CTRL_PFDDELAY_Min (0UL) /*!< Min delay (default) */
#define OSCILLATORS_DSPPLL_CTRL_PFDDELAY_50ps (1UL) /*!< 50ps delay */
#define OSCILLATORS_DSPPLL_CTRL_PFDDELAY_100ps (2UL) /*!< 100ps delay */
#define OSCILLATORS_DSPPLL_CTRL_PFDDELAY_150ps (3UL) /*!< 150ps delay (max) */

/* Register: OSCILLATORS_DSPPLL_PROGCHPUMP */
/* Description: Program Charge Pump Current */

/* Bit 0 : Program Charge Pump Current (only used for debugging) */
#define OSCILLATORS_DSPPLL_PROGCHPUMP_PROGCHPUMP_Pos (0UL) /*!< Position of PROGCHPUMP field. */
#define OSCILLATORS_DSPPLL_PROGCHPUMP_PROGCHPUMP_Msk (0x1UL << OSCILLATORS_DSPPLL_PROGCHPUMP_PROGCHPUMP_Pos) /*!< Bit mask of PROGCHPUMP field. */
#define OSCILLATORS_DSPPLL_PROGCHPUMP_PROGCHPUMP_1uA (0UL) /*!< 1uA (default) */
#define OSCILLATORS_DSPPLL_PROGCHPUMP_PROGCHPUMP_2uA (1UL) /*!< 2uA */

/* Register: OSCILLATORS_DSPPLL_VCOTRIM */
/* Description: VCO Trim value for the DSP PLL */

/* Bits 5..0 : VCO Trim value for the DSP PLL */
#define OSCILLATORS_DSPPLL_VCOTRIM_VCOTRIM_Pos (0UL) /*!< Position of VCOTRIM field. */
#define OSCILLATORS_DSPPLL_VCOTRIM_VCOTRIM_Msk (0x3FUL << OSCILLATORS_DSPPLL_VCOTRIM_VCOTRIM_Pos) /*!< Bit mask of VCOTRIM field. */

/* Register: OSCILLATORS_DSPPLL_VCOTRIMOVERRIDE */
/* Description: Control overriding of the VCO Trim values */

/* Bit 0 : VCO Trim value for the DSP PLL */
#define OSCILLATORS_DSPPLL_VCOTRIMOVERRIDE_VCOTRIMOVEERIDE_Pos (0UL) /*!< Position of VCOTRIMOVEERIDE field. */
#define OSCILLATORS_DSPPLL_VCOTRIMOVERRIDE_VCOTRIMOVEERIDE_Msk (0x1UL << OSCILLATORS_DSPPLL_VCOTRIMOVERRIDE_VCOTRIMOVEERIDE_Pos) /*!< Bit mask of VCOTRIMOVEERIDE field. */
#define OSCILLATORS_DSPPLL_VCOTRIMOVERRIDE_VCOTRIMOVEERIDE_Disabled (0UL) /*!< VCO Trim values are coming from FICR */
#define OSCILLATORS_DSPPLL_VCOTRIMOVERRIDE_VCOTRIMOVEERIDE_Enabled (1UL) /*!< VCO Trim values are coming from the VCOTRIM register */

/* Register: OSCILLATORS_XOSC32KI_BYPASS32KI */
/* Description: Enable or disable bypass of LFCLK crystal oscillator with external clock source */

/* Bit 0 : Enable or disable bypass of LFCLK crystal oscillator with external clock source */
#define OSCILLATORS_XOSC32KI_BYPASS32KI_BYPASS_Pos (0UL) /*!< Position of BYPASS field. */
#define OSCILLATORS_XOSC32KI_BYPASS32KI_BYPASS_Msk (0x1UL << OSCILLATORS_XOSC32KI_BYPASS32KI_BYPASS_Pos) /*!< Bit mask of BYPASS field. */
#define OSCILLATORS_XOSC32KI_BYPASS32KI_BYPASS_Disabled (0UL) /*!< Disable (use with Xtal or low-swing external source) */
#define OSCILLATORS_XOSC32KI_BYPASS32KI_BYPASS_Enabled (1UL) /*!< Enable (use with rail-to-rail external source) */

/* Register: OSCILLATORS_XOSC32KI_POWERDOWN32KI */
/* Description: Power up or power down of LFCLK crystal oscillator */

