adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Bit 0 : Power up or power down LFCLK crystal oscillator */
#define OSCILLATORS_XOSC32KI_POWERDOWN32KI_POWERDOWN32KI_Pos (0UL) /*!< Position of POWERDOWN32KI field. */
#define OSCILLATORS_XOSC32KI_POWERDOWN32KI_POWERDOWN32KI_Msk (0x1UL << OSCILLATORS_XOSC32KI_POWERDOWN32KI_POWERDOWN32KI_Pos) /*!< Bit mask of POWERDOWN32KI field. */
#define OSCILLATORS_XOSC32KI_POWERDOWN32KI_POWERDOWN32KI_PowerUp (0UL) /*!< Power up LFCLK crystal oscillator */
#define OSCILLATORS_XOSC32KI_POWERDOWN32KI_POWERDOWN32KI_PowerDown (1UL) /*!< Power down LFCLK crystal oscillator */

/* Register: OSCILLATORS_XOSC32KI_EXTBIAS */
/* Description: Control the use of a external bias current */

/* Bit 0 : Control the use of a external bias current */
#define OSCILLATORS_XOSC32KI_EXTBIAS_EXTBIAS_Pos (0UL) /*!< Position of EXTBIAS field. */
#define OSCILLATORS_XOSC32KI_EXTBIAS_EXTBIAS_Msk (0x1UL << OSCILLATORS_XOSC32KI_EXTBIAS_EXTBIAS_Pos) /*!< Bit mask of EXTBIAS field. */
#define OSCILLATORS_XOSC32KI_EXTBIAS_EXTBIAS_Disabled (0UL) /*!< Internal bias current is used */
#define OSCILLATORS_XOSC32KI_EXTBIAS_EXTBIAS_Enabled (1UL) /*!< External bias current is used */

/* Register: OSCILLATORS_XOSC32KI_MUTE */
/* Description: Disable clock output */

/* Bit 0 : Disable clock output */
#define OSCILLATORS_XOSC32KI_MUTE_MUTE_Pos (0UL) /*!< Position of MUTE field. */
#define OSCILLATORS_XOSC32KI_MUTE_MUTE_Msk (0x1UL << OSCILLATORS_XOSC32KI_MUTE_MUTE_Pos) /*!< Bit mask of MUTE field. */
#define OSCILLATORS_XOSC32KI_MUTE_MUTE_NotMuted (0UL) /*!< Clock is outputted on OSC_32K_0V9 */
#define OSCILLATORS_XOSC32KI_MUTE_MUTE_Muted (1UL) /*!< Clock is muted. OSC_32K_0V9 is zero */

/* Register: OSCILLATORS_XOSC32KI_INTCAP */
/* Description: Control usage of internal load capacitors */

/* Bits 1..0 : Control usage of internal load capacitors */
#define OSCILLATORS_XOSC32KI_INTCAP_INTCAP_Pos (0UL) /*!< Position of INTCAP field. */
#define OSCILLATORS_XOSC32KI_INTCAP_INTCAP_Msk (0x3UL << OSCILLATORS_XOSC32KI_INTCAP_INTCAP_Pos) /*!< Bit mask of INTCAP field. */
#define OSCILLATORS_XOSC32KI_INTCAP_INTCAP_External (0UL) /*!< Use external load capacitors */
#define OSCILLATORS_XOSC32KI_INTCAP_INTCAP_C6PF (1UL) /*!< 6pF internal load capacitance */
#define OSCILLATORS_XOSC32KI_INTCAP_INTCAP_C7PF (2UL) /*!< 7pF internal load capacitance */
#define OSCILLATORS_XOSC32KI_INTCAP_INTCAP_C11PF (3UL) /*!< 11pf internal load capacitance */

/* Register: OSCILLATORS_XOSC32KI_CAPTRIM */
/* Description: On-chip capacitance trimming */

/* Bits 2..0 : On-chip capacitance trimming */
#define OSCILLATORS_XOSC32KI_CAPTRIM_CAPTRIM_Pos (0UL) /*!< Position of CAPTRIM field. */
#define OSCILLATORS_XOSC32KI_CAPTRIM_CAPTRIM_Msk (0x7UL << OSCILLATORS_XOSC32KI_CAPTRIM_CAPTRIM_Pos) /*!< Bit mask of CAPTRIM field. */
#define OSCILLATORS_XOSC32KI_CAPTRIM_CAPTRIM_TRIM0 (0UL) /*!< 0 percent */
#define OSCILLATORS_XOSC32KI_CAPTRIM_CAPTRIM_TRIM12P5 (1UL) /*!< +12.5 percent */
#define OSCILLATORS_XOSC32KI_CAPTRIM_CAPTRIM_TRIM25 (2UL) /*!< +25 percent */
#define OSCILLATORS_XOSC32KI_CAPTRIM_CAPTRIM_UNUSED0 (3UL) /*!< Reserved for future use */
#define OSCILLATORS_XOSC32KI_CAPTRIM_CAPTRIM_UNUSED1 (4UL) /*!< Reserved for future use */
#define OSCILLATORS_XOSC32KI_CAPTRIM_CAPTRIM_UNUSED2 (5UL) /*!< Reserved for future use */
#define OSCILLATORS_XOSC32KI_CAPTRIM_CAPTRIM_TRIMM25 (6UL) /*!< -25 percent */
#define OSCILLATORS_XOSC32KI_CAPTRIM_CAPTRIM_TRIMM12P5 (7UL) /*!< -12.5 percent */

/* Register: OSCILLATORS_XOSC32KI_CONSTCURR */
/* Description: Control Pierce inverter bias current */

/* Bit 0 : Select bias current control */
#define OSCILLATORS_XOSC32KI_CONSTCURR_CONSTCURR_Pos (0UL) /*!< Position of CONSTCURR field. */
#define OSCILLATORS_XOSC32KI_CONSTCURR_CONSTCURR_Msk (0x1UL << OSCILLATORS_XOSC32KI_CONSTCURR_CONSTCURR_Pos) /*!< Bit mask of CONSTCURR field. */
#define OSCILLATORS_XOSC32KI_CONSTCURR_CONSTCURR_Regulated (0UL) /*!< Bias current is controlled by the amplitude regulator */
#define OSCILLATORS_XOSC32KI_CONSTCURR_CONSTCURR_Constant (1UL) /*!< Bias current is constant */

/* Register: OSCILLATORS_XOSC32KI_CONSTCURRTRIM */
/* Description: Control current bias when CONSTCURR == 1 */

/* Bits 3..0 : Control current bias when CONSTCURR == 1 */
#define OSCILLATORS_XOSC32KI_CONSTCURRTRIM_CONSTCURRTRIM_Pos (0UL) /*!< Position of CONSTCURRTRIM field. */
#define OSCILLATORS_XOSC32KI_CONSTCURRTRIM_CONSTCURRTRIM_Msk (0xFUL << OSCILLATORS_XOSC32KI_CONSTCURRTRIM_CONSTCURRTRIM_Pos) /*!< Bit mask of CONSTCURRTRIM field. */

/* Register: OSCILLATORS_XOSC32KI_AREGHIGHCURR */
/* Description: Increase current in amplitude regulator */

/* Bit 0 : Increase current in amplitude regulator */
#define OSCILLATORS_XOSC32KI_AREGHIGHCURR_AREGHIGHCURR_Pos (0UL) /*!< Position of AREGHIGHCURR field. */
#define OSCILLATORS_XOSC32KI_AREGHIGHCURR_AREGHIGHCURR_Msk (0x1UL << OSCILLATORS_XOSC32KI_AREGHIGHCURR_AREGHIGHCURR_Pos) /*!< Bit mask of AREGHIGHCURR field. */


/* Peripheral: GPIO */
/* Description: GPIO Port 0 */

/* Register: GPIO_OUT */
/* Description: Write GPIO port */

/* Bit 31 : Pin 31 */
#define GPIO_OUT_PIN31_Pos (31UL) /*!< Position of PIN31 field. */
#define GPIO_OUT_PIN31_Msk (0x1UL << GPIO_OUT_PIN31_Pos) /*!< Bit mask of PIN31 field. */
#define GPIO_OUT_PIN31_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN31_High (1UL) /*!< Pin driver is high */

/* Bit 30 : Pin 30 */
#define GPIO_OUT_PIN30_Pos (30UL) /*!< Position of PIN30 field. */
#define GPIO_OUT_PIN30_Msk (0x1UL << GPIO_OUT_PIN30_Pos) /*!< Bit mask of PIN30 field. */
#define GPIO_OUT_PIN30_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN30_High (1UL) /*!< Pin driver is high */

/* Bit 29 : Pin 29 */
#define GPIO_OUT_PIN29_Pos (29UL) /*!< Position of PIN29 field. */
#define GPIO_OUT_PIN29_Msk (0x1UL << GPIO_OUT_PIN29_Pos) /*!< Bit mask of PIN29 field. */
#define GPIO_OUT_PIN29_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN29_High (1UL) /*!< Pin driver is high */

/* Bit 28 : Pin 28 */
#define GPIO_OUT_PIN28_Pos (28UL) /*!< Position of PIN28 field. */
#define GPIO_OUT_PIN28_Msk (0x1UL << GPIO_OUT_PIN28_Pos) /*!< Bit mask of PIN28 field. */
#define GPIO_OUT_PIN28_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN28_High (1UL) /*!< Pin driver is high */

/* Bit 27 : Pin 27 */
#define GPIO_OUT_PIN27_Pos (27UL) /*!< Position of PIN27 field. */
#define GPIO_OUT_PIN27_Msk (0x1UL << GPIO_OUT_PIN27_Pos) /*!< Bit mask of PIN27 field. */
#define GPIO_OUT_PIN27_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN27_High (1UL) /*!< Pin driver is high */

/* Bit 26 : Pin 26 */
#define GPIO_OUT_PIN26_Pos (26UL) /*!< Position of PIN26 field. */
#define GPIO_OUT_PIN26_Msk (0x1UL << GPIO_OUT_PIN26_Pos) /*!< Bit mask of PIN26 field. */
#define GPIO_OUT_PIN26_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN26_High (1UL) /*!< Pin driver is high */

/* Bit 25 : Pin 25 */
#define GPIO_OUT_PIN25_Pos (25UL) /*!< Position of PIN25 field. */
#define GPIO_OUT_PIN25_Msk (0x1UL << GPIO_OUT_PIN25_Pos) /*!< Bit mask of PIN25 field. */
#define GPIO_OUT_PIN25_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN25_High (1UL) /*!< Pin driver is high */

/* Bit 24 : Pin 24 */
#define GPIO_OUT_PIN24_Pos (24UL) /*!< Position of PIN24 field. */
#define GPIO_OUT_PIN24_Msk (0x1UL << GPIO_OUT_PIN24_Pos) /*!< Bit mask of PIN24 field. */
#define GPIO_OUT_PIN24_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN24_High (1UL) /*!< Pin driver is high */

