adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Bits 31..28 : Priority register for RAM AHB slave 7 */
#define PAMLI_RAMPRI_SERIAL1_RAM7_Pos (28UL) /*!< Position of RAM7 field. */
#define PAMLI_RAMPRI_SERIAL1_RAM7_Msk (0xFUL << PAMLI_RAMPRI_SERIAL1_RAM7_Pos) /*!< Bit mask of RAM7 field. */
#define PAMLI_RAMPRI_SERIAL1_RAM7_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_SERIAL1_RAM7_Pri1 (1UL) /*!< Priority 1 */
#define PAMLI_RAMPRI_SERIAL1_RAM7_Pri2 (2UL) /*!< Priority 2 */
#define PAMLI_RAMPRI_SERIAL1_RAM7_Pri3 (3UL) /*!< Priority 3 */
#define PAMLI_RAMPRI_SERIAL1_RAM7_Pri4 (4UL) /*!< Priority 4 */
#define PAMLI_RAMPRI_SERIAL1_RAM7_Pri5 (5UL) /*!< Priority 5 */
#define PAMLI_RAMPRI_SERIAL1_RAM7_Pri6 (6UL) /*!< Priority 6 */
#define PAMLI_RAMPRI_SERIAL1_RAM7_Pri7 (7UL) /*!< Priority 7 */

/* Bits 27..24 : Priority register for RAM AHB slave 6 */
#define PAMLI_RAMPRI_SERIAL1_RAM6_Pos (24UL) /*!< Position of RAM6 field. */
#define PAMLI_RAMPRI_SERIAL1_RAM6_Msk (0xFUL << PAMLI_RAMPRI_SERIAL1_RAM6_Pos) /*!< Bit mask of RAM6 field. */
#define PAMLI_RAMPRI_SERIAL1_RAM6_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_SERIAL1_RAM6_Pri1 (1UL) /*!< Priority 1 */
#define PAMLI_RAMPRI_SERIAL1_RAM6_Pri2 (2UL) /*!< Priority 2 */
#define PAMLI_RAMPRI_SERIAL1_RAM6_Pri3 (3UL) /*!< Priority 3 */
#define PAMLI_RAMPRI_SERIAL1_RAM6_Pri4 (4UL) /*!< Priority 4 */
#define PAMLI_RAMPRI_SERIAL1_RAM6_Pri5 (5UL) /*!< Priority 5 */
#define PAMLI_RAMPRI_SERIAL1_RAM6_Pri6 (6UL) /*!< Priority 6 */
#define PAMLI_RAMPRI_SERIAL1_RAM6_Pri7 (7UL) /*!< Priority 7 */

/* Bits 23..20 : Priority register for RAM AHB slave 5 */
#define PAMLI_RAMPRI_SERIAL1_RAM5_Pos (20UL) /*!< Position of RAM5 field. */
#define PAMLI_RAMPRI_SERIAL1_RAM5_Msk (0xFUL << PAMLI_RAMPRI_SERIAL1_RAM5_Pos) /*!< Bit mask of RAM5 field. */
#define PAMLI_RAMPRI_SERIAL1_RAM5_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_SERIAL1_RAM5_Pri1 (1UL) /*!< Priority 1 */
#define PAMLI_RAMPRI_SERIAL1_RAM5_Pri2 (2UL) /*!< Priority 2 */
#define PAMLI_RAMPRI_SERIAL1_RAM5_Pri3 (3UL) /*!< Priority 3 */
#define PAMLI_RAMPRI_SERIAL1_RAM5_Pri4 (4UL) /*!< Priority 4 */
#define PAMLI_RAMPRI_SERIAL1_RAM5_Pri5 (5UL) /*!< Priority 5 */
#define PAMLI_RAMPRI_SERIAL1_RAM5_Pri6 (6UL) /*!< Priority 6 */
#define PAMLI_RAMPRI_SERIAL1_RAM5_Pri7 (7UL) /*!< Priority 7 */

/* Bits 19..16 : Priority register for RAM AHB slave 4 */
#define PAMLI_RAMPRI_SERIAL1_RAM4_Pos (16UL) /*!< Position of RAM4 field. */
#define PAMLI_RAMPRI_SERIAL1_RAM4_Msk (0xFUL << PAMLI_RAMPRI_SERIAL1_RAM4_Pos) /*!< Bit mask of RAM4 field. */
#define PAMLI_RAMPRI_SERIAL1_RAM4_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_SERIAL1_RAM4_Pri1 (1UL) /*!< Priority 1 */
#define PAMLI_RAMPRI_SERIAL1_RAM4_Pri2 (2UL) /*!< Priority 2 */
#define PAMLI_RAMPRI_SERIAL1_RAM4_Pri3 (3UL) /*!< Priority 3 */
#define PAMLI_RAMPRI_SERIAL1_RAM4_Pri4 (4UL) /*!< Priority 4 */
#define PAMLI_RAMPRI_SERIAL1_RAM4_Pri5 (5UL) /*!< Priority 5 */
#define PAMLI_RAMPRI_SERIAL1_RAM4_Pri6 (6UL) /*!< Priority 6 */
#define PAMLI_RAMPRI_SERIAL1_RAM4_Pri7 (7UL) /*!< Priority 7 */

/* Bits 15..12 : Priority register for RAM AHB slave 3 */
#define PAMLI_RAMPRI_SERIAL1_RAM3_Pos (12UL) /*!< Position of RAM3 field. */
#define PAMLI_RAMPRI_SERIAL1_RAM3_Msk (0xFUL << PAMLI_RAMPRI_SERIAL1_RAM3_Pos) /*!< Bit mask of RAM3 field. */
#define PAMLI_RAMPRI_SERIAL1_RAM3_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_SERIAL1_RAM3_Pri1 (1UL) /*!< Priority 1 */
#define PAMLI_RAMPRI_SERIAL1_RAM3_Pri2 (2UL) /*!< Priority 2 */
#define PAMLI_RAMPRI_SERIAL1_RAM3_Pri3 (3UL) /*!< Priority 3 */
#define PAMLI_RAMPRI_SERIAL1_RAM3_Pri4 (4UL) /*!< Priority 4 */
#define PAMLI_RAMPRI_SERIAL1_RAM3_Pri5 (5UL) /*!< Priority 5 */
#define PAMLI_RAMPRI_SERIAL1_RAM3_Pri6 (6UL) /*!< Priority 6 */
#define PAMLI_RAMPRI_SERIAL1_RAM3_Pri7 (7UL) /*!< Priority 7 */

/* Bits 11..8 : Priority register for RAM AHB slave 2 */
#define PAMLI_RAMPRI_SERIAL1_RAM2_Pos (8UL) /*!< Position of RAM2 field. */
#define PAMLI_RAMPRI_SERIAL1_RAM2_Msk (0xFUL << PAMLI_RAMPRI_SERIAL1_RAM2_Pos) /*!< Bit mask of RAM2 field. */
#define PAMLI_RAMPRI_SERIAL1_RAM2_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_SERIAL1_RAM2_Pri1 (1UL) /*!< Priority 1 */
#define PAMLI_RAMPRI_SERIAL1_RAM2_Pri2 (2UL) /*!< Priority 2 */
#define PAMLI_RAMPRI_SERIAL1_RAM2_Pri3 (3UL) /*!< Priority 3 */
#define PAMLI_RAMPRI_SERIAL1_RAM2_Pri4 (4UL) /*!< Priority 4 */
#define PAMLI_RAMPRI_SERIAL1_RAM2_Pri5 (5UL) /*!< Priority 5 */
#define PAMLI_RAMPRI_SERIAL1_RAM2_Pri6 (6UL) /*!< Priority 6 */
#define PAMLI_RAMPRI_SERIAL1_RAM2_Pri7 (7UL) /*!< Priority 7 */

/* Bits 7..4 : Priority register for RAM AHB slave 1 */
#define PAMLI_RAMPRI_SERIAL1_RAM1_Pos (4UL) /*!< Position of RAM1 field. */
#define PAMLI_RAMPRI_SERIAL1_RAM1_Msk (0xFUL << PAMLI_RAMPRI_SERIAL1_RAM1_Pos) /*!< Bit mask of RAM1 field. */
#define PAMLI_RAMPRI_SERIAL1_RAM1_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_SERIAL1_RAM1_Pri1 (1UL) /*!< Priority 1 */
#define PAMLI_RAMPRI_SERIAL1_RAM1_Pri2 (2UL) /*!< Priority 2 */
#define PAMLI_RAMPRI_SERIAL1_RAM1_Pri3 (3UL) /*!< Priority 3 */
#define PAMLI_RAMPRI_SERIAL1_RAM1_Pri4 (4UL) /*!< Priority 4 */
#define PAMLI_RAMPRI_SERIAL1_RAM1_Pri5 (5UL) /*!< Priority 5 */
#define PAMLI_RAMPRI_SERIAL1_RAM1_Pri6 (6UL) /*!< Priority 6 */
#define PAMLI_RAMPRI_SERIAL1_RAM1_Pri7 (7UL) /*!< Priority 7 */

/* Bits 3..0 : Priority register for RAM AHB slave 0 */
#define PAMLI_RAMPRI_SERIAL1_RAM0_Pos (0UL) /*!< Position of RAM0 field. */
#define PAMLI_RAMPRI_SERIAL1_RAM0_Msk (0xFUL << PAMLI_RAMPRI_SERIAL1_RAM0_Pos) /*!< Bit mask of RAM0 field. */
#define PAMLI_RAMPRI_SERIAL1_RAM0_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_SERIAL1_RAM0_Pri1 (1UL) /*!< Priority 1 */
#define PAMLI_RAMPRI_SERIAL1_RAM0_Pri2 (2UL) /*!< Priority 2 */
#define PAMLI_RAMPRI_SERIAL1_RAM0_Pri3 (3UL) /*!< Priority 3 */
#define PAMLI_RAMPRI_SERIAL1_RAM0_Pri4 (4UL) /*!< Priority 4 */
#define PAMLI_RAMPRI_SERIAL1_RAM0_Pri5 (5UL) /*!< Priority 5 */
#define PAMLI_RAMPRI_SERIAL1_RAM0_Pri6 (6UL) /*!< Priority 6 */
#define PAMLI_RAMPRI_SERIAL1_RAM0_Pri7 (7UL) /*!< Priority 7 */

/* Register: PAMLI_RAMPRI_SERIAL2 */
/* Description: AHB bus master priority register for SPIM2 */

