adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Register: QSPI_FIFOTH */
/* Description: When writing to the IFCONFIG1 register the values for the FIFO thresholds are taken from this register. The DISABLE field can be set to ignore this register. */

/* Bit 16 : Use or ignore this register. */
#define QSPI_FIFOTH_DISABLE_Pos (16UL) /*!< Position of DISABLE field. */
#define QSPI_FIFOTH_DISABLE_Msk (0x1UL << QSPI_FIFOTH_DISABLE_Pos) /*!< Bit mask of DISABLE field. */
#define QSPI_FIFOTH_DISABLE_Use (0UL) /*!< Use contents of this register. */
#define QSPI_FIFOTH_DISABLE_Ignore (1UL) /*!< Do not use the contents of this register. */

/* Bits 15..8 : Write threshold. */
#define QSPI_FIFOTH_WRITE_Pos (8UL) /*!< Position of WRITE field. */
#define QSPI_FIFOTH_WRITE_Msk (0xFFUL << QSPI_FIFOTH_WRITE_Pos) /*!< Bit mask of WRITE field. */

/* Bits 7..0 : Read threshold. */
#define QSPI_FIFOTH_READ_Pos (0UL) /*!< Position of READ field. */
#define QSPI_FIFOTH_READ_Msk (0xFFUL << QSPI_FIFOTH_READ_Pos) /*!< Bit mask of READ field. */

/* Register: QSPI_IFCONFIG1 */
/* Description: Interface configuration. SPI MEM CTRL Control reg. */

/* Bits 31..28 : SCK frequency is given as 32 MHz / (SCKFREQ + 1). */
#define QSPI_IFCONFIG1_SCKFREQ_Pos (28UL) /*!< Position of SCKFREQ field. */
#define QSPI_IFCONFIG1_SCKFREQ_Msk (0xFUL << QSPI_IFCONFIG1_SCKFREQ_Pos) /*!< Bit mask of SCKFREQ field. */

/* Bit 26 : Reset external flash memory device. Write 1 to reset. Must be written back to 0 after a minimum delay of 1 us. */
#define QSPI_IFCONFIG1_RESET_Pos (26UL) /*!< Position of RESET field. */
#define QSPI_IFCONFIG1_RESET_Msk (0x1UL << QSPI_IFCONFIG1_RESET_Pos) /*!< Bit mask of RESET field. */

/* Bit 25 : Select SPI mode. */
#define QSPI_IFCONFIG1_SPIMODE_Pos (25UL) /*!< Position of SPIMODE field. */
#define QSPI_IFCONFIG1_SPIMODE_Msk (0x1UL << QSPI_IFCONFIG1_SPIMODE_Pos) /*!< Bit mask of SPIMODE field. */
#define QSPI_IFCONFIG1_SPIMODE_MODE0 (0UL) /*!< Mode 0: Data are captured on the clock rising edge and data is output on a falling edge. Base level of clock is 0 (CPOL=0, CPHA=0). */
#define QSPI_IFCONFIG1_SPIMODE_MODE3 (1UL) /*!< Mode 3: Data are captured on the clock falling edge and data is output on a rising edge. Base level of clock is 1 (CPOL=1, CPHA=1). */

/* Bit 24 : Enter/exit deep power-down mode (DPM) for external flash memory. */
#define QSPI_IFCONFIG1_DPMEN_Pos (24UL) /*!< Position of DPMEN field. */
#define QSPI_IFCONFIG1_DPMEN_Msk (0x1UL << QSPI_IFCONFIG1_DPMEN_Pos) /*!< Bit mask of DPMEN field. */
#define QSPI_IFCONFIG1_DPMEN_Exit (0UL) /*!< Exit DPM. */
#define QSPI_IFCONFIG1_DPMEN_Enter (1UL) /*!< Enter DPM. */

/* Bits 23..16 : Write FIFO threshold. */
#define QSPI_IFCONFIG1_FIFOTHW_Pos (16UL) /*!< Position of FIFOTHW field. */
#define QSPI_IFCONFIG1_FIFOTHW_Msk (0xFFUL << QSPI_IFCONFIG1_FIFOTHW_Pos) /*!< Bit mask of FIFOTHW field. */

/* Bits 15..8 : Read FIFO threshold. */
#define QSPI_IFCONFIG1_FIFOTHR_Pos (8UL) /*!< Position of FIFOTHR field. */
#define QSPI_IFCONFIG1_FIFOTHR_Msk (0xFFUL << QSPI_IFCONFIG1_FIFOTHR_Pos) /*!< Bit mask of FIFOTHR field. */

/* Bits 7..0 : Minimum amount of time that the CSN pin must stay high before it can go low again. Value is specified in number of 16 MHz periods (62.5 ns). */
#define QSPI_IFCONFIG1_SCKDELAY_Pos (0UL) /*!< Position of SCKDELAY field. */
#define QSPI_IFCONFIG1_SCKDELAY_Msk (0xFFUL << QSPI_IFCONFIG1_SCKDELAY_Pos) /*!< Bit mask of SCKDELAY field. */

/* Register: QSPI_STATUS */
/* Description: Status register. SPI MEM CTRL Status reg. */

/* Bits 31..24 : Value of external flash device Status Register. When the external flash has two bytes status register this field includes the value of the low byte. */
#define QSPI_STATUS_SREG_Pos (24UL) /*!< Position of SREG field. */
#define QSPI_STATUS_SREG_Msk (0xFFUL << QSPI_STATUS_SREG_Pos) /*!< Bit mask of SREG field. */

/* Bit 4 : 1: Ready to serve access request. */
#define QSPI_STATUS_REQREADY_Pos (4UL) /*!< Position of REQREADY field. */
#define QSPI_STATUS_REQREADY_Msk (0x1UL << QSPI_STATUS_REQREADY_Pos) /*!< Bit mask of REQREADY field. */

/* Bit 3 : Ready status. */
#define QSPI_STATUS_READY_Pos (3UL) /*!< Position of READY field. */
#define QSPI_STATUS_READY_Msk (0x1UL << QSPI_STATUS_READY_Pos) /*!< Bit mask of READY field. */
#define QSPI_STATUS_READY_BUSY (0UL) /*!< QSPI peripheral is busy. It is not allowed to trigger any new tasks, writing custom instructions or enter/exit DPM. */
#define QSPI_STATUS_READY_READY (1UL) /*!< QSPI peripheral is ready. It is allowed to trigger new tasks, writing custom instructions or enter/exit DPM. */

/* Bit 2 : Deep power-down mode (DPM) status of external flash. */
#define QSPI_STATUS_DPM_Pos (2UL) /*!< Position of DPM field. */
#define QSPI_STATUS_DPM_Msk (0x1UL << QSPI_STATUS_DPM_Pos) /*!< Bit mask of DPM field. */
#define QSPI_STATUS_DPM_Disabled (0UL) /*!< External flash is not in DPM. */
#define QSPI_STATUS_DPM_Enabled (1UL) /*!< External flash is in DPM. */

/* Bit 1 : Internal TX FIFO contains data not yet written to external flash. */
#define QSPI_STATUS_TXDATAREADY_Pos (1UL) /*!< Position of TXDATAREADY field. */
#define QSPI_STATUS_TXDATAREADY_Msk (0x1UL << QSPI_STATUS_TXDATAREADY_Pos) /*!< Bit mask of TXDATAREADY field. */

/* Bit 0 : Internal RX FIFO contains data from external flash. */
#define QSPI_STATUS_RXDATAREADY_Pos (0UL) /*!< Position of RXDATAREADY field. */
#define QSPI_STATUS_RXDATAREADY_Msk (0x1UL << QSPI_STATUS_RXDATAREADY_Pos) /*!< Bit mask of RXDATAREADY field. */

/* Register: QSPI_ACCESSREQ0 */
/* Description: Access request, word 0. SPI MEM CTRL Access Request reg. 0. */

/* Bits 31..0 : ACCESSREQ0 */
#define QSPI_ACCESSREQ0_ACCESSREQ0_Pos (0UL) /*!< Position of ACCESSREQ0 field. */
#define QSPI_ACCESSREQ0_ACCESSREQ0_Msk (0xFFFFFFFFUL << QSPI_ACCESSREQ0_ACCESSREQ0_Pos) /*!< Bit mask of ACCESSREQ0 field. */

/* Register: QSPI_ACCESSREQ1 */
/* Description: Access request, word 1. SPI MEM CTRL Access Request reg. 1. */

/* Bits 31..0 : ACCESSREQ1 */
#define QSPI_ACCESSREQ1_ACCESSREQ1_Pos (0UL) /*!< Position of ACCESSREQ1 field. */
#define QSPI_ACCESSREQ1_ACCESSREQ1_Msk (0xFFFFFFFFUL << QSPI_ACCESSREQ1_ACCESSREQ1_Pos) /*!< Bit mask of ACCESSREQ1 field. */

/* Register: QSPI_ACCESSREQ2 */
/* Description: Access request, word 2. SPI MEM CTRL Access Request reg. 2. */

/* Bits 31..0 : ACCESSREQ2 */
#define QSPI_ACCESSREQ2_ACCESSREQ2_Pos (0UL) /*!< Position of ACCESSREQ2 field. */
#define QSPI_ACCESSREQ2_ACCESSREQ2_Msk (0xFFFFFFFFUL << QSPI_ACCESSREQ2_ACCESSREQ2_Pos) /*!< Bit mask of ACCESSREQ2 field. */

