adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Bits 4..0 : Threshold trim, power on reset */
#define REGULATORS_RSTVTHTRIM_RSTVTHTRIM_Pos (0UL) /*!< Position of RSTVTHTRIM field. */
#define REGULATORS_RSTVTHTRIM_RSTVTHTRIM_Msk (0x1FUL << REGULATORS_RSTVTHTRIM_RSTVTHTRIM_Pos) /*!< Bit mask of RSTVTHTRIM field. */

/* Register: REGULATORS_BORLVBATTTRIM */
/* Description: Threshold trim, brown-out reset for VDDL battery */

/* Bits 3..0 : Threshold trim, brown-out reset for VDDL battery */
#define REGULATORS_BORLVBATTTRIM_BORLVBATTTRIM_Pos (0UL) /*!< Position of BORLVBATTTRIM field. */
#define REGULATORS_BORLVBATTTRIM_BORLVBATTTRIM_Msk (0xFUL << REGULATORS_BORLVBATTTRIM_BORLVBATTTRIM_Pos) /*!< Bit mask of BORLVBATTTRIM field. */

/* Register: REGULATORS_BGREFTRIM */
/* Description: Master bias bandgap trim */

/* Bits 3..0 : Threshold trim, brown-out reset for VDDL battery */
#define REGULATORS_BGREFTRIM_BGREFTRIM_Pos (0UL) /*!< Position of BGREFTRIM field. */
#define REGULATORS_BGREFTRIM_BGREFTRIM_Msk (0xFUL << REGULATORS_BGREFTRIM_BGREFTRIM_Pos) /*!< Bit mask of BGREFTRIM field. */

/* Register: REGULATORS_FORCEOFFNVM */
/* Description: Force off NVM supply. See also the internal section in the NVMC chapter. */

/* Bits 31..0 : Force off NVM supply. See also the internal section in the NVMC chapter. */
#define REGULATORS_FORCEOFFNVM_FORCEOFFNVM_Pos (0UL) /*!< Position of FORCEOFFNVM field. */
#define REGULATORS_FORCEOFFNVM_FORCEOFFNVM_Msk (0xFFFFFFFFUL << REGULATORS_FORCEOFFNVM_FORCEOFFNVM_Pos) /*!< Bit mask of FORCEOFFNVM field. */
#define REGULATORS_FORCEOFFNVM_FORCEOFFNVM_DoNotForceOff (0UL) /*!< Read: Do not force off NVM supply. */
#define REGULATORS_FORCEOFFNVM_FORCEOFFNVM_ForceOff (1UL) /*!< Read: Force off NVM supply. */
#define REGULATORS_FORCEOFFNVM_FORCEOFFNVM_DisableForceOff (0UL) /*!< Write: Do not force off NVM supply. */
#define REGULATORS_FORCEOFFNVM_FORCEOFFNVM_EnableForceOff (0xBADCA81EUL) /*!< Write: Force off NVM supply. */

/* Register: REGULATORS_ATEPOWER */
/* Description: Analog test bus control for power modules */

/* Bit 25 : Connect or disconnect reference generator for Network flash to analog test bus */
#define REGULATORS_ATEPOWER_VREF1V2NET_Pos (25UL) /*!< Position of VREF1V2NET field. */
#define REGULATORS_ATEPOWER_VREF1V2NET_Msk (0x1UL << REGULATORS_ATEPOWER_VREF1V2NET_Pos) /*!< Bit mask of VREF1V2NET field. */
#define REGULATORS_ATEPOWER_VREF1V2NET_Disconnected (0UL) /*!< Disconnect */
#define REGULATORS_ATEPOWER_VREF1V2NET_Connected (1UL) /*!< Connect 0.9 V downscaled reference voltage to ATB0 */

/* Bits 24..22 : Connect or disconnect TBD to analog test bus */
#define REGULATORS_ATEPOWER_VREGRADIOBUCK_Pos (22UL) /*!< Position of VREGRADIOBUCK field. */
#define REGULATORS_ATEPOWER_VREGRADIOBUCK_Msk (0x7UL << REGULATORS_ATEPOWER_VREGRADIOBUCK_Pos) /*!< Bit mask of VREGRADIOBUCK field. */

/* Bits 21..20 : Connect or disconnect TBD  to analog test bus */
#define REGULATORS_ATEPOWER_VREGMAINULP_Pos (20UL) /*!< Position of VREGMAINULP field. */
#define REGULATORS_ATEPOWER_VREGMAINULP_Msk (0x3UL << REGULATORS_ATEPOWER_VREGMAINULP_Pos) /*!< Bit mask of VREGMAINULP field. */
#define REGULATORS_ATEPOWER_VREGMAINULP_Disconnected (0UL) /*!< Disconnect */
#define REGULATORS_ATEPOWER_VREGMAINULP_Connected (1UL) /*!< Connect to ATB1 */

/* Bits 19..18 : Connect or disconnect VREGRADIO DVDD0V9 to analog test bus */
#define REGULATORS_ATEPOWER_VREGHBUCK_Pos (18UL) /*!< Position of VREGHBUCK field. */
#define REGULATORS_ATEPOWER_VREGHBUCK_Msk (0x3UL << REGULATORS_ATEPOWER_VREGHBUCK_Pos) /*!< Bit mask of VREGHBUCK field. */
#define REGULATORS_ATEPOWER_VREGHBUCK_Disconnected (0UL) /*!< Disconnect */
#define REGULATORS_ATEPOWER_VREGHBUCK_Connected (1UL) /*!< Connect to ATB1 */

/* Bit 17 : Connect or disconnect TBD  to analog test bus */
#define REGULATORS_ATEPOWER_VREGHLDO_Pos (17UL) /*!< Position of VREGHLDO field. */
#define REGULATORS_ATEPOWER_VREGHLDO_Msk (0x1UL << REGULATORS_ATEPOWER_VREGHLDO_Pos) /*!< Bit mask of VREGHLDO field. */
#define REGULATORS_ATEPOWER_VREGHLDO_Disconnected (0UL) /*!< Disconnect */
#define REGULATORS_ATEPOWER_VREGHLDO_Connected (1UL) /*!< Connect to ATB1 */

/* Bits 16..15 : Connect or disconnect TBD  to analog test bus */
#define REGULATORS_ATEPOWER_VREGHULP_Pos (15UL) /*!< Position of VREGHULP field. */
#define REGULATORS_ATEPOWER_VREGHULP_Msk (0x3UL << REGULATORS_ATEPOWER_VREGHULP_Pos) /*!< Bit mask of VREGHULP field. */
#define REGULATORS_ATEPOWER_VREGHULP_Disconnected (0UL) /*!< Disconnect */
#define REGULATORS_ATEPOWER_VREGHULP_Connected (1UL) /*!< Connect to ATB1 */

/* Bit 14 : Connect or disconnect VREGRADIO AVDDSS to analog test bus */
#define REGULATORS_ATEPOWER_VREGRADIOAVSS_Pos (14UL) /*!< Position of VREGRADIOAVSS field. */
#define REGULATORS_ATEPOWER_VREGRADIOAVSS_Msk (0x1UL << REGULATORS_ATEPOWER_VREGRADIOAVSS_Pos) /*!< Bit mask of VREGRADIOAVSS field. */
#define REGULATORS_ATEPOWER_VREGRADIOAVSS_Disconnected (0UL) /*!< Disconnect */
#define REGULATORS_ATEPOWER_VREGRADIOAVSS_Connected (1UL) /*!< Connect to ATB1 */

/* Bit 13 : Connect or disconnect VREGRADIO DVDD0V9 to analog test bus */
#define REGULATORS_ATEPOWER_VREGNETWORKDVDD0V9_Pos (13UL) /*!< Position of VREGNETWORKDVDD0V9 field. */
#define REGULATORS_ATEPOWER_VREGNETWORKDVDD0V9_Msk (0x1UL << REGULATORS_ATEPOWER_VREGNETWORKDVDD0V9_Pos) /*!< Bit mask of VREGNETWORKDVDD0V9 field. */
#define REGULATORS_ATEPOWER_VREGNETWORKDVDD0V9_Disconnected (0UL) /*!< Disconnect */
#define REGULATORS_ATEPOWER_VREGNETWORKDVDD0V9_Connected (1UL) /*!< Connect to ATB1 */

/* Bit 12 : Connect or disconnect VREGRADIO AVDD1V3 to analog test bus */
#define REGULATORS_ATEPOWER_VREGRADIOAVDD1V3_Pos (12UL) /*!< Position of VREGRADIOAVDD1V3 field. */
#define REGULATORS_ATEPOWER_VREGRADIOAVDD1V3_Msk (0x1UL << REGULATORS_ATEPOWER_VREGRADIOAVDD1V3_Pos) /*!< Bit mask of VREGRADIOAVDD1V3 field. */
#define REGULATORS_ATEPOWER_VREGRADIOAVDD1V3_Disconnected (0UL) /*!< Disconnect */
#define REGULATORS_ATEPOWER_VREGRADIOAVDD1V3_Connected (1UL) /*!< Connect to ATB1 */

