adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Bits 11..9 : Test signals for the RST analog cell */
#define REGULATORS_ATEPOWER_RST_Pos (9UL) /*!< Position of RST field. */
#define REGULATORS_ATEPOWER_RST_Msk (0x7UL << REGULATORS_ATEPOWER_RST_Pos) /*!< Bit mask of RST field. */

/* Bit 8 : Connect or disconnect reference generator for Application flash to analog test bus */
#define REGULATORS_ATEPOWER_VREF1V2APP_Pos (8UL) /*!< Position of VREF1V2APP field. */
#define REGULATORS_ATEPOWER_VREF1V2APP_Msk (0x1UL << REGULATORS_ATEPOWER_VREF1V2APP_Pos) /*!< Bit mask of VREF1V2APP field. */
#define REGULATORS_ATEPOWER_VREF1V2APP_Disconnected (0UL) /*!< Disconnect */
#define REGULATORS_ATEPOWER_VREF1V2APP_Connected (1UL) /*!< Connect 0.9 V downscaled reference voltage to ATB0 */

/* Bits 6..5 : Configure connection of master bias generator to analog test bus */
#define REGULATORS_ATEPOWER_MBIAS_Pos (5UL) /*!< Position of MBIAS field. */
#define REGULATORS_ATEPOWER_MBIAS_Msk (0x3UL << REGULATORS_ATEPOWER_MBIAS_Pos) /*!< Bit mask of MBIAS field. */
#define REGULATORS_ATEPOWER_MBIAS_Disconnected (0UL) /*!< Disconnect */
#define REGULATORS_ATEPOWER_MBIAS_VBG (1UL) /*!< Connect 0.9 V bandgap voltage to ATB0 */
#define REGULATORS_ATEPOWER_MBIAS_IBPSR10U (2UL) /*!< Connect 10 uA IBPSR current to ATB1 */
#define REGULATORS_ATEPOWER_MBIAS_Both (3UL) /*!< Connect both VBG to ATB0 and IBPSR10U to ATB1 */

/* Bit 4 : Connect or disconnect VREGMAIN AVSS to analog test bus */
#define REGULATORS_ATEPOWER_VREGMAINAVSS_Pos (4UL) /*!< Position of VREGMAINAVSS field. */
#define REGULATORS_ATEPOWER_VREGMAINAVSS_Msk (0x1UL << REGULATORS_ATEPOWER_VREGMAINAVSS_Pos) /*!< Bit mask of VREGMAINAVSS field. */
#define REGULATORS_ATEPOWER_VREGMAINAVSS_Disconnected (0UL) /*!< Disconnect */
#define REGULATORS_ATEPOWER_VREGMAINAVSS_Connected (1UL) /*!< Connect to ATB1 */

/* Bit 3 : Connect or disconnect VREGMAIN DVDD_0V9 to analog test bus */
#define REGULATORS_ATEPOWER_VREGMAINVDD0V9_Pos (3UL) /*!< Position of VREGMAINVDD0V9 field. */
#define REGULATORS_ATEPOWER_VREGMAINVDD0V9_Msk (0x1UL << REGULATORS_ATEPOWER_VREGMAINVDD0V9_Pos) /*!< Bit mask of VREGMAINVDD0V9 field. */
#define REGULATORS_ATEPOWER_VREGMAINVDD0V9_Disconnected (0UL) /*!< Disconnect */
#define REGULATORS_ATEPOWER_VREGMAINVDD0V9_Connected (1UL) /*!< Connect to ATB0 */

/* Bit 2 : Connect or disconnect VREGANA AVDD_1V3 to analog test bus */
#define REGULATORS_ATEPOWER_VREGANAAVDD1V3_Pos (2UL) /*!< Position of VREGANAAVDD1V3 field. */
#define REGULATORS_ATEPOWER_VREGANAAVDD1V3_Msk (0x1UL << REGULATORS_ATEPOWER_VREGANAAVDD1V3_Pos) /*!< Bit mask of VREGANAAVDD1V3 field. */
#define REGULATORS_ATEPOWER_VREGANAAVDD1V3_Disconnected (0UL) /*!< Disconnect */
#define REGULATORS_ATEPOWER_VREGANAAVDD1V3_Connected (1UL) /*!< Connect to ATB0 */

/* Bit 1 : Enable or disable overvoltage clamp on analog test bus */
#define REGULATORS_ATEPOWER_OVCLAMP_Pos (1UL) /*!< Position of OVCLAMP field. */
#define REGULATORS_ATEPOWER_OVCLAMP_Msk (0x1UL << REGULATORS_ATEPOWER_OVCLAMP_Pos) /*!< Bit mask of OVCLAMP field. */
#define REGULATORS_ATEPOWER_OVCLAMP_Disabled (0UL) /*!< Disable */
#define REGULATORS_ATEPOWER_OVCLAMP_Enabled (1UL) /*!< Enable */

/* Bit 0 : Enable or disable power-down clamp on analog test bus */
#define REGULATORS_ATEPOWER_PDCLAMP_Pos (0UL) /*!< Position of PDCLAMP field. */
#define REGULATORS_ATEPOWER_PDCLAMP_Msk (0x1UL << REGULATORS_ATEPOWER_PDCLAMP_Pos) /*!< Bit mask of PDCLAMP field. */
#define REGULATORS_ATEPOWER_PDCLAMP_Disabled (0UL) /*!< Disable */
#define REGULATORS_ATEPOWER_PDCLAMP_Enabled (1UL) /*!< Enable */

/* Register: REGULATORS_VREGMAIN_VOUT */
/* Description: Control the output voltage for DVDD_1V3 */

/* Bits 1..0 : Output voltage */
#define REGULATORS_VREGMAIN_VOUT_VOUT_Pos (0UL) /*!< Position of VOUT field. */
#define REGULATORS_VREGMAIN_VOUT_VOUT_Msk (0x3UL << REGULATORS_VREGMAIN_VOUT_VOUT_Pos) /*!< Bit mask of VOUT field. */
#define REGULATORS_VREGMAIN_VOUT_VOUT_00 (0UL) /*!< 1.0 V */
#define REGULATORS_VREGMAIN_VOUT_VOUT_01 (1UL) /*!< 1.09 V */
#define REGULATORS_VREGMAIN_VOUT_VOUT_10 (2UL) /*!< 1.17 V (default) - should be adjusted to  1.20 */
#define REGULATORS_VREGMAIN_VOUT_VOUT_11 (3UL) /*!< 1.26 V */

/* Register: REGULATORS_VREGMAIN_DCDCEN */
/* Description: DC/DC enable register for main regulator. */

/* Bit 0 : Enable or disable DC/DC converter */
#define REGULATORS_VREGMAIN_DCDCEN_DCDCEN_Pos (0UL) /*!< Position of DCDCEN field. */
#define REGULATORS_VREGMAIN_DCDCEN_DCDCEN_Msk (0x1UL << REGULATORS_VREGMAIN_DCDCEN_DCDCEN_Pos) /*!< Bit mask of DCDCEN field. */
#define REGULATORS_VREGMAIN_DCDCEN_DCDCEN_Disabled (0UL) /*!< Disable */
#define REGULATORS_VREGMAIN_DCDCEN_DCDCEN_Enabled (1UL) /*!< Enable */

/* Register: REGULATORS_VREGMAIN_FORCEREGMODE */
/* Description: 3-bit backdoor register for manual selection of power mode */

/* Bits 2..0 : Force Regulator Mode to value */
#define REGULATORS_VREGMAIN_FORCEREGMODE_FORCEREGMODE_Pos (0UL) /*!< Position of FORCEREGMODE field. */
#define REGULATORS_VREGMAIN_FORCEREGMODE_FORCEREGMODE_Msk (0x7UL << REGULATORS_VREGMAIN_FORCEREGMODE_FORCEREGMODE_Pos) /*!< Bit mask of FORCEREGMODE field. */
#define REGULATORS_VREGMAIN_FORCEREGMODE_FORCEREGMODE_EXT (0UL) /*!< Force external (DVDD_0V9 supplied externally) */
#define REGULATORS_VREGMAIN_FORCEREGMODE_FORCEREGMODE_ULP (1UL) /*!< Force ULP mode */
#define REGULATORS_VREGMAIN_FORCEREGMODE_FORCEREGMODE_LDO (2UL) /*!< Force LDO mode */
#define REGULATORS_VREGMAIN_FORCEREGMODE_FORCEREGMODE_DCDC (3UL) /*!< Force DCDC mode */
#define REGULATORS_VREGMAIN_FORCEREGMODE_FORCEREGMODE_DCDC_REFRESH (4UL) /*!< Force DCDC REFRESH mode */

/* Register: REGULATORS_VREGMAIN_PWRREGTHRESHOLD */
/* Description: Set threshold value of power regulator */

/* Bits 6..0 : Sets the threshold value of power regulator. */
#define REGULATORS_VREGMAIN_PWRREGTHRESHOLD_PWRREGTHRESHOLD_Pos (0UL) /*!< Position of PWRREGTHRESHOLD field. */
#define REGULATORS_VREGMAIN_PWRREGTHRESHOLD_PWRREGTHRESHOLD_Msk (0x7FUL << REGULATORS_VREGMAIN_PWRREGTHRESHOLD_PWRREGTHRESHOLD_Pos) /*!< Bit mask of PWRREGTHRESHOLD field. */

/* Register: REGULATORS_VREGMAIN_ENFORCEPWRREGMODE */
/* Description: Enable forcing of power mode in power regulator */

/* Bit 0 : Enable forcing of power mode in power regulator */
#define REGULATORS_VREGMAIN_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Pos (0UL) /*!< Position of ENFORCEPWRREGMODE field. */
#define REGULATORS_VREGMAIN_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Msk (0x1UL << REGULATORS_VREGMAIN_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Pos) /*!< Bit mask of ENFORCEPWRREGMODE field. */
#define REGULATORS_VREGMAIN_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Disabled (0UL) /*!< Pwr regulator forcing off */
#define REGULATORS_VREGMAIN_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Enabled (1UL) /*!< Pwr regulator mode forced to value given by FORCEREGMODE */

/* Register: REGULATORS_VREGMAIN_CURRENTPWRREGMODE */
/* Description: Current mode in the power regulator */

/* Bits 3..0 : Current mode in the power regulator */
#define REGULATORS_VREGMAIN_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Pos (0UL) /*!< Position of CURRENTPWRREGMODE field. */
#define REGULATORS_VREGMAIN_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Msk (0xFUL << REGULATORS_VREGMAIN_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Pos) /*!< Bit mask of CURRENTPWRREGMODE field. */

/* Register: REGULATORS_VREGMAIN_DISABLEHSLIMIT */
/* Description: Disable HSLIMIT */

/* Bit 0 : Enable or disable HSLIMIT for DCDC regulator */
#define REGULATORS_VREGMAIN_DISABLEHSLIMIT_DISABLE_Pos (0UL) /*!< Position of DISABLE field. */
#define REGULATORS_VREGMAIN_DISABLEHSLIMIT_DISABLE_Msk (0x1UL << REGULATORS_VREGMAIN_DISABLEHSLIMIT_DISABLE_Pos) /*!< Bit mask of DISABLE field. */
#define REGULATORS_VREGMAIN_DISABLEHSLIMIT_DISABLE_Enabled (0UL) /*!< Enable HSLIMIT */
#define REGULATORS_VREGMAIN_DISABLEHSLIMIT_DISABLE_Disabled (1UL) /*!< Disable HSLIMIT */

/* Register: REGULATORS_VREGMAIN_LDOTESTLOAD */
/* Description: Test load setting for VREGMAIN */

/* Bits 2..0 : Output load configuration (for test purposes) */
#define REGULATORS_VREGMAIN_LDOTESTLOAD_VREGLOAD_Pos (0UL) /*!< Position of VREGLOAD field. */
#define REGULATORS_VREGMAIN_LDOTESTLOAD_VREGLOAD_Msk (0x7UL << REGULATORS_VREGMAIN_LDOTESTLOAD_VREGLOAD_Pos) /*!< Bit mask of VREGLOAD field. */
#define REGULATORS_VREGMAIN_LDOTESTLOAD_VREGLOAD_NormalOperation (0UL) /*!< Normal operation (default) */
#define REGULATORS_VREGMAIN_LDOTESTLOAD_VREGLOAD_1mATestLoad (1UL) /*!< 1mA test load */
#define REGULATORS_VREGMAIN_LDOTESTLOAD_VREGLOAD_50mATestLoad (2UL) /*!< 50mA test load */
#define REGULATORS_VREGMAIN_LDOTESTLOAD_VREGLOAD_150mATestLoad (3UL) /*!< 150mA test load */

