adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Register: REGULATORS_VREGMAIN_LDOCAL */
/* Description: Calibration register for the VREGMAIN LDO regulator. */

/* Bits 2..0 : Output voltage calibration. */
#define REGULATORS_VREGMAIN_LDOCAL_VREGTRIM_Pos (0UL) /*!< Position of VREGTRIM field. */
#define REGULATORS_VREGMAIN_LDOCAL_VREGTRIM_Msk (0x7UL << REGULATORS_VREGMAIN_LDOCAL_VREGTRIM_Pos) /*!< Bit mask of VREGTRIM field. */
#define REGULATORS_VREGMAIN_LDOCAL_VREGTRIM_000 (0UL) /*!< 1.082 V */
#define REGULATORS_VREGMAIN_LDOCAL_VREGTRIM_001 (1UL) /*!< 1.108 V */
#define REGULATORS_VREGMAIN_LDOCAL_VREGTRIM_010 (2UL) /*!< 1.136 V */
#define REGULATORS_VREGMAIN_LDOCAL_VREGTRIM_011 (3UL) /*!< 1.163 V */
#define REGULATORS_VREGMAIN_LDOCAL_VREGTRIM_100 (4UL) /*!< 0.980 V */
#define REGULATORS_VREGMAIN_LDOCAL_VREGTRIM_101 (5UL) /*!< 1.003 V */
#define REGULATORS_VREGMAIN_LDOCAL_VREGTRIM_110 (6UL) /*!< 1.029 V */
#define REGULATORS_VREGMAIN_LDOCAL_VREGTRIM_111 (7UL) /*!< 1.054 V */

/* Register: REGULATORS_VREGMAIN_VREGHIGH */
/* Description: Increase voltage to AVDD_1V3 levels for VREGMAIN  LDO regulator */

/* Bit 0 : Enable or disable the feature */
#define REGULATORS_VREGMAIN_VREGHIGH_ENABLE_Pos (0UL) /*!< Position of ENABLE field. */
#define REGULATORS_VREGMAIN_VREGHIGH_ENABLE_Msk (0x1UL << REGULATORS_VREGMAIN_VREGHIGH_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define REGULATORS_VREGMAIN_VREGHIGH_ENABLE_Disabled (0UL) /*!< Nominal output levels of VREGMAIN LDO */
#define REGULATORS_VREGMAIN_VREGHIGH_ENABLE_Enabled (1UL) /*!< Increased output levels of VREGMAIN LDO */

/* Register: REGULATORS_VREGMAIN_BUCKCAL */
/* Description: Calibration register for VREGMAIN DCDC regulator. */

/* Bits 4..0 : Output voltage calibration. 0: Minimum output voltage level. 31: Maximum output voltage level. */
#define REGULATORS_VREGMAIN_BUCKCAL_BUCK_CAL_Pos (0UL) /*!< Position of BUCK_CAL field. */
#define REGULATORS_VREGMAIN_BUCKCAL_BUCK_CAL_Msk (0x1FUL << REGULATORS_VREGMAIN_BUCKCAL_BUCK_CAL_Pos) /*!< Bit mask of BUCK_CAL field. */

/* Register: REGULATORS_VREGMAIN_BUCKCKSEL */
/* Description: Input clock selection for VREGMAIN DCDC regulator. */

/* Bits 1..0 : Input clock selection. */
#define REGULATORS_VREGMAIN_BUCKCKSEL_BUCKCKSEL_Pos (0UL) /*!< Position of BUCKCKSEL field. */
#define REGULATORS_VREGMAIN_BUCKCKSEL_BUCKCKSEL_Msk (0x3UL << REGULATORS_VREGMAIN_BUCKCKSEL_BUCKCKSEL_Pos) /*!< Bit mask of BUCKCKSEL field. */
#define REGULATORS_VREGMAIN_BUCKCKSEL_BUCKCKSEL_NORMAL (0UL) /*!< normal clock */
#define REGULATORS_VREGMAIN_BUCKCKSEL_BUCKCKSEL_INVERTED (1UL) /*!< inverted clock */

/* Register: REGULATORS_VREGMAIN_BUCKDROUTSEL */
/* Description: Pre-driver speed control */

/* Bits 3..0 : 0: Minimum driver speed, low efficiency, low noise. 7: Medium driver speed, medium efficiency, medium noise. 15: Maximum driver speed, high efficiency, high noise. */
#define REGULATORS_VREGMAIN_BUCKDROUTSEL_BUCKDROUTSEL_Pos (0UL) /*!< Position of BUCKDROUTSEL field. */
#define REGULATORS_VREGMAIN_BUCKDROUTSEL_BUCKDROUTSEL_Msk (0xFUL << REGULATORS_VREGMAIN_BUCKDROUTSEL_BUCKDROUTSEL_Pos) /*!< Bit mask of BUCKDROUTSEL field. */

/* Register: REGULATORS_VREGMAIN_ULPDVDDSELREF */
/* Description: Select DVDD0V9 reference */

/* Bits 1..0 : Output voltage calibration. 0: 0.75V ratio of AVDD1V3 output (default) 1: 0.75V reference 2: AVDD1V3 as reference. 3: Reserved for future use. */
#define REGULATORS_VREGMAIN_ULPDVDDSELREF_ULPDVDDSELREF_Pos (0UL) /*!< Position of ULPDVDDSELREF field. */
#define REGULATORS_VREGMAIN_ULPDVDDSELREF_ULPDVDDSELREF_Msk (0x3UL << REGULATORS_VREGMAIN_ULPDVDDSELREF_ULPDVDDSELREF_Pos) /*!< Bit mask of ULPDVDDSELREF field. */

/* Register: REGULATORS_VREGMAIN_ULPRESCTRL */
/* Description: Switched resistor control */

/* Bits 1..0 : Output voltage calibration. 0: switched with internal oscillator (default). 1: switched with CLK2K input 2: force always on. 3: force off (PWRUPs must be 0 otherwise default). */
#define REGULATORS_VREGMAIN_ULPRESCTRL_ULPRESCTRL_Pos (0UL) /*!< Position of ULPRESCTRL field. */
#define REGULATORS_VREGMAIN_ULPRESCTRL_ULPRESCTRL_Msk (0x3UL << REGULATORS_VREGMAIN_ULPRESCTRL_ULPRESCTRL_Pos) /*!< Bit mask of ULPRESCTRL field. */

/* Register: REGULATORS_VREGMAIN_ULPICTRL */
/* Description: Adjusts current in reference (production calibrated) */

/* Bits 3..0 : 0: minimum current. 7: default. 15: maximum current. */
#define REGULATORS_VREGMAIN_ULPICTRL_ULPICTRL_Pos (0UL) /*!< Position of ULPICTRL field. */
#define REGULATORS_VREGMAIN_ULPICTRL_ULPICTRL_Msk (0xFUL << REGULATORS_VREGMAIN_ULPICTRL_ULPICTRL_Pos) /*!< Bit mask of ULPICTRL field. */

/* Register: REGULATORS_VREGMAIN_VCORECTRL */
/* Description: Spare digital signals */

/* Bits 1..0 : TBD */
#define REGULATORS_VREGMAIN_VCORECTRL_VCORECTRL_Pos (0UL) /*!< Position of VCORECTRL field. */
#define REGULATORS_VREGMAIN_VCORECTRL_VCORECTRL_Msk (0x3UL << REGULATORS_VREGMAIN_VCORECTRL_VCORECTRL_Pos) /*!< Bit mask of VCORECTRL field. */

/* Register: REGULATORS_VREGMAIN_VCORECALIBVCO */
/* Description: Internal oscillator calibration word */

/* Bits 4..0 : 0: Low output frequency. 15: Default output frequency. 31: High output frequency. */
#define REGULATORS_VREGMAIN_VCORECALIBVCO_VCORECALIBVCO_Pos (0UL) /*!< Position of VCORECALIBVCO field. */
#define REGULATORS_VREGMAIN_VCORECALIBVCO_VCORECALIBVCO_Msk (0x1FUL << REGULATORS_VREGMAIN_VCORECALIBVCO_VCORECALIBVCO_Pos) /*!< Bit mask of VCORECALIBVCO field. */

/* Register: REGULATORS_VREGANA_FORCEREGMODE */
/* Description: 3-bit backdoor register for manual selection of power mode */

/* Bits 2..0 : Force Regulator Mode to value */
#define REGULATORS_VREGANA_FORCEREGMODE_FORCEREGMODE_Pos (0UL) /*!< Position of FORCEREGMODE field. */
#define REGULATORS_VREGANA_FORCEREGMODE_FORCEREGMODE_Msk (0x7UL << REGULATORS_VREGANA_FORCEREGMODE_FORCEREGMODE_Pos) /*!< Bit mask of FORCEREGMODE field. */
#define REGULATORS_VREGANA_FORCEREGMODE_FORCEREGMODE_EXT (0UL) /*!< Force external (DVDD_0V9 supplied externally) */
#define REGULATORS_VREGANA_FORCEREGMODE_FORCEREGMODE_ULP (1UL) /*!< Force ULP mode */
#define REGULATORS_VREGANA_FORCEREGMODE_FORCEREGMODE_LDO (2UL) /*!< Force LDO mode */

