adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Register: REGULATORS_VREGANA_ENFORCEPWRREGMODE */
/* Description: Enable forcing of power mode in power regulator */

/* Bit 0 : Enable forcing of power mode in power regulator */
#define REGULATORS_VREGANA_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Pos (0UL) /*!< Position of ENFORCEPWRREGMODE field. */
#define REGULATORS_VREGANA_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Msk (0x1UL << REGULATORS_VREGANA_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Pos) /*!< Bit mask of ENFORCEPWRREGMODE field. */
#define REGULATORS_VREGANA_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Disabled (0UL) /*!< Pwr regulator forcing off */
#define REGULATORS_VREGANA_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Enabled (1UL) /*!< Pwr regulator mode forced to value given by FORCEREGMODE */

/* Register: REGULATORS_VREGANA_CURRENTPWRREGMODE */
/* Description: Current mode in the power regulator */

/* Bits 3..0 : Current mode in the power regulator */
#define REGULATORS_VREGANA_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Pos (0UL) /*!< Position of CURRENTPWRREGMODE field. */
#define REGULATORS_VREGANA_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Msk (0xFUL << REGULATORS_VREGANA_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Pos) /*!< Bit mask of CURRENTPWRREGMODE field. */

/* Register: REGULATORS_VREGANA_DISABLEHSLIMIT */
/* Description: Disable HSLIMIT */

/* Bit 0 : Enable or disable HSLIMIT */
#define REGULATORS_VREGANA_DISABLEHSLIMIT_DISABLE_Pos (0UL) /*!< Position of DISABLE field. */
#define REGULATORS_VREGANA_DISABLEHSLIMIT_DISABLE_Msk (0x1UL << REGULATORS_VREGANA_DISABLEHSLIMIT_DISABLE_Pos) /*!< Bit mask of DISABLE field. */
#define REGULATORS_VREGANA_DISABLEHSLIMIT_DISABLE_Enabled (0UL) /*!< Enable HSLIMIT */
#define REGULATORS_VREGANA_DISABLEHSLIMIT_DISABLE_Disabled (1UL) /*!< Disable HSLIMIT */

/* Register: REGULATORS_VREGANA_LDOTESTLOAD */
/* Description: Test load setting for VREGANA. */

/* Bits 2..0 : Output load configuration (for test purposes) */
#define REGULATORS_VREGANA_LDOTESTLOAD_VREGLOAD_Pos (0UL) /*!< Position of VREGLOAD field. */
#define REGULATORS_VREGANA_LDOTESTLOAD_VREGLOAD_Msk (0x7UL << REGULATORS_VREGANA_LDOTESTLOAD_VREGLOAD_Pos) /*!< Bit mask of VREGLOAD field. */
#define REGULATORS_VREGANA_LDOTESTLOAD_VREGLOAD_NormalOperation (0UL) /*!< Normal operation (default) */
#define REGULATORS_VREGANA_LDOTESTLOAD_VREGLOAD_1mATestLoad (1UL) /*!< 1mA test load */
#define REGULATORS_VREGANA_LDOTESTLOAD_VREGLOAD_50mATestLoad (2UL) /*!< 50mA test load */
#define REGULATORS_VREGANA_LDOTESTLOAD_VREGLOAD_150mATestLoad (3UL) /*!< 150mA test load */

/* Register: REGULATORS_VREGANA_LDOCAL */
/* Description: Configuration register for the VREGANA LDO regulator. */

/* Bits 2..0 : Output voltage calibration. */
#define REGULATORS_VREGANA_LDOCAL_VREGTRIM_Pos (0UL) /*!< Position of VREGTRIM field. */
#define REGULATORS_VREGANA_LDOCAL_VREGTRIM_Msk (0x7UL << REGULATORS_VREGANA_LDOCAL_VREGTRIM_Pos) /*!< Bit mask of VREGTRIM field. */
#define REGULATORS_VREGANA_LDOCAL_VREGTRIM_000 (0UL) /*!< 1.255 V */
#define REGULATORS_VREGANA_LDOCAL_VREGTRIM_001 (1UL) /*!< 1.289 V */
#define REGULATORS_VREGANA_LDOCAL_VREGTRIM_010 (2UL) /*!< 1.324 V */
#define REGULATORS_VREGANA_LDOCAL_VREGTRIM_011 (3UL) /*!< 1.357 V */
#define REGULATORS_VREGANA_LDOCAL_VREGTRIM_100 (4UL) /*!< 1.170 V */
#define REGULATORS_VREGANA_LDOCAL_VREGTRIM_101 (5UL) /*!< 1.150 V */
#define REGULATORS_VREGANA_LDOCAL_VREGTRIM_110 (6UL) /*!< 1.185 V */
#define REGULATORS_VREGANA_LDOCAL_VREGTRIM_111 (7UL) /*!< 1.219 V */

/* Register: REGULATORS_VREGANA_ULPCAL */
/* Description: Calibration  register for VREGANA ULP regulator . */

/* Bits 4..0 : Output voltage calibration. 0: minimum voltage 31: maximum voltage */
#define REGULATORS_VREGANA_ULPCAL_ULPTRIM_Pos (0UL) /*!< Position of ULPTRIM field. */
#define REGULATORS_VREGANA_ULPCAL_ULPTRIM_Msk (0x1FUL << REGULATORS_VREGANA_ULPCAL_ULPTRIM_Pos) /*!< Bit mask of ULPTRIM field. */

/* Register: REGULATORS_VREGRADIO_VOUT */
/* Description: Control the output voltage for RVDD_1V3 Note: This is overridden by VOUTREQH when VREQH is requested by the network MCU. */

/* Bits 1..0 : Output voltage */
#define REGULATORS_VREGRADIO_VOUT_VOUT_Pos (0UL) /*!< Position of VOUT field. */
#define REGULATORS_VREGRADIO_VOUT_VOUT_Msk (0x3UL << REGULATORS_VREGRADIO_VOUT_VOUT_Pos) /*!< Bit mask of VOUT field. */
#define REGULATORS_VREGRADIO_VOUT_VOUT_00 (0UL) /*!< 1.0 V */
#define REGULATORS_VREGRADIO_VOUT_VOUT_01 (1UL) /*!< 1.09 V */
#define REGULATORS_VREGRADIO_VOUT_VOUT_10 (2UL) /*!< 1.18 V */
#define REGULATORS_VREGRADIO_VOUT_VOUT_11 (3UL) /*!< 1.27 V */

/* Register: REGULATORS_VREGRADIO_DCDCEN */
/* Description: DC/DC enable register for VREGRADIO */

/* Bit 0 : Enable or disable DC/DC converter */
#define REGULATORS_VREGRADIO_DCDCEN_DCDCEN_Pos (0UL) /*!< Position of DCDCEN field. */
#define REGULATORS_VREGRADIO_DCDCEN_DCDCEN_Msk (0x1UL << REGULATORS_VREGRADIO_DCDCEN_DCDCEN_Pos) /*!< Bit mask of DCDCEN field. */
#define REGULATORS_VREGRADIO_DCDCEN_DCDCEN_Disabled (0UL) /*!< Disable */
#define REGULATORS_VREGRADIO_DCDCEN_DCDCEN_Enabled (1UL) /*!< Enable */

/* Register: REGULATORS_VREGRADIO_ENFORCEPWRREGMODE */
/* Description: Enable forcing of power mode in power regulator */

/* Bit 0 : Enable forcing of power mode in power regulator */
#define REGULATORS_VREGRADIO_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Pos (0UL) /*!< Position of ENFORCEPWRREGMODE field. */
#define REGULATORS_VREGRADIO_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Msk (0x1UL << REGULATORS_VREGRADIO_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Pos) /*!< Bit mask of ENFORCEPWRREGMODE field. */
#define REGULATORS_VREGRADIO_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Disabled (0UL) /*!< Pwr regulator forcing off */
#define REGULATORS_VREGRADIO_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Enabled (1UL) /*!< Pwr regulator mode forced to value given by FORCEREGMODE */

/* Register: REGULATORS_VREGRADIO_FORCEREGMODE */
/* Description: 3-bit backdoor register for manual selection of power mode */

/* Bits 2..0 : Force Regulator Mode to value */
#define REGULATORS_VREGRADIO_FORCEREGMODE_FORCEREGMODE_Pos (0UL) /*!< Position of FORCEREGMODE field. */
#define REGULATORS_VREGRADIO_FORCEREGMODE_FORCEREGMODE_Msk (0x7UL << REGULATORS_VREGRADIO_FORCEREGMODE_FORCEREGMODE_Pos) /*!< Bit mask of FORCEREGMODE field. */
#define REGULATORS_VREGRADIO_FORCEREGMODE_FORCEREGMODE_Ext (0UL) /*!< Forceo external */
#define REGULATORS_VREGRADIO_FORCEREGMODE_FORCEREGMODE_ULP (1UL) /*!< Force ULP mode */
#define REGULATORS_VREGRADIO_FORCEREGMODE_FORCEREGMODE_LDO (2UL) /*!< Force LDO mode */
#define REGULATORS_VREGRADIO_FORCEREGMODE_FORCEREGMODE_DCDC (3UL) /*!< Force DCDC mode */
#define REGULATORS_VREGRADIO_FORCEREGMODE_FORCEREGMODE_REF (4UL) /*!< Force REF mode */

/* Register: REGULATORS_VREGRADIO_CURRENTPWRREGMODE */
/* Description: Current mode in the power regulator */

/* Bits 3..0 : Current mode in the power regulator */
#define REGULATORS_VREGRADIO_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Pos (0UL) /*!< Position of CURRENTPWRREGMODE field. */
#define REGULATORS_VREGRADIO_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Msk (0xFUL << REGULATORS_VREGRADIO_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Pos) /*!< Bit mask of CURRENTPWRREGMODE field. */
#define REGULATORS_VREGRADIO_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Ext (0UL) /*!< External */
#define REGULATORS_VREGRADIO_CURRENTPWRREGMODE_CURRENTPWRREGMODE_DCDC (2UL) /*!< DCDC */
#define REGULATORS_VREGRADIO_CURRENTPWRREGMODE_CURRENTPWRREGMODE_REF (3UL) /*!< REF */
#define REGULATORS_VREGRADIO_CURRENTPWRREGMODE_CURRENTPWRREGMODE_LDO (4UL) /*!< ULP DCDC */
#define REGULATORS_VREGRADIO_CURRENTPWRREGMODE_CURRENTPWRREGMODE_LDO_DCDC (6UL) /*!< LDO DCDC */
#define REGULATORS_VREGRADIO_CURRENTPWRREGMODE_CURRENTPWRREGMODE_LDO_REF (7UL) /*!< LDO REF */
#define REGULATORS_VREGRADIO_CURRENTPWRREGMODE_CURRENTPWRREGMODE_ULP (8UL) /*!< ULP */
#define REGULATORS_VREGRADIO_CURRENTPWRREGMODE_CURRENTPWRREGMODE_DCDC_ULP (10UL) /*!< ULP DCDC */
#define REGULATORS_VREGRADIO_CURRENTPWRREGMODE_CURRENTPWRREGMODE_REF_ULP (11UL) /*!< REF ULP */
#define REGULATORS_VREGRADIO_CURRENTPWRREGMODE_CURRENTPWRREGMODE_ULP_LDO (12UL) /*!< ULP DCDC */

/* Register: REGULATORS_VREGRADIO_TESTLOAD */
/* Description: Test load setting for VREGRADIO. */

/* Bits 2..0 : Output load configuration (for test purposes) */
#define REGULATORS_VREGRADIO_TESTLOAD_TESTLOAD_Pos (0UL) /*!< Position of TESTLOAD field. */
#define REGULATORS_VREGRADIO_TESTLOAD_TESTLOAD_Msk (0x7UL << REGULATORS_VREGRADIO_TESTLOAD_TESTLOAD_Pos) /*!< Bit mask of TESTLOAD field. */
#define REGULATORS_VREGRADIO_TESTLOAD_TESTLOAD_NormalOperation (0UL) /*!< Normal operation (default) */
#define REGULATORS_VREGRADIO_TESTLOAD_TESTLOAD_1mATestLoad (1UL) /*!< 1mA test load */
#define REGULATORS_VREGRADIO_TESTLOAD_TESTLOAD_20mATestLoad (2UL) /*!< 20mA test load */

