adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Register: REGULATORS_VREGRADIO_ULPCAL */
/* Description: Calibration  VREGRADIO ULP regulator */

/* Bits 3..0 : Calibration value */
#define REGULATORS_VREGRADIO_ULPCAL_CAL_Pos (0UL) /*!< Position of CAL field. */
#define REGULATORS_VREGRADIO_ULPCAL_CAL_Msk (0xFUL << REGULATORS_VREGRADIO_ULPCAL_CAL_Pos) /*!< Bit mask of CAL field. */

/* Register: REGULATORS_VREGRADIO_DEBUG */
/* Description: Debug register - Control spare signals in POWER_LVLP */

/* Bits 13..0 : Connected to POWER_LVLP_DEBUG_0V9[12:0] */
#define REGULATORS_VREGRADIO_DEBUG_DEBUG_Pos (0UL) /*!< Position of DEBUG field. */
#define REGULATORS_VREGRADIO_DEBUG_DEBUG_Msk (0x3FFFUL << REGULATORS_VREGRADIO_DEBUG_DEBUG_Pos) /*!< Bit mask of DEBUG field. */

/* Register: REGULATORS_VREGRADIO_VOUTREQH */
/* Description: Control the output voltage for RVDD_1V3 when VREQH is asserted. VREQH can be asserted through the network MCU. */

/* Bits 1..0 : Output voltage */
#define REGULATORS_VREGRADIO_VOUTREQH_VOUT_Pos (0UL) /*!< Position of VOUT field. */
#define REGULATORS_VREGRADIO_VOUTREQH_VOUT_Msk (0x3UL << REGULATORS_VREGRADIO_VOUTREQH_VOUT_Pos) /*!< Bit mask of VOUT field. */
#define REGULATORS_VREGRADIO_VOUTREQH_VOUT_00 (0UL) /*!< 1.0 V */
#define REGULATORS_VREGRADIO_VOUTREQH_VOUT_01 (1UL) /*!< 1.09 V */
#define REGULATORS_VREGRADIO_VOUTREQH_VOUT_10 (2UL) /*!< 1.18 V */
#define REGULATORS_VREGRADIO_VOUTREQH_VOUT_11 (3UL) /*!< 1.27 V */

/* Register: REGULATORS_VREGRADIO_BUCKCALMAXILIM */
/* Description: TBD */

/* Bits 1..0 : TBD */
#define REGULATORS_VREGRADIO_BUCKCALMAXILIM_CALMAXILIM_Pos (0UL) /*!< Position of CALMAXILIM field. */
#define REGULATORS_VREGRADIO_BUCKCALMAXILIM_CALMAXILIM_Msk (0x3UL << REGULATORS_VREGRADIO_BUCKCALMAXILIM_CALMAXILIM_Pos) /*!< Bit mask of CALMAXILIM field. */

/* Register: REGULATORS_VREGRADIO_BUCKCALPWM */
/* Description: TBD */

/* Bits 4..0 : TBD */
#define REGULATORS_VREGRADIO_BUCKCALPWM_CALPWM_Pos (0UL) /*!< Position of CALPWM field. */
#define REGULATORS_VREGRADIO_BUCKCALPWM_CALPWM_Msk (0x1FUL << REGULATORS_VREGRADIO_BUCKCALPWM_CALPWM_Pos) /*!< Bit mask of CALPWM field. */

/* Register: REGULATORS_VREGRADIO_BUCKPFMEN */
/* Description: PFM enable register for VREGRADIO regulator */

/* Bit 0 : Enable or disable PFM in VREGRADIO regulator */
#define REGULATORS_VREGRADIO_BUCKPFMEN_PFMEN_Pos (0UL) /*!< Position of PFMEN field. */
#define REGULATORS_VREGRADIO_BUCKPFMEN_PFMEN_Msk (0x1UL << REGULATORS_VREGRADIO_BUCKPFMEN_PFMEN_Pos) /*!< Bit mask of PFMEN field. */
#define REGULATORS_VREGRADIO_BUCKPFMEN_PFMEN_Disabled (0UL) /*!< Disable PFM (default) */
#define REGULATORS_VREGRADIO_BUCKPFMEN_PFMEN_Enabled (1UL) /*!< Enable PFM */

/* Register: REGULATORS_VREGRADIO_BUCKPFMCAL */
/* Description: TBD */

/* Bits 3..0 : TBD */
#define REGULATORS_VREGRADIO_BUCKPFMCAL_PFMCAL_Pos (0UL) /*!< Position of PFMCAL field. */
#define REGULATORS_VREGRADIO_BUCKPFMCAL_PFMCAL_Msk (0xFUL << REGULATORS_VREGRADIO_BUCKPFMCAL_PFMCAL_Pos) /*!< Bit mask of PFMCAL field. */

/* Register: REGULATORS_VREGRADIO_BUCKPFMICMPCAL */
/* Description: TBD */

/* Bits 2..0 : TBD */
#define REGULATORS_VREGRADIO_BUCKPFMICMPCAL_PFMICMPCAL_Pos (0UL) /*!< Position of PFMICMPCAL field. */
#define REGULATORS_VREGRADIO_BUCKPFMICMPCAL_PFMICMPCAL_Msk (0x7UL << REGULATORS_VREGRADIO_BUCKPFMICMPCAL_PFMICMPCAL_Pos) /*!< Bit mask of PFMICMPCAL field. */

/* Register: REGULATORS_VREGRADIO_BUCKPFMICMPCOUNT */
/* Description: TBD */

/* Bits 15..0 : TBD */
#define REGULATORS_VREGRADIO_BUCKPFMICMPCOUNT_PFMICMPCOUNT_Pos (0UL) /*!< Position of PFMICMPCOUNT field. */
#define REGULATORS_VREGRADIO_BUCKPFMICMPCOUNT_PFMICMPCOUNT_Msk (0xFFFFUL << REGULATORS_VREGRADIO_BUCKPFMICMPCOUNT_PFMICMPCOUNT_Pos) /*!< Bit mask of PFMICMPCOUNT field. */

/* Register: REGULATORS_VREGRADIO_PWRREGTHRESHOLD */
/* Description: Set threshold value of power regulator */

/* Bits 6..0 : Sets the threshold value of power regulator. */
#define REGULATORS_VREGRADIO_PWRREGTHRESHOLD_PWRREGTHRESHOLD_Pos (0UL) /*!< Position of PWRREGTHRESHOLD field. */
#define REGULATORS_VREGRADIO_PWRREGTHRESHOLD_PWRREGTHRESHOLD_Msk (0x7FUL << REGULATORS_VREGRADIO_PWRREGTHRESHOLD_PWRREGTHRESHOLD_Pos) /*!< Bit mask of PWRREGTHRESHOLD field. */

/* Register: REGULATORS_VREGNETWORK_VOUT */
/* Description: Control the output voltage for DVDD_0V9 */

/* Bits 3..0 : Output voltage */
#define REGULATORS_VREGNETWORK_VOUT_VOUT_Pos (0UL) /*!< Position of VOUT field. */
#define REGULATORS_VREGNETWORK_VOUT_VOUT_Msk (0xFUL << REGULATORS_VREGNETWORK_VOUT_VOUT_Pos) /*!< Bit mask of VOUT field. */

/* Register: REGULATORS_VREGNETWORK_ULPALWAYSON */
/* Description: Keep DVDD_0V9 ULP regulator on at all times */

/* Bit 0 : ULP always on */
#define REGULATORS_VREGNETWORK_ULPALWAYSON_ULPALWAYSON_Pos (0UL) /*!< Position of ULPALWAYSON field. */
#define REGULATORS_VREGNETWORK_ULPALWAYSON_ULPALWAYSON_Msk (0x1UL << REGULATORS_VREGNETWORK_ULPALWAYSON_ULPALWAYSON_Pos) /*!< Bit mask of ULPALWAYSON field. */
#define REGULATORS_VREGNETWORK_ULPALWAYSON_ULPALWAYSON_Disabled (0UL) /*!< DVDD_0V9 ULP regulator turned off in LDO modes */
#define REGULATORS_VREGNETWORK_ULPALWAYSON_ULPALWAYSON_Enabled (1UL) /*!< DVDD_0V9 ULP regulator always on */

/* Register: REGULATORS_VREGNETWORK_ENFORCEPWRREGMODE */
/* Description: Enable forcing of power mode in power regulator */

/* Bit 0 : Enable forcing of power mode in power regulator */
#define REGULATORS_VREGNETWORK_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Pos (0UL) /*!< Position of ENFORCEPWRREGMODE field. */
#define REGULATORS_VREGNETWORK_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Msk (0x1UL << REGULATORS_VREGNETWORK_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Pos) /*!< Bit mask of ENFORCEPWRREGMODE field. */
#define REGULATORS_VREGNETWORK_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Disabled (0UL) /*!< Pwr regulator forcing off */
#define REGULATORS_VREGNETWORK_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Enabled (1UL) /*!< Pwr regulator mode forced to value given by FORCEREGMODE */

/* Register: REGULATORS_VREGNETWORK_FORCEREGMODE */
/* Description: 3-bit backdoor register for manual selection of power mode */

