adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Bits 2..0 : Force Regulator Mode to value */
#define REGULATORS_VREGNETWORK_FORCEREGMODE_FORCEREGMODE_Pos (0UL) /*!< Position of FORCEREGMODE field. */
#define REGULATORS_VREGNETWORK_FORCEREGMODE_FORCEREGMODE_Msk (0x7UL << REGULATORS_VREGNETWORK_FORCEREGMODE_FORCEREGMODE_Pos) /*!< Bit mask of FORCEREGMODE field. */
#define REGULATORS_VREGNETWORK_FORCEREGMODE_FORCEREGMODE_Ext (0UL) /*!< Forceo external */
#define REGULATORS_VREGNETWORK_FORCEREGMODE_FORCEREGMODE_ULP (1UL) /*!< Force ULP mode */
#define REGULATORS_VREGNETWORK_FORCEREGMODE_FORCEREGMODE_LDO (2UL) /*!< Force LDO mode */
#define REGULATORS_VREGNETWORK_FORCEREGMODE_FORCEREGMODE_DCDC (3UL) /*!< Force DCDC mode */
#define REGULATORS_VREGNETWORK_FORCEREGMODE_FORCEREGMODE_REF (4UL) /*!< Force REF mode */

/* Register: REGULATORS_VREGNETWORK_CURRENTPWRREGMODE */
/* Description: Current mode in the power regulator */

/* Bits 3..0 : Current mode in the power regulator */
#define REGULATORS_VREGNETWORK_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Pos (0UL) /*!< Position of CURRENTPWRREGMODE field. */
#define REGULATORS_VREGNETWORK_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Msk (0xFUL << REGULATORS_VREGNETWORK_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Pos) /*!< Bit mask of CURRENTPWRREGMODE field. */
#define REGULATORS_VREGNETWORK_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Ext (0UL) /*!< External */
#define REGULATORS_VREGNETWORK_CURRENTPWRREGMODE_CURRENTPWRREGMODE_DCDC (2UL) /*!< DCDC */
#define REGULATORS_VREGNETWORK_CURRENTPWRREGMODE_CURRENTPWRREGMODE_REF (3UL) /*!< REF */
#define REGULATORS_VREGNETWORK_CURRENTPWRREGMODE_CURRENTPWRREGMODE_LDO (4UL) /*!< ULP DCDC */
#define REGULATORS_VREGNETWORK_CURRENTPWRREGMODE_CURRENTPWRREGMODE_LDO_DCDC (6UL) /*!< LDO DCDC */
#define REGULATORS_VREGNETWORK_CURRENTPWRREGMODE_CURRENTPWRREGMODE_LDO_REF (7UL) /*!< LDO REF */
#define REGULATORS_VREGNETWORK_CURRENTPWRREGMODE_CURRENTPWRREGMODE_ULP (8UL) /*!< ULP */
#define REGULATORS_VREGNETWORK_CURRENTPWRREGMODE_CURRENTPWRREGMODE_DCDC_ULP (10UL) /*!< ULP DCDC */
#define REGULATORS_VREGNETWORK_CURRENTPWRREGMODE_CURRENTPWRREGMODE_REF_ULP (11UL) /*!< REF ULP */
#define REGULATORS_VREGNETWORK_CURRENTPWRREGMODE_CURRENTPWRREGMODE_ULP_LDO (12UL) /*!< ULP DCDC */

/* Register: REGULATORS_VREGNETWORK_PWRREGICMPTIMER */
/* Description: Control the stay-alive time for the VREGNETWORK current comparator */

/* Bits 15..0 :   */
#define REGULATORS_VREGNETWORK_PWRREGICMPTIMER_COUNT_Pos (0UL) /*!< Position of COUNT field. */
#define REGULATORS_VREGNETWORK_PWRREGICMPTIMER_COUNT_Msk (0xFFFFUL << REGULATORS_VREGNETWORK_PWRREGICMPTIMER_COUNT_Pos) /*!< Bit mask of COUNT field. */

/* Register: REGULATORS_VREGNETWORK_TESTLOAD */
/* Description: Test load setting for VREGNETWORK. */

/* Bits 2..0 : Output load configuration (for test purposes) */
#define REGULATORS_VREGNETWORK_TESTLOAD_TESTLOAD_Pos (0UL) /*!< Position of TESTLOAD field. */
#define REGULATORS_VREGNETWORK_TESTLOAD_TESTLOAD_Msk (0x7UL << REGULATORS_VREGNETWORK_TESTLOAD_TESTLOAD_Pos) /*!< Bit mask of TESTLOAD field. */
#define REGULATORS_VREGNETWORK_TESTLOAD_TESTLOAD_NormalOperation (0UL) /*!< Normal operation (default) */
#define REGULATORS_VREGNETWORK_TESTLOAD_TESTLOAD_1mATestLoad (1UL) /*!< 1mA test load */
#define REGULATORS_VREGNETWORK_TESTLOAD_TESTLOAD_20mATestLoad (2UL) /*!< 20mA test load */

/* Register: REGULATORS_VREGNETWORK_ULPCAL */
/* Description: Calibration  VREGNETWORK ULP regulator */

/* Bits 3..0 : Calibration value */
#define REGULATORS_VREGNETWORK_ULPCAL_CAL_Pos (0UL) /*!< Position of CAL field. */
#define REGULATORS_VREGNETWORK_ULPCAL_CAL_Msk (0xFUL << REGULATORS_VREGNETWORK_ULPCAL_CAL_Pos) /*!< Bit mask of CAL field. */

/* Register: REGULATORS_VREGNETWORK_ULPICMPCAL */
/* Description: Calibration of current comparator on DVDD_0V9 ULP regulator */

/* Bits 2..0 :   */
#define REGULATORS_VREGNETWORK_ULPICMPCAL_CAL_Pos (0UL) /*!< Position of CAL field. */
#define REGULATORS_VREGNETWORK_ULPICMPCAL_CAL_Msk (0x7UL << REGULATORS_VREGNETWORK_ULPICMPCAL_CAL_Pos) /*!< Bit mask of CAL field. */

/* Register: REGULATORS_VREGNETWORK_BYPASS */
/* Description: Bypass control for VREGNETWORK */

/* Bit 0 : Bypass control */
#define REGULATORS_VREGNETWORK_BYPASS_CAL_Pos (0UL) /*!< Position of CAL field. */
#define REGULATORS_VREGNETWORK_BYPASS_CAL_Msk (0x1UL << REGULATORS_VREGNETWORK_BYPASS_CAL_Pos) /*!< Bit mask of CAL field. */
#define REGULATORS_VREGNETWORK_BYPASS_CAL_NormalMode (0UL) /*!< Normal operation (default) */
#define REGULATORS_VREGNETWORK_BYPASS_CAL_BypassMode (1UL) /*!< Output voltage is 30mV lower than input voltage */

/* Register: REGULATORS_VREGH_DCDCEN */
/* Description: DC/DC enable register for VREGH. */

/* Bit 0 : Enable or disable DC/DC converter */
#define REGULATORS_VREGH_DCDCEN_DCDCEN_Pos (0UL) /*!< Position of DCDCEN field. */
#define REGULATORS_VREGH_DCDCEN_DCDCEN_Msk (0x1UL << REGULATORS_VREGH_DCDCEN_DCDCEN_Pos) /*!< Bit mask of DCDCEN field. */
#define REGULATORS_VREGH_DCDCEN_DCDCEN_Disabled (0UL) /*!< Disable */
#define REGULATORS_VREGH_DCDCEN_DCDCEN_Enabled (1UL) /*!< Enable */

/* Register: REGULATORS_VREGH_BUCKCAL */
/* Description: BUCK_VIO output voltage fine calibration */

/* Bits 4..0 : BUCK_VIO output voltage fine calibration - connected to  BUCKVIO_CAL_0V9[4:0] */
#define REGULATORS_VREGH_BUCKCAL_BUCKCAL_Pos (0UL) /*!< Position of BUCKCAL field. */
#define REGULATORS_VREGH_BUCKCAL_BUCKCAL_Msk (0x1FUL << REGULATORS_VREGH_BUCKCAL_BUCKCAL_Pos) /*!< Bit mask of BUCKCAL field. */

/* Register: REGULATORS_VREGH_ULPICMPTRIM */
/* Description: Trimming of VREG_VIO_ULP load current measurement */

/* Bits 1..0 : Trimming of VREG_VIO_ULP load current measurement */
#define REGULATORS_VREGH_ULPICMPTRIM_ULPICMPTRIM_Pos (0UL) /*!< Position of ULPICMPTRIM field. */
#define REGULATORS_VREGH_ULPICMPTRIM_ULPICMPTRIM_Msk (0x3UL << REGULATORS_VREGH_ULPICMPTRIM_ULPICMPTRIM_Pos) /*!< Bit mask of ULPICMPTRIM field. */
#define REGULATORS_VREGH_ULPICMPTRIM_ULPICMPTRIM_m30pcnt (0UL) /*!< -30 percent */
#define REGULATORS_VREGH_ULPICMPTRIM_ULPICMPTRIM_m10pcnt (1UL) /*!< -10 percent (default) */
#define REGULATORS_VREGH_ULPICMPTRIM_ULPICMPTRIM_p10pcnt (2UL) /*!< +10 percent */
#define REGULATORS_VREGH_ULPICMPTRIM_ULPICMPTRIM_p30pcnt (3UL) /*!< +30 percent */

/* Register: REGULATORS_VREGH_VREGICMPTRIM */
/* Description: Trimming of VREG_VIO load current measurement */

/* Bits 1..0 : Trimming of VREG_VIO load current measurement */
#define REGULATORS_VREGH_VREGICMPTRIM_VREGICMPTRIM_Pos (0UL) /*!< Position of VREGICMPTRIM field. */
#define REGULATORS_VREGH_VREGICMPTRIM_VREGICMPTRIM_Msk (0x3UL << REGULATORS_VREGH_VREGICMPTRIM_VREGICMPTRIM_Pos) /*!< Bit mask of VREGICMPTRIM field. */
#define REGULATORS_VREGH_VREGICMPTRIM_VREGICMPTRIM_m30pcnt (0UL) /*!< -30 percent */
#define REGULATORS_VREGH_VREGICMPTRIM_VREGICMPTRIM_m10pcnt (1UL) /*!< -10 percent (default) */
#define REGULATORS_VREGH_VREGICMPTRIM_VREGICMPTRIM_p10pcnt (2UL) /*!< +10 percent */
#define REGULATORS_VREGH_VREGICMPTRIM_VREGICMPTRIM_p30pcnt (3UL) /*!< +30 percent */

