adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Register: REGULATORS_VREGH_BUCKCALILIM */
/* Description: BUCK_VIO output current limit calibration */

/* Bits 1..0 : BUCK_VIO output current limit calibration */
#define REGULATORS_VREGH_BUCKCALILIM_BUCKCALILIM_Pos (0UL) /*!< Position of BUCKCALILIM field. */
#define REGULATORS_VREGH_BUCKCALILIM_BUCKCALILIM_Msk (0x3UL << REGULATORS_VREGH_BUCKCALILIM_BUCKCALILIM_Pos) /*!< Bit mask of BUCKCALILIM field. */
#define REGULATORS_VREGH_BUCKCALILIM_BUCKCALILIM_65mA (0UL) /*!< 65mA (default) */
#define REGULATORS_VREGH_BUCKCALILIM_BUCKCALILIM_m20pcnt (1UL) /*!< -20 percent */
#define REGULATORS_VREGH_BUCKCALILIM_BUCKCALILIM_p40pcnt (2UL) /*!< +40 percent */
#define REGULATORS_VREGH_BUCKCALILIM_BUCKCALILIM_p20pcnt (3UL) /*!< +20 percent */

/* Register: REGULATORS_VREGH_EXTSUPPLY */
/* Description: Enable external circuitry to be supplied from VDD pin). */

/* Bit 0 : Shadow register for corresponding register in UICR. Enable external circuitry to be supplied from VDD pin (output of REG0 stage). Applicable in 'High voltage mode' only. */
#define REGULATORS_VREGH_EXTSUPPLY_EXTSUPPLY_Pos (0UL) /*!< Position of EXTSUPPLY field. */
#define REGULATORS_VREGH_EXTSUPPLY_EXTSUPPLY_Msk (0x1UL << REGULATORS_VREGH_EXTSUPPLY_EXTSUPPLY_Pos) /*!< Bit mask of EXTSUPPLY field. */
#define REGULATORS_VREGH_EXTSUPPLY_EXTSUPPLY_Disabled (0UL) /*!< No current can be drawn from the VDD pin. */
#define REGULATORS_VREGH_EXTSUPPLY_EXTSUPPLY_Enabled (1UL) /*!< It is allowed to supply external circuitry from the VDD pin. */

/* Register: REGULATORS_VREGH_RFSHBUCKCAL */
/* Description: Refresh mode trim register */

/* Bits 1..0 : Refresh mode trim register */
#define REGULATORS_VREGH_RFSHBUCKCAL_RFSHBUCKCAL_Pos (0UL) /*!< Position of RFSHBUCKCAL field. */
#define REGULATORS_VREGH_RFSHBUCKCAL_RFSHBUCKCAL_Msk (0x3UL << REGULATORS_VREGH_RFSHBUCKCAL_RFSHBUCKCAL_Pos) /*!< Bit mask of RFSHBUCKCAL field. */

/* Register: REGULATORS_VREGH_RFSHTRIMULP */
/* Description: Trimmed value for refresh mode counter for automatic mode change to ULP */

/* Bits 5..0 : Trimmed value for refresh mode counter for automatic mode change to ULP */
#define REGULATORS_VREGH_RFSHTRIMULP_RFSHTRIMULP_Pos (0UL) /*!< Position of RFSHTRIMULP field. */
#define REGULATORS_VREGH_RFSHTRIMULP_RFSHTRIMULP_Msk (0x3FUL << REGULATORS_VREGH_RFSHTRIMULP_RFSHTRIMULP_Pos) /*!< Bit mask of RFSHTRIMULP field. */

/* Register: REGULATORS_VREGH_RFSHTRIMPWM */
/* Description: Trimmed value for refresh mode counter for automatic mode change to PWM */

/* Bits 5..0 : Trimmed value for refresh mode counter for automatic mode change to PWM */
#define REGULATORS_VREGH_RFSHTRIMPWM_RFSHTRIMPWM_Pos (0UL) /*!< Position of RFSHTRIMPWM field. */
#define REGULATORS_VREGH_RFSHTRIMPWM_RFSHTRIMPWM_Msk (0x3FUL << REGULATORS_VREGH_RFSHTRIMPWM_RFSHTRIMPWM_Pos) /*!< Bit mask of RFSHTRIMPWM field. */

/* Register: REGULATORS_VREGH_RFSHPOLLSEL */
/* Description: Programmable value for counter for poller in PWM mode */

/* Bits 1..0 : Programmable value for counter for poller in PWM mode */
#define REGULATORS_VREGH_RFSHPOLLSEL_RFSHPOLLSEL_Pos (0UL) /*!< Position of RFSHPOLLSEL field. */
#define REGULATORS_VREGH_RFSHPOLLSEL_RFSHPOLLSEL_Msk (0x3UL << REGULATORS_VREGH_RFSHPOLLSEL_RFSHPOLLSEL_Pos) /*!< Bit mask of RFSHPOLLSEL field. */
#define REGULATORS_VREGH_RFSHPOLLSEL_RFSHPOLLSEL_256us (0UL) /*!< 256 us polling interval */
#define REGULATORS_VREGH_RFSHPOLLSEL_RFSHPOLLSEL_512us (1UL) /*!< 512 us polling interval */
#define REGULATORS_VREGH_RFSHPOLLSEL_RFSHPOLLSEL_1024us (2UL) /*!< 1024 us polling interval */
#define REGULATORS_VREGH_RFSHPOLLSEL_RFSHPOLLSEL_Disabled (3UL) /*!< Disabled */

/* Register: REGULATORS_VREGH_BUCKCKDIV2 */
/* Description: Sets BUCK_VIO switching frequency */

/* Bit 0 : Sets BUCK_VIO switching frequency */
#define REGULATORS_VREGH_BUCKCKDIV2_BUCKCKDIV2_Pos (0UL) /*!< Position of BUCKCKDIV2 field. */
#define REGULATORS_VREGH_BUCKCKDIV2_BUCKCKDIV2_Msk (0x1UL << REGULATORS_VREGH_BUCKCKDIV2_BUCKCKDIV2_Pos) /*!< Bit mask of BUCKCKDIV2 field. */
#define REGULATORS_VREGH_BUCKCKDIV2_BUCKCKDIV2_8MHz (0UL) /*!< 8 MHz */
#define REGULATORS_VREGH_BUCKCKDIV2_BUCKCKDIV2_4MHz (1UL) /*!< 4 MHz */

/* Register: REGULATORS_VREGH_POWERCFG */
/* Description: Spare configuration signals for POWER_VIO */

/* Bits 7..0 : Spare configuration signals for POWER_VIO */
#define REGULATORS_VREGH_POWERCFG_POWERCFG_Pos (0UL) /*!< Position of POWERCFG field. */
#define REGULATORS_VREGH_POWERCFG_POWERCFG_Msk (0xFFUL << REGULATORS_VREGH_POWERCFG_POWERCFG_Pos) /*!< Bit mask of POWERCFG field. */

/* Register: REGULATORS_VREGH_LDO2ULPOVERLAPTRIM */
/* Description: Programmable value for VREGH ldo to ulp overlay counter */

/* Bit 0 : Programmable value for VREGH LDO to ULP overlay counter. Value loaded from FICR-&gt;CHIPCONF06.LDOTOULPOVERLAPTRIM */
#define REGULATORS_VREGH_LDO2ULPOVERLAPTRIM_LDO2ULPOVERLAPTRIM_Pos (0UL) /*!< Position of LDO2ULPOVERLAPTRIM field. */
#define REGULATORS_VREGH_LDO2ULPOVERLAPTRIM_LDO2ULPOVERLAPTRIM_Msk (0x1UL << REGULATORS_VREGH_LDO2ULPOVERLAPTRIM_LDO2ULPOVERLAPTRIM_Pos) /*!< Bit mask of LDO2ULPOVERLAPTRIM field. */
#define REGULATORS_VREGH_LDO2ULPOVERLAPTRIM_LDO2ULPOVERLAPTRIM_512us (0UL) /*!< 512 us overlay */
#define REGULATORS_VREGH_LDO2ULPOVERLAPTRIM_LDO2ULPOVERLAPTRIM_1024us (1UL) /*!< 1024 us overlay */

/* Register: REGULATORS_VREGH_ULPDISABLE */
/* Description: VREGH ULP mode */

/* Bit 0 : VREGH ULP mode */
#define REGULATORS_VREGH_ULPDISABLE_ULPDISABLE_Pos (0UL) /*!< Position of ULPDISABLE field. */
#define REGULATORS_VREGH_ULPDISABLE_ULPDISABLE_Msk (0x1UL << REGULATORS_VREGH_ULPDISABLE_ULPDISABLE_Pos) /*!< Bit mask of ULPDISABLE field. */
#define REGULATORS_VREGH_ULPDISABLE_ULPDISABLE_Auto (0UL) /*!< ULP mode is allowed */
#define REGULATORS_VREGH_ULPDISABLE_ULPDISABLE_Disabled (1UL) /*!< ULP mode is not allowed */

/* Register: REGULATORS_VREGH_CURRENTPWRREGMODE */
/* Description: Current mode in the VREGH  power regulator */

/* Bits 3..0 : Current mode in the VREGH  power regulator */
#define REGULATORS_VREGH_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Pos (0UL) /*!< Position of CURRENTPWRREGMODE field. */
#define REGULATORS_VREGH_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Msk (0xFUL << REGULATORS_VREGH_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Pos) /*!< Bit mask of CURRENTPWRREGMODE field. */

/* Register: REGULATORS_VREGH_VDDHDETECTED */
/* Description: Vddh is detected */

/* Bit 0 : Vddh is detected */
#define REGULATORS_VREGH_VDDHDETECTED_VDDHDETECTED_Pos (0UL) /*!< Position of VDDHDETECTED field. */
#define REGULATORS_VREGH_VDDHDETECTED_VDDHDETECTED_Msk (0x1UL << REGULATORS_VREGH_VDDHDETECTED_VDDHDETECTED_Pos) /*!< Bit mask of VDDHDETECTED field. */
#define REGULATORS_VREGH_VDDHDETECTED_VDDHDETECTED_NotPresent (0UL) /*!< Vddh not detected */
#define REGULATORS_VREGH_VDDHDETECTED_VDDHDETECTED_Present (1UL) /*!< Vddh detected */

/* Register: REGULATORS_VREGH_EXTSILENTEN */
/* Description: Enable 'silent' external DCDC supply. This register only applies when DCDC is enabled in the VREGHDCDCEN register. Entering 'silent mode' forbids the use of DCDC refresh mode internally in VREGH. */

/* Bit 0 : Enable 'silent' external DCDC supply. */
#define REGULATORS_VREGH_EXTSILENTEN_EXTSILENTEN_Pos (0UL) /*!< Position of EXTSILENTEN field. */
#define REGULATORS_VREGH_EXTSILENTEN_EXTSILENTEN_Msk (0x1UL << REGULATORS_VREGH_EXTSILENTEN_EXTSILENTEN_Pos) /*!< Bit mask of EXTSILENTEN field. */
#define REGULATORS_VREGH_EXTSILENTEN_EXTSILENTEN_Disabled (0UL) /*!< Disable */
#define REGULATORS_VREGH_EXTSILENTEN_EXTSILENTEN_Enabled (1UL) /*!< Enable */

/* Register: REGULATORS_VREGH_ENFORCEPWRREGMODE */
/* Description: Enable forcing of power mode in power regulator */

/* Bit 0 : Enable forcing of power mode in power regulator */
#define REGULATORS_VREGH_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Pos (0UL) /*!< Position of ENFORCEPWRREGMODE field. */
#define REGULATORS_VREGH_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Msk (0x1UL << REGULATORS_VREGH_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Pos) /*!< Bit mask of ENFORCEPWRREGMODE field. */
#define REGULATORS_VREGH_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Disabled (0UL) /*!< Pwr regulator forcing off */
#define REGULATORS_VREGH_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Enabled (1UL) /*!< Pwr regulator mode forced to value given by FORCEREGMODE */

/* Register: REGULATORS_VREGH_FORCEREGMODE */
/* Description: Force a specific  power mode for VREGH */

/* Bits 7..0 : Force a specific  power mode */
#define REGULATORS_VREGH_FORCEREGMODE_FORCEPWRREGMODE_Pos (0UL) /*!< Position of FORCEPWRREGMODE field. */
#define REGULATORS_VREGH_FORCEREGMODE_FORCEPWRREGMODE_Msk (0xFFUL << REGULATORS_VREGH_FORCEREGMODE_FORCEPWRREGMODE_Pos) /*!< Bit mask of FORCEPWRREGMODE field. */

