adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Register: SPU_DPPI_PERM */
/* Description: Description cluster: Select between Secure and Non-Secure attribute  for the DPPI channels. Only a Secure peripheral can publish or subscribe to a channel with Secure attribute set. */

/* Bit 31 : Select secure attribute. */
#define SPU_DPPI_PERM_CHANNEL31_Pos (31UL) /*!< Position of CHANNEL31 field. */
#define SPU_DPPI_PERM_CHANNEL31_Msk (0x1UL << SPU_DPPI_PERM_CHANNEL31_Pos) /*!< Bit mask of CHANNEL31 field. */
#define SPU_DPPI_PERM_CHANNEL31_NonSecure (0UL) /*!< Channel31 has its Non-Secure attribute set */
#define SPU_DPPI_PERM_CHANNEL31_Secure (1UL) /*!< Channel31 has its Secure attribute set */

/* Bit 30 : Select secure attribute. */
#define SPU_DPPI_PERM_CHANNEL30_Pos (30UL) /*!< Position of CHANNEL30 field. */
#define SPU_DPPI_PERM_CHANNEL30_Msk (0x1UL << SPU_DPPI_PERM_CHANNEL30_Pos) /*!< Bit mask of CHANNEL30 field. */
#define SPU_DPPI_PERM_CHANNEL30_NonSecure (0UL) /*!< Channel30 has its Non-Secure attribute set */
#define SPU_DPPI_PERM_CHANNEL30_Secure (1UL) /*!< Channel30 has its Secure attribute set */

/* Bit 29 : Select secure attribute. */
#define SPU_DPPI_PERM_CHANNEL29_Pos (29UL) /*!< Position of CHANNEL29 field. */
#define SPU_DPPI_PERM_CHANNEL29_Msk (0x1UL << SPU_DPPI_PERM_CHANNEL29_Pos) /*!< Bit mask of CHANNEL29 field. */
#define SPU_DPPI_PERM_CHANNEL29_NonSecure (0UL) /*!< Channel29 has its Non-Secure attribute set */
#define SPU_DPPI_PERM_CHANNEL29_Secure (1UL) /*!< Channel29 has its Secure attribute set */

/* Bit 28 : Select secure attribute. */
#define SPU_DPPI_PERM_CHANNEL28_Pos (28UL) /*!< Position of CHANNEL28 field. */
#define SPU_DPPI_PERM_CHANNEL28_Msk (0x1UL << SPU_DPPI_PERM_CHANNEL28_Pos) /*!< Bit mask of CHANNEL28 field. */
#define SPU_DPPI_PERM_CHANNEL28_NonSecure (0UL) /*!< Channel28 has its Non-Secure attribute set */
#define SPU_DPPI_PERM_CHANNEL28_Secure (1UL) /*!< Channel28 has its Secure attribute set */

/* Bit 27 : Select secure attribute. */
#define SPU_DPPI_PERM_CHANNEL27_Pos (27UL) /*!< Position of CHANNEL27 field. */
#define SPU_DPPI_PERM_CHANNEL27_Msk (0x1UL << SPU_DPPI_PERM_CHANNEL27_Pos) /*!< Bit mask of CHANNEL27 field. */
#define SPU_DPPI_PERM_CHANNEL27_NonSecure (0UL) /*!< Channel27 has its Non-Secure attribute set */
#define SPU_DPPI_PERM_CHANNEL27_Secure (1UL) /*!< Channel27 has its Secure attribute set */

/* Bit 26 : Select secure attribute. */
#define SPU_DPPI_PERM_CHANNEL26_Pos (26UL) /*!< Position of CHANNEL26 field. */
#define SPU_DPPI_PERM_CHANNEL26_Msk (0x1UL << SPU_DPPI_PERM_CHANNEL26_Pos) /*!< Bit mask of CHANNEL26 field. */
#define SPU_DPPI_PERM_CHANNEL26_NonSecure (0UL) /*!< Channel26 has its Non-Secure attribute set */
#define SPU_DPPI_PERM_CHANNEL26_Secure (1UL) /*!< Channel26 has its Secure attribute set */

/* Bit 25 : Select secure attribute. */
#define SPU_DPPI_PERM_CHANNEL25_Pos (25UL) /*!< Position of CHANNEL25 field. */
#define SPU_DPPI_PERM_CHANNEL25_Msk (0x1UL << SPU_DPPI_PERM_CHANNEL25_Pos) /*!< Bit mask of CHANNEL25 field. */
#define SPU_DPPI_PERM_CHANNEL25_NonSecure (0UL) /*!< Channel25 has its Non-Secure attribute set */
#define SPU_DPPI_PERM_CHANNEL25_Secure (1UL) /*!< Channel25 has its Secure attribute set */

/* Bit 24 : Select secure attribute. */
#define SPU_DPPI_PERM_CHANNEL24_Pos (24UL) /*!< Position of CHANNEL24 field. */
#define SPU_DPPI_PERM_CHANNEL24_Msk (0x1UL << SPU_DPPI_PERM_CHANNEL24_Pos) /*!< Bit mask of CHANNEL24 field. */
#define SPU_DPPI_PERM_CHANNEL24_NonSecure (0UL) /*!< Channel24 has its Non-Secure attribute set */
#define SPU_DPPI_PERM_CHANNEL24_Secure (1UL) /*!< Channel24 has its Secure attribute set */

/* Bit 23 : Select secure attribute. */
#define SPU_DPPI_PERM_CHANNEL23_Pos (23UL) /*!< Position of CHANNEL23 field. */
#define SPU_DPPI_PERM_CHANNEL23_Msk (0x1UL << SPU_DPPI_PERM_CHANNEL23_Pos) /*!< Bit mask of CHANNEL23 field. */
#define SPU_DPPI_PERM_CHANNEL23_NonSecure (0UL) /*!< Channel23 has its Non-Secure attribute set */
#define SPU_DPPI_PERM_CHANNEL23_Secure (1UL) /*!< Channel23 has its Secure attribute set */

/* Bit 22 : Select secure attribute. */
#define SPU_DPPI_PERM_CHANNEL22_Pos (22UL) /*!< Position of CHANNEL22 field. */
#define SPU_DPPI_PERM_CHANNEL22_Msk (0x1UL << SPU_DPPI_PERM_CHANNEL22_Pos) /*!< Bit mask of CHANNEL22 field. */
#define SPU_DPPI_PERM_CHANNEL22_NonSecure (0UL) /*!< Channel22 has its Non-Secure attribute set */
#define SPU_DPPI_PERM_CHANNEL22_Secure (1UL) /*!< Channel22 has its Secure attribute set */

/* Bit 21 : Select secure attribute. */
#define SPU_DPPI_PERM_CHANNEL21_Pos (21UL) /*!< Position of CHANNEL21 field. */
#define SPU_DPPI_PERM_CHANNEL21_Msk (0x1UL << SPU_DPPI_PERM_CHANNEL21_Pos) /*!< Bit mask of CHANNEL21 field. */
#define SPU_DPPI_PERM_CHANNEL21_NonSecure (0UL) /*!< Channel21 has its Non-Secure attribute set */
#define SPU_DPPI_PERM_CHANNEL21_Secure (1UL) /*!< Channel21 has its Secure attribute set */

/* Bit 20 : Select secure attribute. */
#define SPU_DPPI_PERM_CHANNEL20_Pos (20UL) /*!< Position of CHANNEL20 field. */
#define SPU_DPPI_PERM_CHANNEL20_Msk (0x1UL << SPU_DPPI_PERM_CHANNEL20_Pos) /*!< Bit mask of CHANNEL20 field. */
#define SPU_DPPI_PERM_CHANNEL20_NonSecure (0UL) /*!< Channel20 has its Non-Secure attribute set */
#define SPU_DPPI_PERM_CHANNEL20_Secure (1UL) /*!< Channel20 has its Secure attribute set */

/* Bit 19 : Select secure attribute. */
#define SPU_DPPI_PERM_CHANNEL19_Pos (19UL) /*!< Position of CHANNEL19 field. */
#define SPU_DPPI_PERM_CHANNEL19_Msk (0x1UL << SPU_DPPI_PERM_CHANNEL19_Pos) /*!< Bit mask of CHANNEL19 field. */
#define SPU_DPPI_PERM_CHANNEL19_NonSecure (0UL) /*!< Channel19 has its Non-Secure attribute set */
#define SPU_DPPI_PERM_CHANNEL19_Secure (1UL) /*!< Channel19 has its Secure attribute set */

/* Bit 18 : Select secure attribute. */
#define SPU_DPPI_PERM_CHANNEL18_Pos (18UL) /*!< Position of CHANNEL18 field. */
#define SPU_DPPI_PERM_CHANNEL18_Msk (0x1UL << SPU_DPPI_PERM_CHANNEL18_Pos) /*!< Bit mask of CHANNEL18 field. */
#define SPU_DPPI_PERM_CHANNEL18_NonSecure (0UL) /*!< Channel18 has its Non-Secure attribute set */
#define SPU_DPPI_PERM_CHANNEL18_Secure (1UL) /*!< Channel18 has its Secure attribute set */

/* Bit 17 : Select secure attribute. */
#define SPU_DPPI_PERM_CHANNEL17_Pos (17UL) /*!< Position of CHANNEL17 field. */
#define SPU_DPPI_PERM_CHANNEL17_Msk (0x1UL << SPU_DPPI_PERM_CHANNEL17_Pos) /*!< Bit mask of CHANNEL17 field. */
#define SPU_DPPI_PERM_CHANNEL17_NonSecure (0UL) /*!< Channel17 has its Non-Secure attribute set */
#define SPU_DPPI_PERM_CHANNEL17_Secure (1UL) /*!< Channel17 has its Secure attribute set */

