adamkondraciuk/nrfx/mdk/nrf5340_bitfields.h
/* Bit 0 : Hardware flow control */
#define UARTE_CONFIG_HWFC_Pos (0UL) /*!< Position of HWFC field. */
#define UARTE_CONFIG_HWFC_Msk (0x1UL << UARTE_CONFIG_HWFC_Pos) /*!< Bit mask of HWFC field. */
#define UARTE_CONFIG_HWFC_Disabled (0UL) /*!< Disabled */
#define UARTE_CONFIG_HWFC_Enabled (1UL) /*!< Enabled */

/* Register: UARTE_POWER */
/* Description: Peripheral power control */

/* Bit 0 : Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the peripheral off and then back on again. */
#define UARTE_POWER_POWER_Pos (0UL) /*!< Position of POWER field. */
#define UARTE_POWER_POWER_Msk (0x1UL << UARTE_POWER_POWER_Pos) /*!< Bit mask of POWER field. */
#define UARTE_POWER_POWER_Disabled (0UL) /*!< Peripheral is powered off */
#define UARTE_POWER_POWER_Enabled (1UL) /*!< Peripheral is powered on */


/* Peripheral: UICR */
/* Description: User Information Configuration Registers User Information Configuration Registers */

/* Register: UICR_APPROTECT */
/* Description: Access port protection */

/* Bits 31..0 : Blocks debugger read/write access to all CPU registers and
          memory mapped addresses except for the Control Access Port
          registers. */
#define UICR_APPROTECT_PALL_Pos (0UL) /*!< Position of PALL field. */
#define UICR_APPROTECT_PALL_Msk (0xFFFFFFFFUL << UICR_APPROTECT_PALL_Pos) /*!< Bit mask of PALL field. */
#define UICR_APPROTECT_PALL_Enabled (0x00000000UL) /*!< Enable */
#define UICR_APPROTECT_PALL_Disabled (0xFFFFFFFFUL) /*!< Disable */

/* Register: UICR_EXTSUPPLY */
/* Description: Enable external circuitry to be supplied from VDD pin. Applicable in 'High voltage mode' only. */

/* Bit 0 : Enable external circuitry to be supplied from VDD pin (output of VREGH stage). */
#define UICR_EXTSUPPLY_EXTSUPPLY_Pos (0UL) /*!< Position of EXTSUPPLY field. */
#define UICR_EXTSUPPLY_EXTSUPPLY_Msk (0x1UL << UICR_EXTSUPPLY_EXTSUPPLY_Pos) /*!< Bit mask of EXTSUPPLY field. */
#define UICR_EXTSUPPLY_EXTSUPPLY_Enabled (0UL) /*!< It is allowed to supply external circuitry from the VDD pin. */
#define UICR_EXTSUPPLY_EXTSUPPLY_Disabled (1UL) /*!< No current can be drawn from the VDD pin. */

/* Register: UICR_VREGHVOUT */
/* Description: GPIO reference voltage / external output supply voltage in 'High voltage mode'. */

/* Bits 2..0 : VREGH regulator output voltage. The maximum output voltage from this stage is given as VDDH - VEXDIF. */
#define UICR_VREGHVOUT_VREGHVOUT_Pos (0UL) /*!< Position of VREGHVOUT field. */
#define UICR_VREGHVOUT_VREGHVOUT_Msk (0x7UL << UICR_VREGHVOUT_VREGHVOUT_Pos) /*!< Bit mask of VREGHVOUT field. */
#define UICR_VREGHVOUT_VREGHVOUT_1V8 (0UL) /*!< 1.8 V */
#define UICR_VREGHVOUT_VREGHVOUT_2V1 (1UL) /*!< 2.1 V */
#define UICR_VREGHVOUT_VREGHVOUT_2V4 (2UL) /*!< 2.4 V */
#define UICR_VREGHVOUT_VREGHVOUT_2V7 (3UL) /*!< 2.7 V */
#define UICR_VREGHVOUT_VREGHVOUT_3V0 (4UL) /*!< 3.0 V */
#define UICR_VREGHVOUT_VREGHVOUT_3V3 (5UL) /*!< 3.3 V */
#define UICR_VREGHVOUT_VREGHVOUT_DEFAULT (7UL) /*!< Default voltage: 1.8 V */

/* Register: UICR_XOSC32MCAPSEL */
/* Description: Capacitor selection and enable on XC1 and XC2 */

/* Bit 8 : Enable on-chip capacitors on XC1 and XC2, value given by CAPVAL */
#define UICR_XOSC32MCAPSEL_ENABLE_Pos (8UL) /*!< Position of ENABLE field. */
#define UICR_XOSC32MCAPSEL_ENABLE_Msk (0x1UL << UICR_XOSC32MCAPSEL_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define UICR_XOSC32MCAPSEL_ENABLE_Enabled (0UL) /*!< Capacitor enabled */
#define UICR_XOSC32MCAPSEL_ENABLE_Disabled (1UL) /*!< Capacitor disabled (use external caps) */

/* Bits 4..0 : Capacitance value for built-in load caps on XC1 and XC2 */
#define UICR_XOSC32MCAPSEL_CAPVALUE_Pos (0UL) /*!< Position of CAPVALUE field. */
#define UICR_XOSC32MCAPSEL_CAPVALUE_Msk (0x1FUL << UICR_XOSC32MCAPSEL_CAPVALUE_Pos) /*!< Bit mask of CAPVALUE field. */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C070 (0UL) /*!< Set cap to 7.0 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C075 (1UL) /*!< Set cap to 7.5 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C080 (2UL) /*!< Set cap to 8.0 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C085 (3UL) /*!< Set cap to 8.5 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C090 (4UL) /*!< Set cap to 9.0 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C095 (5UL) /*!< Set cap to 9.5 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C100 (6UL) /*!< Set cap to 10.0 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C105 (7UL) /*!< Set cap to 10.5 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C110 (8UL) /*!< Set cap to 11.0 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C115 (9UL) /*!< Set cap to 11.5 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C120 (10UL) /*!< Set cap to 12.0 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C125 (11UL) /*!< Set cap to 12.5 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C130 (12UL) /*!< Set cap to 13.0 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C135 (13UL) /*!< Set cap to 13.5 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C140 (14UL) /*!< Set cap to 14.0 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C145 (15UL) /*!< Set cap to 14.5 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C150 (16UL) /*!< Set cap to 15.0 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C155 (17UL) /*!< Set cap to 15.5 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C160 (18UL) /*!< Set cap to 16.0 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C165 (19UL) /*!< Set cap to 16.5 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C170 (20UL) /*!< Set cap to 17.0 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C175 (21UL) /*!< Set cap to 17.5 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C180 (22UL) /*!< Set cap to 18.0 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C185 (23UL) /*!< Set cap to 18.5 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C190 (24UL) /*!< Set cap to 19.0 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C195 (25UL) /*!< Set cap to 19.5 pF */
#define UICR_XOSC32MCAPSEL_CAPVALUE_C200 (26UL) /*!< Set cap to 20.0 pF */

/* Register: UICR_SECUREAPPROTECT */
/* Description: Secure Access port protection */

/* Bits 31..0 : Blocks debugger read/write access to all secure CPU registers and secure
          memory mapped addresses */
#define UICR_SECUREAPPROTECT_PALL_Pos (0UL) /*!< Position of PALL field. */
#define UICR_SECUREAPPROTECT_PALL_Msk (0xFFFFFFFFUL << UICR_SECUREAPPROTECT_PALL_Pos) /*!< Bit mask of PALL field. */
#define UICR_SECUREAPPROTECT_PALL_Enabled (0x00000000UL) /*!< Enable */
#define UICR_SECUREAPPROTECT_PALL_Disabled (0xFFFFFFFFUL) /*!< Disable */

